var citys_tree_obj=[
{
    "text": "全国",
    "lnglat": "10444800,3514368",
    "expanded":true,
    "children": [
        {
            "text": "北京市",
            "id": "110000",
            "lnglat": "11640969,3989945",
            "children": [
                {
                    "text": "东城区",
                    "id": "110101",
                    "lnglat": "11641006,3992520",
                    "leaf": true
                },
                {
                    "text": "西城区",
                    "id": "110102",
                    "lnglat": "11636037,3991056",
                    "leaf": true
                },
                {
                    "text": "崇文区",
                    "id": "110103",
                    "lnglat": "11642543,3988642",
                    "leaf": true
                },
                {
                    "text": "宣武区",
                    "id": "110104",
                    "lnglat": "11638295,3987536",
                    "leaf": true
                },
                {
                    "text": "朝阳区",
                    "id": "110105",
                    "lnglat": "11643778,3991982",
                    "leaf": true
                },
                {
                    "text": "丰台区",
                    "id": "110106",
                    "lnglat": "11628276,3984665",
                    "leaf": true
                },
                {
                    "text": "石景山区",
                    "id": "110107",
                    "lnglat": "11616360,3992315",
                    "leaf": true
                },
                {
                    "text": "海淀区",
                    "id": "110108",
                    "lnglat": "11630407,3998044",
                    "leaf": true
                },
                {
                    "text": "门头沟区",
                    "id": "110109",
                    "lnglat": "11609208,3993574",
                    "leaf": true
                },
                {
                    "text": "房山区",
                    "id": "110111",
                    "lnglat": "11597790,3969711",
                    "leaf": true
                },
                {
                    "text": "通州区",
                    "id": "110112",
                    "lnglat": "11665261,3990171",
                    "leaf": true
                },
                {
                    "text": "顺义区",
                    "id": "110113",
                    "lnglat": "11664799,4013007",
                    "leaf": true
                },
                {
                    "text": "昌平区",
                    "id": "110114",
                    "lnglat": "11622684,4021593",
                    "leaf": true
                },
                {
                    "text": "大兴区",
                    "id": "110115",
                    "lnglat": "11633354,3972612",
                    "leaf": true
                },
                {
                    "text": "怀柔区",
                    "id": "110116",
                    "lnglat": "11662914,4031491",
                    "leaf": true
                },
                {
                    "text": "平谷区",
                    "id": "110117",
                    "lnglat": "11711460,4013940",
                    "leaf": true
                },
                {
                    "text": "密云县",
                    "id": "110228",
                    "lnglat": "11684143,4037395",
                    "leaf": true
                },
                {
                    "text": "延庆县",
                    "id": "110229",
                    "lnglat": "11596666,4045646",
                    "leaf": true
                }
            ]
        },
        {
            "text": "天津市",
            "id": "120000",
            "lnglat": "11720010,3914307",
            "children": [
                {
                    "text": "和平区",
                    "id": "120101",
                    "lnglat": "11717699,3912381",
                    "leaf": true
                },
                {
                    "text": "河东区",
                    "id": "120102",
                    "lnglat": "11721628,3913625",
                    "leaf": true
                },
                {
                    "text": "河西区",
                    "id": "120103",
                    "lnglat": "11721404,3911447",
                    "leaf": true
                },
                {
                    "text": "南开区",
                    "id": "120104",
                    "lnglat": "11715462,3914383",
                    "leaf": true
                },
                {
                    "text": "河北区",
                    "id": "120105",
                    "lnglat": "11719771,3914983",
                    "leaf": true
                },
                {
                    "text": "红桥区",
                    "id": "120106",
                    "lnglat": "11713406,3915833",
                    "leaf": true
                },
                {
                    "text": "塘沽区",
                    "id": "120107",
                    "lnglat": "11765279,3901786",
                    "leaf": true
                },
                {
                    "text": "汉沽区",
                    "id": "120108",
                    "lnglat": "11779657,3924566",
                    "leaf": true
                },
                {
                    "text": "大港区",
                    "id": "120109",
                    "lnglat": "11742316,3883640",
                    "leaf": true
                },
                {
                    "text": "东丽区",
                    "id": "120110",
                    "lnglat": "11731065,3908972",
                    "leaf": true
                },
                {
                    "text": "西青区",
                    "id": "120111",
                    "lnglat": "11700824,3913749",
                    "leaf": true
                },
                {
                    "text": "津南区",
                    "id": "120112",
                    "lnglat": "11738519,3898684",
                    "leaf": true
                },
                {
                    "text": "北辰区",
                    "id": "120113",
                    "lnglat": "11713610,3923043",
                    "leaf": true
                },
                {
                    "text": "武清区",
                    "id": "120114",
                    "lnglat": "11706600,3937139",
                    "leaf": true
                },
                {
                    "text": "宝坻区",
                    "id": "120115",
                    "lnglat": "11731216,3972107",
                    "leaf": true
                },
                {
                    "text": "宁河县",
                    "id": "120221",
                    "lnglat": "11782303,3932640",
                    "leaf": true
                },
                {
                    "text": "静海县",
                    "id": "120223",
                    "lnglat": "11691905,3893408",
                    "leaf": true
                },
                {
                    "text": "蓟县",
                    "id": "120225",
                    "lnglat": "11739661,4004460",
                    "leaf": true
                }
            ]
        },
        {
            "text": "河北省",
            "id": "130000",
            "lnglat": "11452002,3804502",
            "children": [
                {
                    "text": "石家庄市",
                    "id": "130100",
                    "lnglat": "11452002,3804502",
                    "children": [
                        {
                            "text": "长安区",
                            "id": "130102",
                            "lnglat": "11455945,3804236",
                            "leaf": true
                        },
                        {
                            "text": "桥东区",
                            "id": "130103",
                            "lnglat": "11449822,3804643",
                            "leaf": true
                        },
                        {
                            "text": "桥西区",
                            "id": "130104",
                            "lnglat": "11446336,3803139",
                            "leaf": true
                        },
                        {
                            "text": "新华区",
                            "id": "130105",
                            "lnglat": "11445769,3804990",
                            "leaf": true
                        },
                        {
                            "text": "井陉矿区",
                            "id": "130107",
                            "lnglat": "11404092,3807886",
                            "leaf": true
                        },
                        {
                            "text": "裕华区",
                            "id": "130108",
                            "lnglat": "11444460,3804227",
                            "leaf": true
                        },
                        {
                            "text": "井陉县",
                            "id": "130121",
                            "lnglat": "11413957,3803264",
                            "leaf": true
                        },
                        {
                            "text": "正定县",
                            "id": "130123",
                            "lnglat": "11456808,3814215",
                            "leaf": true
                        },
                        {
                            "text": "栾城县",
                            "id": "130124",
                            "lnglat": "11464814,3788400",
                            "leaf": true
                        },
                        {
                            "text": "行唐县",
                            "id": "130125",
                            "lnglat": "11454501,3843544",
                            "leaf": true
                        },
                        {
                            "text": "灵寿县",
                            "id": "130126",
                            "lnglat": "11436447,3830465",
                            "leaf": true
                        },
                        {
                            "text": "高邑县",
                            "id": "130127",
                            "lnglat": "11459937,3760251",
                            "leaf": true
                        },
                        {
                            "text": "深泽县",
                            "id": "130128",
                            "lnglat": "11519408,3818185",
                            "leaf": true
                        },
                        {
                            "text": "赞皇县",
                            "id": "130129",
                            "lnglat": "11438479,3766091",
                            "leaf": true
                        },
                        {
                            "text": "无极县",
                            "id": "130130",
                            "lnglat": "11497011,3817551",
                            "leaf": true
                        },
                        {
                            "text": "平山县",
                            "id": "130131",
                            "lnglat": "11418650,3825573",
                            "leaf": true
                        },
                        {
                            "text": "元氏县",
                            "id": "130132",
                            "lnglat": "11451403,3774984",
                            "leaf": true
                        },
                        {
                            "text": "赵县",
                            "id": "130133",
                            "lnglat": "11476495,3775028",
                            "leaf": true
                        },
                        {
                            "text": "辛集市",
                            "id": "130181",
                            "lnglat": "11521538,3790435",
                            "leaf": true
                        },
                        {
                            "text": "藁城市",
                            "id": "130182",
                            "lnglat": "11483858,3803312",
                            "leaf": true
                        },
                        {
                            "text": "晋州市",
                            "id": "130183",
                            "lnglat": "11503760,3802775",
                            "leaf": true
                        },
                        {
                            "text": "新乐市",
                            "id": "130184",
                            "lnglat": "11468079,3834343",
                            "leaf": true
                        },
                        {
                            "text": "鹿泉市",
                            "id": "130185",
                            "lnglat": "11430955,3808407",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "保定市",
                    "id": "130600",
                    "lnglat": "11549815,3887262",
                    "children": [
                        {
                            "text": "新市区",
                            "id": "130602",
                            "lnglat": "11545279,3887658",
                            "leaf": true
                        },
                        {
                            "text": "北市区",
                            "id": "130603",
                            "lnglat": "11549116,3888208",
                            "leaf": true
                        },
                        {
                            "text": "南市区",
                            "id": "130604",
                            "lnglat": "11552244,3885365",
                            "leaf": true
                        },
                        {
                            "text": "满城县",
                            "id": "130621",
                            "lnglat": "11531997,3894862",
                            "leaf": true
                        },
                        {
                            "text": "清苑县",
                            "id": "130622",
                            "lnglat": "11548528,3876918",
                            "leaf": true
                        },
                        {
                            "text": "涞水县",
                            "id": "130623",
                            "lnglat": "11570566,3939293",
                            "leaf": true
                        },
                        {
                            "text": "阜平县",
                            "id": "130624",
                            "lnglat": "11418934,3884771",
                            "leaf": true
                        },
                        {
                            "text": "徐水县",
                            "id": "130625",
                            "lnglat": "11565009,3902009",
                            "leaf": true
                        },
                        {
                            "text": "定兴县",
                            "id": "130626",
                            "lnglat": "11577975,3927259",
                            "leaf": true
                        },
                        {
                            "text": "唐县",
                            "id": "130627",
                            "lnglat": "11497400,3874652",
                            "leaf": true
                        },
                        {
                            "text": "高阳县",
                            "id": "130628",
                            "lnglat": "11577379,3868525",
                            "leaf": true
                        },
                        {
                            "text": "容城县",
                            "id": "130629",
                            "lnglat": "11586035,3905055",
                            "leaf": true
                        },
                        {
                            "text": "涞源县",
                            "id": "130630",
                            "lnglat": "11464713,3935454",
                            "leaf": true
                        },
                        {
                            "text": "望都县",
                            "id": "130631",
                            "lnglat": "11514324,3870339",
                            "leaf": true
                        },
                        {
                            "text": "安新县",
                            "id": "130632",
                            "lnglat": "11592734,3892193",
                            "leaf": true
                        },
                        {
                            "text": "易县",
                            "id": "130633",
                            "lnglat": "11549105,3935237",
                            "leaf": true
                        },
                        {
                            "text": "曲阳县",
                            "id": "130634",
                            "lnglat": "11469607,3862031",
                            "leaf": true
                        },
                        {
                            "text": "蠡县",
                            "id": "130635",
                            "lnglat": "11558039,3848369",
                            "leaf": true
                        },
                        {
                            "text": "顺平县",
                            "id": "130636",
                            "lnglat": "11513305,3883465",
                            "leaf": true
                        },
                        {
                            "text": "博野县",
                            "id": "130637",
                            "lnglat": "11546163,3845764",
                            "leaf": true
                        },
                        {
                            "text": "雄县",
                            "id": "130638",
                            "lnglat": "11609854,3896824",
                            "leaf": true
                        },
                        {
                            "text": "涿州市",
                            "id": "130681",
                            "lnglat": "11597567,3948737",
                            "leaf": true
                        },
                        {
                            "text": "定州市",
                            "id": "130682",
                            "lnglat": "11497636,3852024",
                            "leaf": true
                        },
                        {
                            "text": "安国市",
                            "id": "130683",
                            "lnglat": "11531203,3841534",
                            "leaf": true
                        },
                        {
                            "text": "高碑店市",
                            "id": "130684",
                            "lnglat": "11585579,3932911",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "唐山市",
                    "id": "130200",
                    "lnglat": "11820599,3963617",
                    "children": [
                        {
                            "text": "路南区",
                            "id": "130202",
                            "lnglat": "11814795,3962373",
                            "leaf": true
                        },
                        {
                            "text": "路北区",
                            "id": "130203",
                            "lnglat": "11819410,3962307",
                            "leaf": true
                        },
                        {
                            "text": "古冶区",
                            "id": "130204",
                            "lnglat": "11842136,3972620",
                            "leaf": true
                        },
                        {
                            "text": "开平区",
                            "id": "130205",
                            "lnglat": "11826933,3968169",
                            "leaf": true
                        },
                        {
                            "text": "丰南区",
                            "id": "130207",
                            "lnglat": "11811043,3956012",
                            "leaf": true
                        },
                        {
                            "text": "丰润区",
                            "id": "130208",
                            "lnglat": "11812148,3982476",
                            "leaf": true
                        },
                        {
                            "text": "滦县",
                            "id": "130223",
                            "lnglat": "11875241,3973681",
                            "leaf": true
                        },
                        {
                            "text": "滦南县",
                            "id": "130224",
                            "lnglat": "11867528,3950706",
                            "leaf": true
                        },
                        {
                            "text": "乐亭县",
                            "id": "130225",
                            "lnglat": "11890544,3942208",
                            "leaf": true
                        },
                        {
                            "text": "迁西县",
                            "id": "130227",
                            "lnglat": "11830610,4014419",
                            "leaf": true
                        },
                        {
                            "text": "玉田县",
                            "id": "130229",
                            "lnglat": "11775836,3988256",
                            "leaf": true
                        },
                        {
                            "text": "唐海县",
                            "id": "130230",
                            "lnglat": "11862335,3927814",
                            "leaf": true
                        },
                        {
                            "text": "遵化市",
                            "id": "130281",
                            "lnglat": "11796116,4018017",
                            "leaf": true
                        },
                        {
                            "text": "迁安市",
                            "id": "130283",
                            "lnglat": "11869306,4001073",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "张家口市",
                    "id": "130700",
                    "lnglat": "11488464,4081864",
                    "children": [
                        {
                            "text": "桥东区",
                            "id": "130702",
                            "lnglat": "11488813,4078734",
                            "leaf": true
                        },
                        {
                            "text": "桥西区",
                            "id": "130703",
                            "lnglat": "11486318,4081817",
                            "leaf": true
                        },
                        {
                            "text": "宣化区",
                            "id": "130705",
                            "lnglat": "11505573,4059899",
                            "leaf": true
                        },
                        {
                            "text": "下花园区",
                            "id": "130706",
                            "lnglat": "11528704,4048512",
                            "leaf": true
                        },
                        {
                            "text": "宣化县",
                            "id": "130721",
                            "lnglat": "11510061,4049064",
                            "leaf": true
                        },
                        {
                            "text": "张北县",
                            "id": "130722",
                            "lnglat": "11471110,4115558",
                            "leaf": true
                        },
                        {
                            "text": "康保县",
                            "id": "130723",
                            "lnglat": "11460834,4185598",
                            "leaf": true
                        },
                        {
                            "text": "沽源县",
                            "id": "130724",
                            "lnglat": "11568717,4167019",
                            "leaf": true
                        },
                        {
                            "text": "尚义县",
                            "id": "130725",
                            "lnglat": "11396048,4107393",
                            "leaf": true
                        },
                        {
                            "text": "蔚县",
                            "id": "130726",
                            "lnglat": "11457193,3984644",
                            "leaf": true
                        },
                        {
                            "text": "阳原县",
                            "id": "130727",
                            "lnglat": "11415843,4011653",
                            "leaf": true
                        },
                        {
                            "text": "怀安县",
                            "id": "130728",
                            "lnglat": "11444928,4067308",
                            "leaf": true
                        },
                        {
                            "text": "万全县",
                            "id": "130729",
                            "lnglat": "11472519,4075348",
                            "leaf": true
                        },
                        {
                            "text": "怀来县",
                            "id": "130730",
                            "lnglat": "11550755,4039861",
                            "leaf": true
                        },
                        {
                            "text": "涿鹿县",
                            "id": "130731",
                            "lnglat": "11522915,4037197",
                            "leaf": true
                        },
                        {
                            "text": "赤城县",
                            "id": "130732",
                            "lnglat": "11582278,4091100",
                            "leaf": true
                        },
                        {
                            "text": "崇礼县",
                            "id": "130733",
                            "lnglat": "11527346,4097291",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "邢台市",
                    "id": "130500",
                    "lnglat": "11449854,3707036",
                    "children": [
                        {
                            "text": "桥东区",
                            "id": "130502",
                            "lnglat": "11450205,3706849",
                            "leaf": true
                        },
                        {
                            "text": "桥西区",
                            "id": "130503",
                            "lnglat": "11446212,3705939",
                            "leaf": true
                        },
                        {
                            "text": "邢台县",
                            "id": "130521",
                            "lnglat": "11450931,3708667",
                            "leaf": true
                        },
                        {
                            "text": "临城县",
                            "id": "130522",
                            "lnglat": "11449793,3743953",
                            "leaf": true
                        },
                        {
                            "text": "内丘县",
                            "id": "130523",
                            "lnglat": "11451829,3729422",
                            "leaf": true
                        },
                        {
                            "text": "柏乡县",
                            "id": "130524",
                            "lnglat": "11466499,3748713",
                            "leaf": true
                        },
                        {
                            "text": "隆尧县",
                            "id": "130525",
                            "lnglat": "11476715,3735152",
                            "leaf": true
                        },
                        {
                            "text": "任县",
                            "id": "130526",
                            "lnglat": "11467902,3712627",
                            "leaf": true
                        },
                        {
                            "text": "南和县",
                            "id": "130527",
                            "lnglat": "11468860,3699549",
                            "leaf": true
                        },
                        {
                            "text": "宁晋县",
                            "id": "130528",
                            "lnglat": "11492310,3761763",
                            "leaf": true
                        },
                        {
                            "text": "巨鹿县",
                            "id": "130529",
                            "lnglat": "11502679,3721522",
                            "leaf": true
                        },
                        {
                            "text": "新河县",
                            "id": "130530",
                            "lnglat": "11524662,3752936",
                            "leaf": true
                        },
                        {
                            "text": "广宗县",
                            "id": "130531",
                            "lnglat": "11514418,3707155",
                            "leaf": true
                        },
                        {
                            "text": "平乡县",
                            "id": "130532",
                            "lnglat": "11502842,3706990",
                            "leaf": true
                        },
                        {
                            "text": "威县",
                            "id": "130533",
                            "lnglat": "11527179,3698662",
                            "leaf": true
                        },
                        {
                            "text": "清河县",
                            "id": "130534",
                            "lnglat": "11565514,3707356",
                            "leaf": true
                        },
                        {
                            "text": "临西县",
                            "id": "130535",
                            "lnglat": "11548929,3686342",
                            "leaf": true
                        },
                        {
                            "text": "南宫市",
                            "id": "130581",
                            "lnglat": "11538366,3735885",
                            "leaf": true
                        },
                        {
                            "text": "沙河市",
                            "id": "130582",
                            "lnglat": "11449720,3685585",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "秦皇岛市",
                    "id": "130300",
                    "lnglat": "11958080,3994656",
                    "children": [
                        {
                            "text": "海港区",
                            "id": "130302",
                            "lnglat": "11960036,3992026",
                            "leaf": true
                        },
                        {
                            "text": "山海关区",
                            "id": "130303",
                            "lnglat": "11973678,4000496",
                            "leaf": true
                        },
                        {
                            "text": "北戴河区",
                            "id": "130304",
                            "lnglat": "11948165,3981819",
                            "leaf": true
                        },
                        {
                            "text": "青龙满族自治县",
                            "id": "130321",
                            "lnglat": "11893965,4041171",
                            "leaf": true
                        },
                        {
                            "text": "昌黎县",
                            "id": "130322",
                            "lnglat": "11916080,3970814",
                            "leaf": true
                        },
                        {
                            "text": "抚宁县",
                            "id": "130323",
                            "lnglat": "11922760,3988597",
                            "leaf": true
                        },
                        {
                            "text": "卢龙县",
                            "id": "130324",
                            "lnglat": "11886539,3988054",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "廊坊市",
                    "id": "131000",
                    "lnglat": "11670080,3951937",
                    "children": [
                        {
                            "text": "安次区",
                            "id": "131002",
                            "lnglat": "11669716,3951920",
                            "leaf": true
                        },
                        {
                            "text": "广阳区",
                            "id": "131003",
                            "lnglat": "11670453,3952163",
                            "leaf": true
                        },
                        {
                            "text": "固安县",
                            "id": "131022",
                            "lnglat": "11630032,3943525",
                            "leaf": true
                        },
                        {
                            "text": "永清县",
                            "id": "131023",
                            "lnglat": "11649271,3931504",
                            "leaf": true
                        },
                        {
                            "text": "香河县",
                            "id": "131024",
                            "lnglat": "11699656,3976081",
                            "leaf": true
                        },
                        {
                            "text": "大城县",
                            "id": "131025",
                            "lnglat": "11662944,3869514",
                            "leaf": true
                        },
                        {
                            "text": "文安县",
                            "id": "131026",
                            "lnglat": "11645307,3886576",
                            "leaf": true
                        },
                        {
                            "text": "大厂回族自治县",
                            "id": "131028",
                            "lnglat": "11698154,3988397",
                            "leaf": true
                        },
                        {
                            "text": "霸州市",
                            "id": "131081",
                            "lnglat": "11639650,3910581",
                            "leaf": true
                        },
                        {
                            "text": "三河市",
                            "id": "131082",
                            "lnglat": "11706878,3998084",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "衡水市",
                    "id": "131100",
                    "lnglat": "11568640,3773130",
                    "children": [
                        {
                            "text": "桃城区",
                            "id": "131102",
                            "lnglat": "11566918,3773501",
                            "leaf": true
                        },
                        {
                            "text": "枣强县",
                            "id": "131121",
                            "lnglat": "11572929,3750890",
                            "leaf": true
                        },
                        {
                            "text": "武邑县",
                            "id": "131122",
                            "lnglat": "11589520,3780302",
                            "leaf": true
                        },
                        {
                            "text": "武强县",
                            "id": "131123",
                            "lnglat": "11596993,3803818",
                            "leaf": true
                        },
                        {
                            "text": "饶阳县",
                            "id": "131124",
                            "lnglat": "11573530,3824269",
                            "leaf": true
                        },
                        {
                            "text": "安平县",
                            "id": "131125",
                            "lnglat": "11551901,3823623",
                            "leaf": true
                        },
                        {
                            "text": "故城县",
                            "id": "131126",
                            "lnglat": "11594313,3733643",
                            "leaf": true
                        },
                        {
                            "text": "景县",
                            "id": "131127",
                            "lnglat": "11626215,3769100",
                            "leaf": true
                        },
                        {
                            "text": "阜城县",
                            "id": "131128",
                            "lnglat": "11614530,3787007",
                            "leaf": true
                        },
                        {
                            "text": "冀州市",
                            "id": "131181",
                            "lnglat": "11556232,3756336",
                            "leaf": true
                        },
                        {
                            "text": "深州市",
                            "id": "131182",
                            "lnglat": "11555236,3801178",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "邯郸市",
                    "id": "130400",
                    "lnglat": "11449076,3661044",
                    "children": [
                        {
                            "text": "邯山区",
                            "id": "130402",
                            "lnglat": "11447753,3659989",
                            "leaf": true
                        },
                        {
                            "text": "丛台区",
                            "id": "130403",
                            "lnglat": "11448744,3661831",
                            "leaf": true
                        },
                        {
                            "text": "复兴区",
                            "id": "130404",
                            "lnglat": "11445358,3661101",
                            "leaf": true
                        },
                        {
                            "text": "峰峰矿区",
                            "id": "130406",
                            "lnglat": "11420678,3641972",
                            "leaf": true
                        },
                        {
                            "text": "邯郸县",
                            "id": "130421",
                            "lnglat": "11451383,3655500",
                            "leaf": true
                        },
                        {
                            "text": "临漳县",
                            "id": "130423",
                            "lnglat": "11460001,3634143",
                            "leaf": true
                        },
                        {
                            "text": "成安县",
                            "id": "130424",
                            "lnglat": "11470434,3643037",
                            "leaf": true
                        },
                        {
                            "text": "大名县",
                            "id": "130425",
                            "lnglat": "11516200,3629115",
                            "leaf": true
                        },
                        {
                            "text": "涉县",
                            "id": "130426",
                            "lnglat": "11367847,3656075",
                            "leaf": true
                        },
                        {
                            "text": "磁县",
                            "id": "130427",
                            "lnglat": "11437170,3635080",
                            "leaf": true
                        },
                        {
                            "text": "肥乡县",
                            "id": "130428",
                            "lnglat": "11482950,3655280",
                            "leaf": true
                        },
                        {
                            "text": "永年县",
                            "id": "130429",
                            "lnglat": "11448130,3678904",
                            "leaf": true
                        },
                        {
                            "text": "邱县",
                            "id": "130430",
                            "lnglat": "11517368,3683182",
                            "leaf": true
                        },
                        {
                            "text": "鸡泽县",
                            "id": "130431",
                            "lnglat": "11486819,3692886",
                            "leaf": true
                        },
                        {
                            "text": "广平县",
                            "id": "130432",
                            "lnglat": "11491236,3648079",
                            "leaf": true
                        },
                        {
                            "text": "馆陶县",
                            "id": "130433",
                            "lnglat": "11529918,3653594",
                            "leaf": true
                        },
                        {
                            "text": "魏县",
                            "id": "130434",
                            "lnglat": "11494357,3637823",
                            "leaf": true
                        },
                        {
                            "text": "曲周县",
                            "id": "130435",
                            "lnglat": "11493212,3678956",
                            "leaf": true
                        },
                        {
                            "text": "武安市",
                            "id": "130481",
                            "lnglat": "11421085,3669621",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "承德市",
                    "id": "130800",
                    "lnglat": "11793583,4096843",
                    "children": [
                        {
                            "text": "双桥区",
                            "id": "130802",
                            "lnglat": "11792197,4098292",
                            "leaf": true
                        },
                        {
                            "text": "双滦区",
                            "id": "130803",
                            "lnglat": "11779354,4095735",
                            "leaf": true
                        },
                        {
                            "text": "鹰手营子矿区",
                            "id": "130804",
                            "lnglat": "11765279,4054500",
                            "leaf": true
                        },
                        {
                            "text": "承德县",
                            "id": "130821",
                            "lnglat": "11816758,4076823",
                            "leaf": true
                        },
                        {
                            "text": "兴隆县",
                            "id": "130822",
                            "lnglat": "11750476,4041916",
                            "leaf": true
                        },
                        {
                            "text": "平泉县",
                            "id": "130823",
                            "lnglat": "11867702,4101130",
                            "leaf": true
                        },
                        {
                            "text": "滦平县",
                            "id": "130824",
                            "lnglat": "11732916,4093435",
                            "leaf": true
                        },
                        {
                            "text": "隆化县",
                            "id": "130825",
                            "lnglat": "11772333,4131149",
                            "leaf": true
                        },
                        {
                            "text": "丰宁满族自治县",
                            "id": "130826",
                            "lnglat": "11664623,4119967",
                            "leaf": true
                        },
                        {
                            "text": "宽城满族自治县",
                            "id": "130827",
                            "lnglat": "11848633,4060695",
                            "leaf": true
                        },
                        {
                            "text": "围场满族蒙古族自治县",
                            "id": "130828",
                            "lnglat": "11752387,4209751",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "沧州市",
                    "id": "130900",
                    "lnglat": "11684271,3830781",
                    "children": [
                        {
                            "text": "新华区",
                            "id": "130902",
                            "lnglat": "11686073,3831388",
                            "leaf": true
                        },
                        {
                            "text": "运河区",
                            "id": "130903",
                            "lnglat": "11685145,3831294",
                            "leaf": true
                        },
                        {
                            "text": "沧县",
                            "id": "130921",
                            "lnglat": "11684145,3829414",
                            "leaf": true
                        },
                        {
                            "text": "青县",
                            "id": "130922",
                            "lnglat": "11681908,3857932",
                            "leaf": true
                        },
                        {
                            "text": "东光县",
                            "id": "130923",
                            "lnglat": "11652961,3788216",
                            "leaf": true
                        },
                        {
                            "text": "海兴县",
                            "id": "130924",
                            "lnglat": "11749342,3814386",
                            "leaf": true
                        },
                        {
                            "text": "盐山县",
                            "id": "130925",
                            "lnglat": "11722313,3805813",
                            "leaf": true
                        },
                        {
                            "text": "肃宁县",
                            "id": "130926",
                            "lnglat": "11583275,3843428",
                            "leaf": true
                        },
                        {
                            "text": "南皮县",
                            "id": "130927",
                            "lnglat": "11670602,3804207",
                            "leaf": true
                        },
                        {
                            "text": "吴桥县",
                            "id": "130928",
                            "lnglat": "11639220,3762576",
                            "leaf": true
                        },
                        {
                            "text": "献县",
                            "id": "130929",
                            "lnglat": "11611433,3818699",
                            "leaf": true
                        },
                        {
                            "text": "孟村回族自治县",
                            "id": "130930",
                            "lnglat": "11709137,3806231",
                            "leaf": true
                        },
                        {
                            "text": "泊头市",
                            "id": "130981",
                            "lnglat": "11655439,3807556",
                            "leaf": true
                        },
                        {
                            "text": "任丘市",
                            "id": "130982",
                            "lnglat": "11608400,3870767",
                            "leaf": true
                        },
                        {
                            "text": "黄骅市",
                            "id": "130983",
                            "lnglat": "11734873,3837349",
                            "leaf": true
                        },
                        {
                            "text": "河间市",
                            "id": "130984",
                            "lnglat": "11605394,3843789",
                            "leaf": true
                        }
                    ]
                }
            ]
        },
        {
            "text": "山西省",
            "id": "140000",
            "lnglat": "11259966,3787319",
            "children": [
                {
                    "text": "太原市",
                    "id": "140100",
                    "lnglat": "11259966,3787319",
                    "children": [
                        {
                            "text": "小店区",
                            "id": "140105",
                            "lnglat": "11256798,3773745",
                            "leaf": true
                        },
                        {
                            "text": "迎泽区",
                            "id": "140106",
                            "lnglat": "11258960,3785579",
                            "leaf": true
                        },
                        {
                            "text": "杏花岭区",
                            "id": "140107",
                            "lnglat": "11255786,3791691",
                            "leaf": true
                        },
                        {
                            "text": "尖草坪区",
                            "id": "140108",
                            "lnglat": "11251842,3795580",
                            "leaf": true
                        },
                        {
                            "text": "万柏林区",
                            "id": "140109",
                            "lnglat": "11253382,3788909",
                            "leaf": true
                        },
                        {
                            "text": "晋源区",
                            "id": "140110",
                            "lnglat": "11248433,3778380",
                            "leaf": true
                        },
                        {
                            "text": "清徐县",
                            "id": "140121",
                            "lnglat": "11235419,3762908",
                            "leaf": true
                        },
                        {
                            "text": "阳曲县",
                            "id": "140122",
                            "lnglat": "11270512,3806053",
                            "leaf": true
                        },
                        {
                            "text": "娄烦县",
                            "id": "140123",
                            "lnglat": "11177844,3807420",
                            "leaf": true
                        },
                        {
                            "text": "古交市",
                            "id": "140181",
                            "lnglat": "11216290,3791137",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "运城市",
                    "id": "140800",
                    "lnglat": "11099076,3502422",
                    "children": [
                        {
                            "text": "盐湖区",
                            "id": "140802",
                            "lnglat": "11095129,3509516",
                            "leaf": true
                        },
                        {
                            "text": "临猗县",
                            "id": "140821",
                            "lnglat": "11077161,3514917",
                            "leaf": true
                        },
                        {
                            "text": "万荣县",
                            "id": "140822",
                            "lnglat": "11083290,3541756",
                            "leaf": true
                        },
                        {
                            "text": "闻喜县",
                            "id": "140823",
                            "lnglat": "11121006,3535926",
                            "leaf": true
                        },
                        {
                            "text": "稷山县",
                            "id": "140824",
                            "lnglat": "11098638,3559179",
                            "leaf": true
                        },
                        {
                            "text": "新绛县",
                            "id": "140825",
                            "lnglat": "11122963,3561791",
                            "leaf": true
                        },
                        {
                            "text": "绛县",
                            "id": "140826",
                            "lnglat": "11156074,3549000",
                            "leaf": true
                        },
                        {
                            "text": "垣曲县",
                            "id": "140827",
                            "lnglat": "11167083,3530236",
                            "leaf": true
                        },
                        {
                            "text": "夏县",
                            "id": "140828",
                            "lnglat": "11122314,3513818",
                            "leaf": true
                        },
                        {
                            "text": "平陆县",
                            "id": "140829",
                            "lnglat": "11120920,3483641",
                            "leaf": true
                        },
                        {
                            "text": "芮城县",
                            "id": "140830",
                            "lnglat": "11068216,3469638",
                            "leaf": true
                        },
                        {
                            "text": "永济市",
                            "id": "140881",
                            "lnglat": "11044539,3486604",
                            "leaf": true
                        },
                        {
                            "text": "河津市",
                            "id": "140882",
                            "lnglat": "11068640,3558459",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "阳泉市",
                    "id": "140300",
                    "lnglat": "11357747,3786083",
                    "children": [
                        {
                            "text": "城区",
                            "id": "140302",
                            "lnglat": "11359366,3784650",
                            "leaf": true
                        },
                        {
                            "text": "矿区",
                            "id": "140303",
                            "lnglat": "11354997,3786845",
                            "leaf": true
                        },
                        {
                            "text": "郊区",
                            "id": "140311",
                            "lnglat": "11360777,3788229",
                            "leaf": true
                        },
                        {
                            "text": "平定县",
                            "id": "140321",
                            "lnglat": "11361625,3779927",
                            "leaf": true
                        },
                        {
                            "text": "盂县",
                            "id": "140322",
                            "lnglat": "11337046,3823514",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "忻州市",
                    "id": "140900",
                    "lnglat": "11273961,3840344",
                    "children": [
                        {
                            "text": "忻府区",
                            "id": "140902",
                            "lnglat": "11274622,3844042",
                            "leaf": true
                        },
                        {
                            "text": "定襄县",
                            "id": "140921",
                            "lnglat": "11295103,3849024",
                            "leaf": true
                        },
                        {
                            "text": "五台县",
                            "id": "140922",
                            "lnglat": "11323098,3872562",
                            "leaf": true
                        },
                        {
                            "text": "代县",
                            "id": "140923",
                            "lnglat": "11293722,3906423",
                            "leaf": true
                        },
                        {
                            "text": "繁峙县",
                            "id": "140924",
                            "lnglat": "11325452,3918960",
                            "leaf": true
                        },
                        {
                            "text": "宁武县",
                            "id": "140925",
                            "lnglat": "11230008,3900337",
                            "leaf": true
                        },
                        {
                            "text": "静乐县",
                            "id": "140926",
                            "lnglat": "11195543,3836482",
                            "leaf": true
                        },
                        {
                            "text": "神池县",
                            "id": "140927",
                            "lnglat": "11218773,3908532",
                            "leaf": true
                        },
                        {
                            "text": "五寨县",
                            "id": "140928",
                            "lnglat": "11183273,3889388",
                            "leaf": true
                        },
                        {
                            "text": "岢岚县",
                            "id": "140929",
                            "lnglat": "11156269,3869141",
                            "leaf": true
                        },
                        {
                            "text": "河曲县",
                            "id": "140930",
                            "lnglat": "11113156,3938061",
                            "leaf": true
                        },
                        {
                            "text": "保德县",
                            "id": "140931",
                            "lnglat": "11107786,3901717",
                            "leaf": true
                        },
                        {
                            "text": "偏关县",
                            "id": "140932",
                            "lnglat": "11148885,3943949",
                            "leaf": true
                        },
                        {
                            "text": "原平市",
                            "id": "140981",
                            "lnglat": "11272752,3872828",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "朔州市",
                    "id": "140600",
                    "lnglat": "11242729,3932968",
                    "children": [
                        {
                            "text": "朔城区",
                            "id": "140602",
                            "lnglat": "11241797,3931161",
                            "leaf": true
                        },
                        {
                            "text": "平鲁区",
                            "id": "140603",
                            "lnglat": "11228212,3952637",
                            "leaf": true
                        },
                        {
                            "text": "山阴县",
                            "id": "140621",
                            "lnglat": "11282521,3951026",
                            "leaf": true
                        },
                        {
                            "text": "应县",
                            "id": "140622",
                            "lnglat": "11317496,3956482",
                            "leaf": true
                        },
                        {
                            "text": "右玉县",
                            "id": "140623",
                            "lnglat": "11245416,3998411",
                            "leaf": true
                        },
                        {
                            "text": "怀仁县",
                            "id": "140624",
                            "lnglat": "11309832,3982477",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "吕梁市",
                    "id": "141100",
                    "lnglat": "11113590,3752305",
                    "children": [
                        {
                            "text": "离石区",
                            "id": "141102",
                            "lnglat": "11126600,3754259",
                            "leaf": true
                        },
                        {
                            "text": "文水县",
                            "id": "141121",
                            "lnglat": "11202822,3743923",
                            "leaf": true
                        },
                        {
                            "text": "交城县",
                            "id": "141122",
                            "lnglat": "11214825,3754600",
                            "leaf": true
                        },
                        {
                            "text": "兴县",
                            "id": "141123",
                            "lnglat": "11112503,3847695",
                            "leaf": true
                        },
                        {
                            "text": "临县",
                            "id": "141124",
                            "lnglat": "11098492,3795857",
                            "leaf": true
                        },
                        {
                            "text": "柳林县",
                            "id": "141125",
                            "lnglat": "11089301,3743707",
                            "leaf": true
                        },
                        {
                            "text": "石楼县",
                            "id": "141126",
                            "lnglat": "11082955,3699008",
                            "leaf": true
                        },
                        {
                            "text": "岚县",
                            "id": "141127",
                            "lnglat": "11169896,3829146",
                            "leaf": true
                        },
                        {
                            "text": "方山县",
                            "id": "141128",
                            "lnglat": "11120866,3788080",
                            "leaf": true
                        },
                        {
                            "text": "中阳县",
                            "id": "141129",
                            "lnglat": "11118143,3733939",
                            "leaf": true
                        },
                        {
                            "text": "交口县",
                            "id": "141130",
                            "lnglat": "11117528,3697979",
                            "leaf": true
                        },
                        {
                            "text": "孝义市",
                            "id": "141181",
                            "lnglat": "11177058,3714646",
                            "leaf": true
                        },
                        {
                            "text": "汾阳市",
                            "id": "141182",
                            "lnglat": "11176670,3726914",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "临汾市",
                    "id": "141000",
                    "lnglat": "11152049,3608199",
                    "children": [
                        {
                            "text": "尧都区",
                            "id": "141002",
                            "lnglat": "11145758,3612877",
                            "leaf": true
                        },
                        {
                            "text": "曲沃县",
                            "id": "141021",
                            "lnglat": "11147342,3563703",
                            "leaf": true
                        },
                        {
                            "text": "翼城县",
                            "id": "141022",
                            "lnglat": "11170652,3572395",
                            "leaf": true
                        },
                        {
                            "text": "襄汾县",
                            "id": "141023",
                            "lnglat": "11144038,3587320",
                            "leaf": true
                        },
                        {
                            "text": "洪洞县",
                            "id": "141024",
                            "lnglat": "11167467,3625604",
                            "leaf": true
                        },
                        {
                            "text": "古县",
                            "id": "141025",
                            "lnglat": "11191149,3626589",
                            "leaf": true
                        },
                        {
                            "text": "安泽县",
                            "id": "141026",
                            "lnglat": "11224469,3614649",
                            "leaf": true
                        },
                        {
                            "text": "浮山县",
                            "id": "141027",
                            "lnglat": "11184574,3596687",
                            "leaf": true
                        },
                        {
                            "text": "吉县",
                            "id": "141028",
                            "lnglat": "11065703,3609825",
                            "leaf": true
                        },
                        {
                            "text": "乡宁县",
                            "id": "141029",
                            "lnglat": "11085798,3596680",
                            "leaf": true
                        },
                        {
                            "text": "大宁县",
                            "id": "141030",
                            "lnglat": "11073649,3647127",
                            "leaf": true
                        },
                        {
                            "text": "隰县",
                            "id": "141031",
                            "lnglat": "11094857,3668710",
                            "leaf": true
                        },
                        {
                            "text": "永和县",
                            "id": "141032",
                            "lnglat": "11061009,3676320",
                            "leaf": true
                        },
                        {
                            "text": "蒲县",
                            "id": "141033",
                            "lnglat": "11109215,3641321",
                            "leaf": true
                        },
                        {
                            "text": "汾西县",
                            "id": "141034",
                            "lnglat": "11155996,3665410",
                            "leaf": true
                        },
                        {
                            "text": "侯马市",
                            "id": "141081",
                            "lnglat": "11132419,3560970",
                            "leaf": true
                        },
                        {
                            "text": "霍州市",
                            "id": "141082",
                            "lnglat": "11172321,3657953",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "晋中市",
                    "id": "140700",
                    "lnglat": "11274621,3768649",
                    "children": [
                        {
                            "text": "榆次区",
                            "id": "140702",
                            "lnglat": "11273940,3769265",
                            "leaf": true
                        },
                        {
                            "text": "榆社县",
                            "id": "140721",
                            "lnglat": "11296730,3706969",
                            "leaf": true
                        },
                        {
                            "text": "左权县",
                            "id": "140722",
                            "lnglat": "11336603,3707680",
                            "leaf": true
                        },
                        {
                            "text": "和顺县",
                            "id": "140723",
                            "lnglat": "11356202,3733139",
                            "leaf": true
                        },
                        {
                            "text": "昔阳县",
                            "id": "140724",
                            "lnglat": "11369932,3761089",
                            "leaf": true
                        },
                        {
                            "text": "寿阳县",
                            "id": "140725",
                            "lnglat": "11318083,3788435",
                            "leaf": true
                        },
                        {
                            "text": "太谷县",
                            "id": "140726",
                            "lnglat": "11255576,3743013",
                            "leaf": true
                        },
                        {
                            "text": "祁县",
                            "id": "140727",
                            "lnglat": "11230983,3735310",
                            "leaf": true
                        },
                        {
                            "text": "平遥县",
                            "id": "140728",
                            "lnglat": "11219130,3719028",
                            "leaf": true
                        },
                        {
                            "text": "灵石县",
                            "id": "140729",
                            "lnglat": "11176974,3684318",
                            "leaf": true
                        },
                        {
                            "text": "介休市",
                            "id": "140781",
                            "lnglat": "11190629,3703367",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "晋城市",
                    "id": "140500",
                    "lnglat": "11283657,3550014",
                    "children": [
                        {
                            "text": "城区",
                            "id": "140502",
                            "lnglat": "11283017,3549248",
                            "leaf": true
                        },
                        {
                            "text": "沁水县",
                            "id": "140521",
                            "lnglat": "11217723,3569073",
                            "leaf": true
                        },
                        {
                            "text": "阳城县",
                            "id": "140522",
                            "lnglat": "11241484,3548193",
                            "leaf": true
                        },
                        {
                            "text": "陵川县",
                            "id": "140524",
                            "lnglat": "11327483,3577816",
                            "leaf": true
                        },
                        {
                            "text": "泽州县",
                            "id": "140525",
                            "lnglat": "11279121,3546675",
                            "leaf": true
                        },
                        {
                            "text": "高平市",
                            "id": "140581",
                            "lnglat": "11291163,3580028",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "大同市",
                    "id": "140200",
                    "lnglat": "11328761,4009267",
                    "children": [
                        {
                            "text": "城区",
                            "id": "140202",
                            "lnglat": "11329099,4007456",
                            "leaf": true
                        },
                        {
                            "text": "矿区",
                            "id": "140203",
                            "lnglat": "11316998,4003545",
                            "leaf": true
                        },
                        {
                            "text": "南郊区",
                            "id": "140211",
                            "lnglat": "11319370,4007943",
                            "leaf": true
                        },
                        {
                            "text": "新荣区",
                            "id": "140212",
                            "lnglat": "11315920,4027568",
                            "leaf": true
                        },
                        {
                            "text": "阳高县",
                            "id": "140221",
                            "lnglat": "11375599,4036659",
                            "leaf": true
                        },
                        {
                            "text": "天镇县",
                            "id": "140222",
                            "lnglat": "11408656,4041310",
                            "leaf": true
                        },
                        {
                            "text": "广灵县",
                            "id": "140223",
                            "lnglat": "11427341,3976009",
                            "leaf": true
                        },
                        {
                            "text": "灵丘县",
                            "id": "140224",
                            "lnglat": "11422451,3944047",
                            "leaf": true
                        },
                        {
                            "text": "浑源县",
                            "id": "140225",
                            "lnglat": "11367940,3969958",
                            "leaf": true
                        },
                        {
                            "text": "左云县",
                            "id": "140226",
                            "lnglat": "11270235,4000771",
                            "leaf": true
                        },
                        {
                            "text": "大同县",
                            "id": "140227",
                            "lnglat": "11363220,4003782",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "长治市",
                    "id": "140400",
                    "lnglat": "11311301,3620428",
                    "children": [
                        {
                            "text": "城区",
                            "id": "140402",
                            "lnglat": "11311522,3620298",
                            "leaf": true
                        },
                        {
                            "text": "郊区",
                            "id": "140411",
                            "lnglat": "11314018,3620450",
                            "leaf": true
                        },
                        {
                            "text": "长治县",
                            "id": "140421",
                            "lnglat": "11302720,3606018",
                            "leaf": true
                        },
                        {
                            "text": "襄垣县",
                            "id": "140423",
                            "lnglat": "11306418,3652602",
                            "leaf": true
                        },
                        {
                            "text": "屯留县",
                            "id": "140424",
                            "lnglat": "11288303,3632411",
                            "leaf": true
                        },
                        {
                            "text": "平顺县",
                            "id": "140425",
                            "lnglat": "11343065,3620293",
                            "leaf": true
                        },
                        {
                            "text": "黎城县",
                            "id": "140426",
                            "lnglat": "11338827,3650450",
                            "leaf": true
                        },
                        {
                            "text": "壶关县",
                            "id": "140427",
                            "lnglat": "11319779,3611649",
                            "leaf": true
                        },
                        {
                            "text": "长子县",
                            "id": "140428",
                            "lnglat": "11287918,3611899",
                            "leaf": true
                        },
                        {
                            "text": "武乡县",
                            "id": "140429",
                            "lnglat": "11286535,3685019",
                            "leaf": true
                        },
                        {
                            "text": "沁县",
                            "id": "140430",
                            "lnglat": "11268994,3675604",
                            "leaf": true
                        },
                        {
                            "text": "沁源县",
                            "id": "140431",
                            "lnglat": "11233074,3649742",
                            "leaf": true
                        },
                        {
                            "text": "潞城市",
                            "id": "140481",
                            "lnglat": "11321202,3634433",
                            "leaf": true
                        }
                    ]
                }
            ]
        },
        {
            "text": "内蒙古自治区",
            "id": "150000",
            "lnglat": "11168104,4081635",
            "children": [
                {
                    "text": "呼和浩特市",
                    "id": "150100",
                    "lnglat": "11168104,4081635",
                    "children": [
                        {
                            "text": "新城区",
                            "id": "150102",
                            "lnglat": "11167406,4082200",
                            "leaf": true
                        },
                        {
                            "text": "回民区",
                            "id": "150103",
                            "lnglat": "11164979,4081218",
                            "leaf": true
                        },
                        {
                            "text": "玉泉区",
                            "id": "150104",
                            "lnglat": "11166038,4079922",
                            "leaf": true
                        },
                        {
                            "text": "赛罕区",
                            "id": "150105",
                            "lnglat": "11169504,4079215",
                            "leaf": true
                        },
                        {
                            "text": "土默特左旗",
                            "id": "150121",
                            "lnglat": "11112671,4071602",
                            "leaf": true
                        },
                        {
                            "text": "托克托县",
                            "id": "150122",
                            "lnglat": "11114852,4027731",
                            "leaf": true
                        },
                        {
                            "text": "和林格尔县",
                            "id": "150123",
                            "lnglat": "11182500,4037921",
                            "leaf": true
                        },
                        {
                            "text": "清水河县",
                            "id": "150124",
                            "lnglat": "11167414,3991046",
                            "leaf": true
                        },
                        {
                            "text": "武川县",
                            "id": "150125",
                            "lnglat": "11145155,4109107",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "兴安盟",
                    "id": "152200",
                    "lnglat": "12206656,4607160",
                    "children": [
                        {
                            "text": "乌兰浩特市",
                            "id": "152201",
                            "lnglat": "12206072,4606961",
                            "leaf": true
                        },
                        {
                            "text": "阿尔山市",
                            "id": "152202",
                            "lnglat": "11993805,4716983",
                            "leaf": true
                        },
                        {
                            "text": "科尔沁右翼前旗",
                            "id": "152221",
                            "lnglat": "12125175,4622021",
                            "leaf": true
                        },
                        {
                            "text": "科尔沁右翼中旗",
                            "id": "152222",
                            "lnglat": "12146922,4505553",
                            "leaf": true
                        },
                        {
                            "text": "扎赉特旗",
                            "id": "152223",
                            "lnglat": "12290147,4672482",
                            "leaf": true
                        },
                        {
                            "text": "突泉县",
                            "id": "152224",
                            "lnglat": "12155761,4537810",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "锡林郭勒盟",
                    "id": "152500",
                    "lnglat": "11608243,4393713",
                    "children": [
                        {
                            "text": "二连浩特市",
                            "id": "152501",
                            "lnglat": "11197313,4365241",
                            "leaf": true
                        },
                        {
                            "text": "锡林浩特市",
                            "id": "152502",
                            "lnglat": "11607542,4394371",
                            "leaf": true
                        },
                        {
                            "text": "阿巴嘎旗",
                            "id": "152522",
                            "lnglat": "11496229,4401920",
                            "leaf": true
                        },
                        {
                            "text": "苏尼特左旗",
                            "id": "152523",
                            "lnglat": "11364143,4385218",
                            "leaf": true
                        },
                        {
                            "text": "苏尼特右旗",
                            "id": "152524",
                            "lnglat": "11265143,4274383",
                            "leaf": true
                        },
                        {
                            "text": "东乌珠穆沁旗",
                            "id": "152525",
                            "lnglat": "11696921,4551317",
                            "leaf": true
                        },
                        {
                            "text": "西乌珠穆沁旗",
                            "id": "152526",
                            "lnglat": "11760912,4458616",
                            "leaf": true
                        },
                        {
                            "text": "太仆寺旗",
                            "id": "152527",
                            "lnglat": "11528060,4188908",
                            "leaf": true
                        },
                        {
                            "text": "镶黄旗",
                            "id": "152528",
                            "lnglat": "11383876,4223673",
                            "leaf": true
                        },
                        {
                            "text": "正镶白旗",
                            "id": "152529",
                            "lnglat": "11499646,4230712",
                            "leaf": true
                        },
                        {
                            "text": "正蓝旗",
                            "id": "152530",
                            "lnglat": "11599929,4225186",
                            "leaf": true
                        },
                        {
                            "text": "多伦县",
                            "id": "152531",
                            "lnglat": "11646609,4218576",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "乌兰察布市",
                    "id": "150900",
                    "lnglat": "11310717,4103318",
                    "children": [
                        {
                            "text": "集宁区",
                            "id": "150902",
                            "lnglat": "11310073,4101753",
                            "leaf": true
                        },
                        {
                            "text": "卓资县",
                            "id": "150921",
                            "lnglat": "11256245,4090486",
                            "leaf": true
                        },
                        {
                            "text": "化德县",
                            "id": "150922",
                            "lnglat": "11399837,4189326",
                            "leaf": true
                        },
                        {
                            "text": "商都县",
                            "id": "150923",
                            "lnglat": "11353709,4155644",
                            "leaf": true
                        },
                        {
                            "text": "兴和县",
                            "id": "150924",
                            "lnglat": "11388755,4087942",
                            "leaf": true
                        },
                        {
                            "text": "凉城县",
                            "id": "150925",
                            "lnglat": "11248839,4052815",
                            "leaf": true
                        },
                        {
                            "text": "察哈尔右翼前旗",
                            "id": "150926",
                            "lnglat": "11321105,4078108",
                            "leaf": true
                        },
                        {
                            "text": "察哈尔右翼中旗",
                            "id": "150927",
                            "lnglat": "11262591,4127243",
                            "leaf": true
                        },
                        {
                            "text": "察哈尔右翼后旗",
                            "id": "150928",
                            "lnglat": "11317867,4145253",
                            "leaf": true
                        },
                        {
                            "text": "四子王旗",
                            "id": "150929",
                            "lnglat": "11169397,4152280",
                            "leaf": true
                        },
                        {
                            "text": "丰镇市",
                            "id": "150981",
                            "lnglat": "11315703,4043961",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "乌海市",
                    "id": "150300",
                    "lnglat": "10681665,3968081",
                    "children": [
                        {
                            "text": "海勃湾区",
                            "id": "150302",
                            "lnglat": "10681130,3966651",
                            "leaf": true
                        },
                        {
                            "text": "海南区",
                            "id": "150303",
                            "lnglat": "10687682,3943878",
                            "leaf": true
                        },
                        {
                            "text": "乌达区",
                            "id": "150304",
                            "lnglat": "10671504,3949778",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "通辽市",
                    "id": "150500",
                    "lnglat": "12226579,4360979",
                    "children": [
                        {
                            "text": "科尔沁区",
                            "id": "150502",
                            "lnglat": "12226351,4360953",
                            "leaf": true
                        },
                        {
                            "text": "科尔沁左翼中旗",
                            "id": "150521",
                            "lnglat": "12330802,4412640",
                            "leaf": true
                        },
                        {
                            "text": "科尔沁左翼后旗",
                            "id": "150522",
                            "lnglat": "12234960,4294922",
                            "leaf": true
                        },
                        {
                            "text": "开鲁县",
                            "id": "150523",
                            "lnglat": "12130397,4359626",
                            "leaf": true
                        },
                        {
                            "text": "库伦旗",
                            "id": "150524",
                            "lnglat": "12176376,4272964",
                            "leaf": true
                        },
                        {
                            "text": "奈曼旗",
                            "id": "150525",
                            "lnglat": "12065472,4284435",
                            "leaf": true
                        },
                        {
                            "text": "扎鲁特旗",
                            "id": "150526",
                            "lnglat": "12090162,4455544",
                            "leaf": true
                        },
                        {
                            "text": "霍林郭勒市",
                            "id": "150581",
                            "lnglat": "11964856,4552795",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "呼伦贝尔市",
                    "id": "150700",
                    "lnglat": "11976371,4920731",
                    "children": [
                        {
                            "text": "海拉尔区",
                            "id": "150702",
                            "lnglat": "11975686,4921754",
                            "leaf": true
                        },
                        {
                            "text": "阿荣旗",
                            "id": "150721",
                            "lnglat": "12346171,4812486",
                            "leaf": true
                        },
                        {
                            "text": "莫力达瓦达斡尔族自治旗",
                            "id": "150722",
                            "lnglat": "12440795,4895116",
                            "leaf": true
                        },
                        {
                            "text": "鄂伦春自治旗",
                            "id": "150723",
                            "lnglat": "12372272,5058669",
                            "leaf": true
                        },
                        {
                            "text": "鄂温克族自治旗",
                            "id": "150724",
                            "lnglat": "11974400,4913944",
                            "leaf": true
                        },
                        {
                            "text": "陈巴尔虎旗",
                            "id": "150725",
                            "lnglat": "11943425,4932270",
                            "leaf": true
                        },
                        {
                            "text": "新巴尔虎左旗",
                            "id": "150726",
                            "lnglat": "11827406,4821716",
                            "leaf": true
                        },
                        {
                            "text": "新巴尔虎右旗",
                            "id": "150727",
                            "lnglat": "11681854,4866485",
                            "leaf": true
                        },
                        {
                            "text": "满洲里市",
                            "id": "150781",
                            "lnglat": "11744764,4958275",
                            "leaf": true
                        },
                        {
                            "text": "牙克石市",
                            "id": "150782",
                            "lnglat": "12072018,4928570",
                            "leaf": true
                        },
                        {
                            "text": "扎兰屯市",
                            "id": "150783",
                            "lnglat": "12273841,4800245",
                            "leaf": true
                        },
                        {
                            "text": "额尔古纳市",
                            "id": "150784",
                            "lnglat": "12018250,5024472",
                            "leaf": true
                        },
                        {
                            "text": "根河市",
                            "id": "150785",
                            "lnglat": "12152447,5078523",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "鄂尔多斯市",
                    "id": "150600",
                    "lnglat": "10999629,3982015",
                    "children": [
                        {
                            "text": "东胜区",
                            "id": "150602",
                            "lnglat": "11004395,3981699",
                            "leaf": true
                        },
                        {
                            "text": "达拉特旗",
                            "id": "150621",
                            "lnglat": "11003298,4041143",
                            "leaf": true
                        },
                        {
                            "text": "准格尔旗",
                            "id": "150622",
                            "lnglat": "11087797,3964090",
                            "leaf": true
                        },
                        {
                            "text": "鄂托克前旗",
                            "id": "150623",
                            "lnglat": "10743598,3822880",
                            "leaf": true
                        },
                        {
                            "text": "鄂托克旗",
                            "id": "150624",
                            "lnglat": "10797387,3909536",
                            "leaf": true
                        },
                        {
                            "text": "杭锦旗",
                            "id": "150625",
                            "lnglat": "10872322,3983851",
                            "leaf": true
                        },
                        {
                            "text": "乌审旗",
                            "id": "150626",
                            "lnglat": "10884604,3859726",
                            "leaf": true
                        },
                        {
                            "text": "伊金霍洛旗",
                            "id": "150627",
                            "lnglat": "10973530,3957643",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "赤峰市",
                    "id": "150400",
                    "lnglat": "11895102,4226299",
                    "children": [
                        {
                            "text": "红山区",
                            "id": "150402",
                            "lnglat": "11894573,4226776",
                            "leaf": true
                        },
                        {
                            "text": "元宝山区",
                            "id": "150403",
                            "lnglat": "11930682,4230473",
                            "leaf": true
                        },
                        {
                            "text": "松山区",
                            "id": "150404",
                            "lnglat": "11890945,4228076",
                            "leaf": true
                        },
                        {
                            "text": "阿鲁科尔沁旗",
                            "id": "150421",
                            "lnglat": "12008526,4387708",
                            "leaf": true
                        },
                        {
                            "text": "巴林左旗",
                            "id": "150422",
                            "lnglat": "11938619,4398136",
                            "leaf": true
                        },
                        {
                            "text": "巴林右旗",
                            "id": "150423",
                            "lnglat": "11866712,4352391",
                            "leaf": true
                        },
                        {
                            "text": "林西县",
                            "id": "150424",
                            "lnglat": "11805285,4360153",
                            "leaf": true
                        },
                        {
                            "text": "克什克腾旗",
                            "id": "150425",
                            "lnglat": "11753145,4324461",
                            "leaf": true
                        },
                        {
                            "text": "翁牛特旗",
                            "id": "150426",
                            "lnglat": "11902121,4293254",
                            "leaf": true
                        },
                        {
                            "text": "喀喇沁旗",
                            "id": "150428",
                            "lnglat": "11869983,4192563",
                            "leaf": true
                        },
                        {
                            "text": "宁城县",
                            "id": "150429",
                            "lnglat": "11933369,4159555",
                            "leaf": true
                        },
                        {
                            "text": "敖汉旗",
                            "id": "150430",
                            "lnglat": "11989738,4228544",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "包头市",
                    "id": "150200",
                    "lnglat": "10983404,4065486",
                    "children": [
                        {
                            "text": "东河区",
                            "id": "150202",
                            "lnglat": "11002063,4058346",
                            "leaf": true
                        },
                        {
                            "text": "昆都仑区",
                            "id": "150203",
                            "lnglat": "10981336,4066007",
                            "leaf": true
                        },
                        {
                            "text": "青山区",
                            "id": "150204",
                            "lnglat": "10988116,4066456",
                            "leaf": true
                        },
                        {
                            "text": "石拐区",
                            "id": "150205",
                            "lnglat": "11026951,4067475",
                            "leaf": true
                        },
                        {
                            "text": "白云矿区",
                            "id": "150206",
                            "lnglat": "10996098,4176972",
                            "leaf": true
                        },
                        {
                            "text": "九原区",
                            "id": "150207",
                            "lnglat": "10996188,4060868",
                            "leaf": true
                        },
                        {
                            "text": "土默特右旗",
                            "id": "150221",
                            "lnglat": "11051176,4055136",
                            "leaf": true
                        },
                        {
                            "text": "固阳县",
                            "id": "150222",
                            "lnglat": "11005510,4102845",
                            "leaf": true
                        },
                        {
                            "text": "达尔罕茂明安联合旗",
                            "id": "150223",
                            "lnglat": "11043085,4170015",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "巴彦淖尔市",
                    "id": "150800",
                    "lnglat": "10741316,4075587.6",
                    "children": [
                        {
                            "text": "临河区",
                            "id": "150802",
                            "lnglat": "10741343,4091961",
                            "leaf": true
                        },
                        {
                            "text": "五原县",
                            "id": "150821",
                            "lnglat": "10826639,4110036",
                            "leaf": true
                        },
                        {
                            "text": "磴口县",
                            "id": "150822",
                            "lnglat": "10700143,4032598",
                            "leaf": true
                        },
                        {
                            "text": "乌拉特前旗",
                            "id": "150823",
                            "lnglat": "10864736,4072037",
                            "leaf": true
                        },
                        {
                            "text": "乌拉特中旗",
                            "id": "150824",
                            "lnglat": "10851724,4156582",
                            "leaf": true
                        },
                        {
                            "text": "乌拉特后旗",
                            "id": "150825",
                            "lnglat": "10698701,4142883",
                            "leaf": true
                        },
                        {
                            "text": "杭锦后旗",
                            "id": "150826",
                            "lnglat": "10713814,4088686",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "阿拉善盟盟",
                    "id": "152900",
                    "lnglat": "10564492,3884842",
                    "children": [
                        {
                            "text": "阿拉善左旗",
                            "id": "152921",
                            "lnglat": "10566820,3883937",
                            "leaf": true
                        },
                        {
                            "text": "阿拉善右旗",
                            "id": "152922",
                            "lnglat": "10167277,3920992",
                            "leaf": true
                        },
                        {
                            "text": "额济纳旗",
                            "id": "152923",
                            "lnglat": "10106585,4196232",
                            "leaf": true
                        }
                    ]
                }
            ]
        },
        {
            "text": "广东省",
            "id": "440000",
            "lnglat": "11326006,2313399",
            "children": [
                {
                    "text": "广州市",
                    "id": "440100",
                    "lnglat": "11326006,2313399",
                    "children": [
                        {
                            "text": "花都区",
                            "id": "440114",
                            "lnglat": "11322681,2338506",
                            "leaf": true
                        },
                        {
                            "text": "荔湾区",
                            "id": "440103",
                            "lnglat": "11323882,2312850",
                            "leaf": true
                        },
                        {
                            "text": "越秀区",
                            "id": "440104",
                            "lnglat": "11326176,2313167",
                            "leaf": true
                        },
                        {
                            "text": "海珠区",
                            "id": "440105",
                            "lnglat": "11327064,2310580",
                            "leaf": true
                        },
                        {
                            "text": "天河区",
                            "id": "440106",
                            "lnglat": "11335649,2312689",
                            "leaf": true
                        },
                        {
                            "text": "白云区",
                            "id": "440111",
                            "lnglat": "11328840,2316381",
                            "leaf": true
                        },
                        {
                            "text": "黄埔区",
                            "id": "440112",
                            "lnglat": "11345412,2310887",
                            "leaf": true
                        },
                        {
                            "text": "番禺区",
                            "id": "440113",
                            "lnglat": "11335878,2293751",
                            "leaf": true
                        },
                        {
                            "text": "南沙区",
                            "id": "440115",
                            "lnglat": "11360317,2277473",
                            "leaf": true
                        },
                        {
                            "text": "萝岗区",
                            "id": "440116",
                            "lnglat": "11352231,2306504",
                            "leaf": true
                        },
                        {
                            "text": "增城市",
                            "id": "440183",
                            "lnglat": "11382781,2329537",
                            "leaf": true
                        },
                        {
                            "text": "从化市",
                            "id": "440184",
                            "lnglat": "11357586,2355298",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "深圳市",
                    "id": "440300",
                    "lnglat": "11411819,2255197",
                    "children": [
                        {
                            "text": "龙岗区",
                            "id": "440307",
                            "lnglat": "11425148,2272780",
                            "leaf": true
                        },
                        {
                            "text": "宝安区",
                            "id": "440306",
                            "lnglat": "11387553,2258412",
                            "leaf": true
                        },
                        {
                            "text": "罗湖区",
                            "id": "440303",
                            "lnglat": "11412683,2255087",
                            "leaf": true
                        },
                        {
                            "text": "福田区",
                            "id": "440304",
                            "lnglat": "11404991,2252546",
                            "leaf": true
                        },
                        {
                            "text": "南山区",
                            "id": "440305",
                            "lnglat": "11393410,2254026",
                            "leaf": true
                        },
                        {
                            "text": "盐田区",
                            "id": "440308",
                            "lnglat": "11423263,2255924",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "珠海市",
                    "id": "440400",
                    "lnglat": "11357373,2229112",
                    "children": [
                        {
                            "text": "香洲区",
                            "id": "440402",
                            "lnglat": "11353830,2226987",
                            "leaf": true
                        },
                        {
                            "text": "斗门区",
                            "id": "440403",
                            "lnglat": "11328679,2221451",
                            "leaf": true
                        },
                        {
                            "text": "金湾区",
                            "id": "440404",
                            "lnglat": "11335834,2214957",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "东莞市",
                    "id": "441900",
                    "lnglat": "11375541,2304873",
                    "children": [
                        {
                            "text": "樟木头镇",
                            "lnglat": "11407179,2290955",
                            "leaf": true
                        },
                        {
                            "text": "虎门镇",
                            "lnglat": "11367527,2282188",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "佛山市",
                    "id": "440600",
                    "lnglat": "11311934,2303751",
                    "children": [
                        {
                            "text": "禅城区",
                            "id": "440604",
                            "lnglat": "11308992,2302115",
                            "leaf": true
                        },
                        {
                            "text": "南海区",
                            "id": "440605",
                            "lnglat": "11312783,2302616",
                            "leaf": true
                        },
                        {
                            "text": "顺德区",
                            "id": "440606",
                            "lnglat": "11324507,2284513",
                            "leaf": true
                        },
                        {
                            "text": "三水区",
                            "id": "440607",
                            "lnglat": "11288048,2315624",
                            "leaf": true
                        },
                        {
                            "text": "高明区",
                            "id": "440608",
                            "lnglat": "11288356,2290240",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "惠州市",
                    "id": "441300",
                    "lnglat": "11442965,2311749",
                    "children": [
                        {
                            "text": "惠城区",
                            "id": "441302",
                            "lnglat": "11441724,2310769",
                            "leaf": true
                        },
                        {
                            "text": "惠阳区",
                            "id": "441303",
                            "lnglat": "11445159,2304014",
                            "leaf": true
                        },
                        {
                            "text": "博罗县",
                            "id": "441322",
                            "lnglat": "11427824,2316323",
                            "leaf": true
                        },
                        {
                            "text": "惠东县",
                            "id": "441323",
                            "lnglat": "11471310,2298636",
                            "leaf": true
                        },
                        {
                            "text": "龙门县",
                            "id": "441324",
                            "lnglat": "11424724,2373223",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "中山市",
                    "id": "442000",
                    "lnglat": "11338081,2252654",
                    "leaf": true
                },
                {
                    "text": "汕头市",
                    "id": "440500",
                    "lnglat": "11668803,2335911",
                    "children": [
                        {
                            "text": "龙湖区",
                            "id": "440507",
                            "lnglat": "11671192,2337433",
                            "leaf": true
                        },
                        {
                            "text": "金平区",
                            "id": "440511",
                            "lnglat": "11667340,2337499",
                            "leaf": true
                        },
                        {
                            "text": "濠江区",
                            "id": "440512",
                            "lnglat": "11672275,2327688",
                            "leaf": true
                        },
                        {
                            "text": "潮阳区",
                            "id": "440513",
                            "lnglat": "11652303,2328052",
                            "leaf": true
                        },
                        {
                            "text": "潮南区",
                            "id": "440514",
                            "lnglat": "11642726,2325274",
                            "leaf": true
                        },
                        {
                            "text": "澄海区",
                            "id": "440515",
                            "lnglat": "11680237,2349678",
                            "leaf": true
                        },
                        {
                            "text": "南澳县",
                            "id": "440523",
                            "lnglat": "11703658,2342263",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "江门市",
                    "id": "440700",
                    "lnglat": "11310313,2260173",
                    "children": [
                        {
                            "text": "蓬江区",
                            "id": "440703",
                            "lnglat": "11307305,2259787",
                            "leaf": true
                        },
                        {
                            "text": "江海区",
                            "id": "440704",
                            "lnglat": "11306936,2258390",
                            "leaf": true
                        },
                        {
                            "text": "新会区",
                            "id": "440705",
                            "lnglat": "11303266,2252467",
                            "leaf": true
                        },
                        {
                            "text": "台山市",
                            "id": "440781",
                            "lnglat": "11278775,2225133",
                            "leaf": true
                        },
                        {
                            "text": "开平市",
                            "id": "440783",
                            "lnglat": "11268422,2237643",
                            "leaf": true
                        },
                        {
                            "text": "鹤山市",
                            "id": "440784",
                            "lnglat": "11295770,2276717",
                            "leaf": true
                        },
                        {
                            "text": "恩平市",
                            "id": "440785",
                            "lnglat": "11230066,2218724",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "肇庆市",
                    "id": "441200",
                    "lnglat": "11245882,2305167",
                    "children": [
                        {
                            "text": "端州区",
                            "id": "441202",
                            "lnglat": "11248001,2305439",
                            "leaf": true
                        },
                        {
                            "text": "鼎湖区",
                            "id": "441203",
                            "lnglat": "11252123,2314878",
                            "leaf": true
                        },
                        {
                            "text": "广宁县",
                            "id": "441223",
                            "lnglat": "11244991,2364008",
                            "leaf": true
                        },
                        {
                            "text": "怀集县",
                            "id": "441224",
                            "lnglat": "11219199,2391369",
                            "leaf": true
                        },
                        {
                            "text": "封开县",
                            "id": "441225",
                            "lnglat": "11150434,2344645",
                            "leaf": true
                        },
                        {
                            "text": "德庆县",
                            "id": "441226",
                            "lnglat": "11176889,2314637",
                            "leaf": true
                        },
                        {
                            "text": "高要市",
                            "id": "441283",
                            "lnglat": "11245093,2302875",
                            "leaf": true
                        },
                        {
                            "text": "四会市",
                            "id": "441284",
                            "lnglat": "11268955,2334571",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "湛江市",
                    "id": "440800",
                    "lnglat": "11039997,2119610",
                    "children": [
                        {
                            "text": "赤坎区",
                            "id": "440802",
                            "lnglat": "11035536,2127676",
                            "leaf": true
                        },
                        {
                            "text": "霞山区",
                            "id": "440803",
                            "lnglat": "11040121,2120239",
                            "leaf": true
                        },
                        {
                            "text": "坡头区",
                            "id": "440804",
                            "lnglat": "11046215,2124260",
                            "leaf": true
                        },
                        {
                            "text": "麻章区",
                            "id": "440811",
                            "lnglat": "11033172,2126724",
                            "leaf": true
                        },
                        {
                            "text": "遂溪县",
                            "id": "440823",
                            "lnglat": "11024963,2137848",
                            "leaf": true
                        },
                        {
                            "text": "徐闻县",
                            "id": "440825",
                            "lnglat": "11016508,2032938",
                            "leaf": true
                        },
                        {
                            "text": "廉江市",
                            "id": "440881",
                            "lnglat": "11027856,2161054",
                            "leaf": true
                        },
                        {
                            "text": "雷州市",
                            "id": "440882",
                            "lnglat": "11010062,2090945",
                            "leaf": true
                        },
                        {
                            "text": "吴川市",
                            "id": "440883",
                            "lnglat": "11094873,2142168",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "云浮市",
                    "id": "445300",
                    "lnglat": "11203750,2293326",
                    "children": [
                        {
                            "text": "云城区",
                            "id": "445302",
                            "lnglat": "11215502,2297247",
                            "leaf": true
                        },
                        {
                            "text": "新兴县",
                            "id": "445321",
                            "lnglat": "11222076,2269567",
                            "leaf": true
                        },
                        {
                            "text": "郁南县",
                            "id": "445322",
                            "lnglat": "11152390,2323453",
                            "leaf": true
                        },
                        {
                            "text": "云安县",
                            "id": "445323",
                            "lnglat": "11198689,2307845",
                            "leaf": true
                        },
                        {
                            "text": "罗定市",
                            "id": "445381",
                            "lnglat": "11156104,2276873",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "阳江市",
                    "id": "441700",
                    "lnglat": "11197772,2186060",
                    "children": [
                        {
                            "text": "江城区",
                            "id": "441702",
                            "lnglat": "11192177,2183629",
                            "leaf": true
                        },
                        {
                            "text": "阳西县",
                            "id": "441721",
                            "lnglat": "11161481,2174550",
                            "leaf": true
                        },
                        {
                            "text": "阳东县",
                            "id": "441723",
                            "lnglat": "11210321,2192485",
                            "leaf": true
                        },
                        {
                            "text": "阳春市",
                            "id": "441781",
                            "lnglat": "11178308,2217240",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "韶关市",
                    "id": "440200",
                    "lnglat": "11359365,2480609",
                    "children": [
                        {
                            "text": "武江区",
                            "id": "440203",
                            "lnglat": "11358267,2479648",
                            "leaf": true
                        },
                        {
                            "text": "浈江区",
                            "id": "440204",
                            "lnglat": "11360568,2480743",
                            "leaf": true
                        },
                        {
                            "text": "曲江区",
                            "id": "440205",
                            "lnglat": "11361125,2468301",
                            "leaf": true
                        },
                        {
                            "text": "始兴县",
                            "id": "440222",
                            "lnglat": "11406291,2495087",
                            "leaf": true
                        },
                        {
                            "text": "仁化县",
                            "id": "440224",
                            "lnglat": "11374035,2509342",
                            "leaf": true
                        },
                        {
                            "text": "翁源县",
                            "id": "440229",
                            "lnglat": "11412962,2435372",
                            "leaf": true
                        },
                        {
                            "text": "乳源瑶族自治县",
                            "id": "440232",
                            "lnglat": "11326935,2479706",
                            "leaf": true
                        },
                        {
                            "text": "新丰县",
                            "id": "440233",
                            "lnglat": "11420351,2406366",
                            "leaf": true
                        },
                        {
                            "text": "乐昌市",
                            "id": "440281",
                            "lnglat": "11334222,2513563",
                            "leaf": true
                        },
                        {
                            "text": "南雄市",
                            "id": "440282",
                            "lnglat": "11430721,2512329",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "汕尾市",
                    "id": "441500",
                    "lnglat": "11535582,2277951",
                    "children": [
                        {
                            "text": "城区",
                            "id": "441502",
                            "lnglat": "11541759,2278718",
                            "leaf": true
                        },
                        {
                            "text": "海丰县",
                            "id": "441521",
                            "lnglat": "11533330,2297281",
                            "leaf": true
                        },
                        {
                            "text": "陆河县",
                            "id": "441523",
                            "lnglat": "11565067,2330843",
                            "leaf": true
                        },
                        {
                            "text": "陆丰市",
                            "id": "441581",
                            "lnglat": "11564266,2294536",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "清远市",
                    "id": "441800",
                    "lnglat": "11304748,2368204",
                    "children": [
                        {
                            "text": "清城区",
                            "id": "441802",
                            "lnglat": "11314536,2364956",
                            "leaf": true
                        },
                        {
                            "text": "佛冈县",
                            "id": "441821",
                            "lnglat": "11352269,2388074",
                            "leaf": true
                        },
                        {
                            "text": "阳山县",
                            "id": "441823",
                            "lnglat": "11264710,2447549",
                            "leaf": true
                        },
                        {
                            "text": "连山壮族瑶族自治县",
                            "id": "441825",
                            "lnglat": "11207996,2457230",
                            "leaf": true
                        },
                        {
                            "text": "连南瑶族自治县",
                            "id": "441826",
                            "lnglat": "11228371,2472436",
                            "leaf": true
                        },
                        {
                            "text": "清新县",
                            "id": "441827",
                            "lnglat": "11284390,2386092",
                            "leaf": true
                        },
                        {
                            "text": "英德市",
                            "id": "441881",
                            "lnglat": "11340824,2419152",
                            "leaf": true
                        },
                        {
                            "text": "连州市",
                            "id": "441882",
                            "lnglat": "11237873,2477776",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "梅州市",
                    "id": "441400",
                    "lnglat": "11611278,2430948",
                    "children": [
                        {
                            "text": "梅江区",
                            "id": "441402",
                            "lnglat": "11612108,2428662",
                            "leaf": true
                        },
                        {
                            "text": "梅县",
                            "id": "441421",
                            "lnglat": "11598730,2427422",
                            "leaf": true
                        },
                        {
                            "text": "大埔县",
                            "id": "441422",
                            "lnglat": "11668911,2435651",
                            "leaf": true
                        },
                        {
                            "text": "丰顺县",
                            "id": "441423",
                            "lnglat": "11617225,2376762",
                            "leaf": true
                        },
                        {
                            "text": "五华县",
                            "id": "441424",
                            "lnglat": "11576833,2392602",
                            "leaf": true
                        },
                        {
                            "text": "平远县",
                            "id": "441426",
                            "lnglat": "11589269,2457988",
                            "leaf": true
                        },
                        {
                            "text": "蕉岭县",
                            "id": "441427",
                            "lnglat": "11616468,2465958",
                            "leaf": true
                        },
                        {
                            "text": "兴宁市",
                            "id": "441481",
                            "lnglat": "11572414,2414965",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "茂名市",
                    "id": "440900",
                    "lnglat": "11091773,2165274",
                    "children": [
                        {
                            "text": "茂南区",
                            "id": "440902",
                            "lnglat": "11091420,2164376",
                            "leaf": true
                        },
                        {
                            "text": "茂港区",
                            "id": "440903",
                            "lnglat": "11102624,2147883",
                            "leaf": true
                        },
                        {
                            "text": "电白县",
                            "id": "440923",
                            "lnglat": "11100194,2151204",
                            "leaf": true
                        },
                        {
                            "text": "高州市",
                            "id": "440981",
                            "lnglat": "11085004,2192193",
                            "leaf": true
                        },
                        {
                            "text": "化州市",
                            "id": "440982",
                            "lnglat": "11063845,2165972",
                            "leaf": true
                        },
                        {
                            "text": "信宜市",
                            "id": "440983",
                            "lnglat": "11094270,2235612",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "揭阳市",
                    "id": "445200",
                    "lnglat": "11635886,2353794",
                    "children": [
                        {
                            "text": "榕城区",
                            "id": "445202",
                            "lnglat": "11637904,2354578",
                            "leaf": true
                        },
                        {
                            "text": "揭东县",
                            "id": "445221",
                            "lnglat": "11639578,2359921",
                            "leaf": true
                        },
                        {
                            "text": "揭西县",
                            "id": "445222",
                            "lnglat": "11583279,2342919",
                            "leaf": true
                        },
                        {
                            "text": "惠来县",
                            "id": "445224",
                            "lnglat": "11629013,2304000",
                            "leaf": true
                        },
                        {
                            "text": "普宁市",
                            "id": "445281",
                            "lnglat": "11616916,2330119",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "河源市",
                    "id": "441600",
                    "lnglat": "11469069,2374102",
                    "children": [
                        {
                            "text": "源城区",
                            "id": "441602",
                            "lnglat": "11467558,2371617",
                            "leaf": true
                        },
                        {
                            "text": "紫金县",
                            "id": "441621",
                            "lnglat": "11517566,2364465",
                            "leaf": true
                        },
                        {
                            "text": "龙川县",
                            "id": "441622",
                            "lnglat": "11525511,2410479",
                            "leaf": true
                        },
                        {
                            "text": "连平县",
                            "id": "441623",
                            "lnglat": "11448339,2437484",
                            "leaf": true
                        },
                        {
                            "text": "和平县",
                            "id": "441624",
                            "lnglat": "11493523,2444173",
                            "leaf": true
                        },
                        {
                            "text": "东源县",
                            "id": "441625",
                            "lnglat": "11477177,2382451",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "潮州市",
                    "id": "445100",
                    "lnglat": "11661828,2365934",
                    "children": [
                        {
                            "text": "湘桥区",
                            "id": "445102",
                            "lnglat": "11667126,2372624",
                            "leaf": true
                        },
                        {
                            "text": "潮安县",
                            "id": "445121",
                            "lnglat": "11664452,2346778",
                            "leaf": true
                        },
                        {
                            "text": "饶平县",
                            "id": "445122",
                            "lnglat": "11700470,2367242",
                            "leaf": true
                        }
                    ]
                }
            ]
        },
        {
            "text": "海南省",
            "id": "460000",
            "lnglat": "11035734,2004501",
            "children": [
                {
                    "text": "海口市",
                    "id": "460100",
                    "lnglat": "11035734,2004501",
                    "children": [
                        {
                            "text": "秀英区",
                            "id": "460105",
                            "lnglat": "11028938,2000968",
                            "leaf": true
                        },
                        {
                            "text": "龙华区",
                            "id": "460106",
                            "lnglat": "11030141,2003077",
                            "leaf": true
                        },
                        {
                            "text": "琼山区",
                            "id": "460107",
                            "lnglat": "11041626,1980610",
                            "leaf": true
                        },
                        {
                            "text": "美兰区",
                            "id": "460108",
                            "lnglat": "11036205,2003096",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "三亚市",
                    "id": "460200",
                    "lnglat": "10950617,1825401",
                    "leaf": true
                },
                {
                    "text": "五指山市",
                    "id": "469001",
                    "lnglat": "10949483,1883482",
                    "leaf": true
                },
                {
                    "text": "琼海市",
                    "id": "469002",
                    "lnglat": "11046144,1924010",
                    "leaf": true
                },
                {
                    "text": "儋州市",
                    "id": "469003",
                    "lnglat": "10956457,1951770",
                    "leaf": true
                },
                {
                    "text": "文昌市",
                    "id": "469005",
                    "lnglat": "11075499,1961206",
                    "leaf": true
                },
                {
                    "text": "万宁市",
                    "id": "469006",
                    "lnglat": "11039715,1880280",
                    "leaf": true
                },
                {
                    "text": "东方市",
                    "id": "469007",
                    "lnglat": "10865205,1910314",
                    "leaf": true
                },
                {
                    "text": "定安县",
                    "id": "469025",
                    "lnglat": "11032118,1970332",
                    "leaf": true
                },
                {
                    "text": "屯昌县",
                    "id": "469026",
                    "lnglat": "11010212,1936945",
                    "leaf": true
                },
                {
                    "text": "澄迈县",
                    "id": "469027",
                    "lnglat": "11000616,1973605",
                    "leaf": true
                },
                {
                    "text": "临高县",
                    "id": "469028",
                    "lnglat": "10967130,1990886",
                    "leaf": true
                },
                {
                    "text": "白沙黎族自治县",
                    "id": "469030",
                    "lnglat": "10944820,1922758",
                    "leaf": true
                },
                {
                    "text": "昌江黎族自治县",
                    "id": "469031",
                    "lnglat": "10905091,1926290",
                    "leaf": true
                },
                {
                    "text": "乐东黎族自治县",
                    "id": "469033",
                    "lnglat": "10916834,1874977",
                    "leaf": true
                },
                {
                    "text": "陵水黎族自治县",
                    "id": "469034",
                    "lnglat": "11003399,1850818",
                    "leaf": true
                },
                {
                    "text": "保亭黎族苗族自治县",
                    "id": "469035",
                    "lnglat": "10969669,1864144",
                    "leaf": true
                },
                {
                    "text": "琼中黎族苗族自治县",
                    "id": "469036",
                    "lnglat": "10983560,1904164",
                    "leaf": true
                },
                {
                    "text": "西沙群岛",
                    "id": "469037",
                    "lnglat": "11192380,1737408",
                    "leaf": true
                },
                {
                    "text": "南沙群岛",
                    "id": "469038",
                    "lnglat": "11489658,938671",
                    "leaf": true
                },
                {
                    "text": "中沙群岛的岛礁及其海域",
                    "id": "469039",
                    "lnglat": "11436041,1625651",
                    "leaf": true
                }
            ]
        },
        {
            "text": "上海市",
            "id": "310000",
            "lnglat": "12147550,3123385",
            "children": [
                {
                    "text": "黄浦区",
                    "id": "310101",
                    "lnglat": "12145542,3119392",
                    "leaf": true
                },
                {
                    "text": "卢湾区",
                    "id": "310103",
                    "lnglat": "12145247,3117419",
                    "leaf": true
                },
                {
                    "text": "徐汇区",
                    "id": "310104",
                    "lnglat": "12142752,3116462",
                    "leaf": true
                },
                {
                    "text": "长宁区",
                    "id": "310105",
                    "lnglat": "12139389,3121218",
                    "leaf": true
                },
                {
                    "text": "静安区",
                    "id": "310106",
                    "lnglat": "12143299,3122780",
                    "leaf": true
                },
                {
                    "text": "普陀区",
                    "id": "310107",
                    "lnglat": "12139234,3125083",
                    "leaf": true
                },
                {
                    "text": "闸北区",
                    "id": "310108",
                    "lnglat": "12145073,3127780",
                    "leaf": true
                },
                {
                    "text": "虹口区",
                    "id": "310109",
                    "lnglat": "12147234,3128788",
                    "leaf": true
                },
                {
                    "text": "杨浦区",
                    "id": "310110",
                    "lnglat": "12155427,3126196",
                    "leaf": true
                },
                {
                    "text": "闵行区",
                    "id": "310112",
                    "lnglat": "12136594,3111359",
                    "leaf": true
                },
                {
                    "text": "宝山区",
                    "id": "310113",
                    "lnglat": "12148202,3137638",
                    "leaf": true
                },
                {
                    "text": "嘉定区",
                    "id": "310114",
                    "lnglat": "12123905,3135972",
                    "leaf": true
                },
                {
                    "text": "浦东新区",
                    "id": "310115",
                    "lnglat": "12164533,3123970",
                    "leaf": true
                },
                {
                    "text": "金山区",
                    "id": "310116",
                    "lnglat": "12129550,3073430",
                    "leaf": true
                },
                {
                    "text": "松江区",
                    "id": "310117",
                    "lnglat": "12122324,3101063",
                    "leaf": true
                },
                {
                    "text": "青浦区",
                    "id": "310118",
                    "lnglat": "12110633,3114803",
                    "leaf": true
                },
                {
                    "text": "南汇区",
                    "id": "310119",
                    "lnglat": "12175206,3105039",
                    "leaf": true
                },
                {
                    "text": "奉贤区",
                    "id": "310120",
                    "lnglat": "12145056,3092162",
                    "leaf": true
                },
                {
                    "text": "崇明县",
                    "id": "310230",
                    "lnglat": "12139414,3162428",
                    "leaf": true
                }
            ]
        },
        {
            "text": "江苏省",
            "id": "320000",
            "lnglat": "11879349,3205892",
            "children": [
                {
                    "text": "南京市",
                    "id": "320100",
                    "lnglat": "11879349,3205892",
                    "children": [
                        {
                            "text": "玄武区",
                            "id": "320102",
                            "lnglat": "11878178,3206723",
                            "leaf": true
                        },
                        {
                            "text": "白下区",
                            "id": "320103",
                            "lnglat": "11878924,3204098",
                            "leaf": true
                        },
                        {
                            "text": "秦淮区",
                            "id": "320104",
                            "lnglat": "11879308,3201323",
                            "leaf": true
                        },
                        {
                            "text": "建邺区",
                            "id": "320105",
                            "lnglat": "11876129,3203311",
                            "leaf": true
                        },
                        {
                            "text": "鼓楼区",
                            "id": "320106",
                            "lnglat": "11876491,3206848",
                            "leaf": true
                        },
                        {
                            "text": "下关区",
                            "id": "320107",
                            "lnglat": "11873461,3208992",
                            "leaf": true
                        },
                        {
                            "text": "浦口区",
                            "id": "320111",
                            "lnglat": "11861887,3206258",
                            "leaf": true
                        },
                        {
                            "text": "栖霞区",
                            "id": "320113",
                            "lnglat": "11885900,3212555",
                            "leaf": true
                        },
                        {
                            "text": "雨花台区",
                            "id": "320114",
                            "lnglat": "11877479,3199411",
                            "leaf": true
                        },
                        {
                            "text": "江宁区",
                            "id": "320115",
                            "lnglat": "11883488,3195474",
                            "leaf": true
                        },
                        {
                            "text": "六合区",
                            "id": "320116",
                            "lnglat": "11884275,3234835",
                            "leaf": true
                        },
                        {
                            "text": "溧水县",
                            "id": "320124",
                            "lnglat": "11902217,3165448",
                            "leaf": true
                        },
                        {
                            "text": "高淳县",
                            "id": "320125",
                            "lnglat": "11886884,3132621",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "无锡市",
                    "id": "320200",
                    "lnglat": "12031118,3158131",
                    "children": [
                        {
                            "text": "江阴市",
                            "id": "320281",
                            "lnglat": "12027602,3191323",
                            "leaf": true
                        },
                        {
                            "text": "崇安区",
                            "id": "320202",
                            "lnglat": "12029505,3158190",
                            "leaf": true
                        },
                        {
                            "text": "南长区",
                            "id": "320203",
                            "lnglat": "12030426,3156530",
                            "leaf": true
                        },
                        {
                            "text": "北塘区",
                            "id": "320204",
                            "lnglat": "12028782,3158674",
                            "leaf": true
                        },
                        {
                            "text": "锡山区",
                            "id": "320205",
                            "lnglat": "12032616,3151461",
                            "leaf": true
                        },
                        {
                            "text": "惠山区",
                            "id": "320206",
                            "lnglat": "12029402,3168222",
                            "leaf": true
                        },
                        {
                            "text": "滨湖区",
                            "id": "320211",
                            "lnglat": "12026077,3156490",
                            "leaf": true
                        },
                        {
                            "text": "宜兴市",
                            "id": "320282",
                            "lnglat": "11981345,3136831",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "南通市",
                    "id": "320600",
                    "lnglat": "12085978,3202597",
                    "children": [
                        {
                            "text": "崇川区",
                            "id": "320602",
                            "lnglat": "12085308,3201199",
                            "leaf": true
                        },
                        {
                            "text": "港闸区",
                            "id": "320611",
                            "lnglat": "12081343,3203389",
                            "leaf": true
                        },
                        {
                            "text": "海安县",
                            "id": "320621",
                            "lnglat": "12045841,3255154",
                            "leaf": true
                        },
                        {
                            "text": "如东县",
                            "id": "320623",
                            "lnglat": "12117746,3231556",
                            "leaf": true
                        },
                        {
                            "text": "启东市",
                            "id": "320681",
                            "lnglat": "12165744,3181223",
                            "leaf": true
                        },
                        {
                            "text": "如皋市",
                            "id": "320682",
                            "lnglat": "12055921,3239095",
                            "leaf": true
                        },
                        {
                            "text": "通州市",
                            "id": "320683",
                            "lnglat": "12107341,3208669",
                            "leaf": true
                        },
                        {
                            "text": "海门市",
                            "id": "320684",
                            "lnglat": "12116412,3189776",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "常州市",
                    "id": "320400",
                    "lnglat": "11997573,3179847",
                    "children": [
                        {
                            "text": "天宁区",
                            "id": "320402",
                            "lnglat": "11997081,3176962",
                            "leaf": true
                        },
                        {
                            "text": "钟楼区",
                            "id": "320404",
                            "lnglat": "11994360,3178409",
                            "leaf": true
                        },
                        {
                            "text": "戚墅堰区",
                            "id": "320405",
                            "lnglat": "12005161,3173626",
                            "leaf": true
                        },
                        {
                            "text": "新北区",
                            "id": "320411",
                            "lnglat": "11996699,3183243",
                            "leaf": true
                        },
                        {
                            "text": "武进区",
                            "id": "320412",
                            "lnglat": "11993465,3169921",
                            "leaf": true
                        },
                        {
                            "text": "溧阳市",
                            "id": "320481",
                            "lnglat": "11948363,3143056",
                            "leaf": true
                        },
                        {
                            "text": "金坛市",
                            "id": "320482",
                            "lnglat": "11955629,3174091",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "扬州市",
                    "id": "321000",
                    "lnglat": "11944767,3239429",
                    "children": [
                        {
                            "text": "广陵区",
                            "id": "321002",
                            "lnglat": "11942654,3239682",
                            "leaf": true
                        },
                        {
                            "text": "邗江区",
                            "id": "321003",
                            "lnglat": "11949244,3244384",
                            "leaf": true
                        },
                        {
                            "text": "维扬区",
                            "id": "321011",
                            "lnglat": "11940422,3241933",
                            "leaf": true
                        },
                        {
                            "text": "宝应县",
                            "id": "321023",
                            "lnglat": "11930473,3323968",
                            "leaf": true
                        },
                        {
                            "text": "仪征市",
                            "id": "321081",
                            "lnglat": "11918103,3226577",
                            "leaf": true
                        },
                        {
                            "text": "高邮市",
                            "id": "321084",
                            "lnglat": "11943086,3279210",
                            "leaf": true
                        },
                        {
                            "text": "江都市",
                            "id": "321088",
                            "lnglat": "11955712,3243060",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "苏州市",
                    "id": "320500",
                    "lnglat": "12063331,3131316",
                    "children": [
                        {
                            "text": "张家港市",
                            "id": "320582",
                            "lnglat": "12054673,3187177",
                            "leaf": true
                        },
                        {
                            "text": "昆山市",
                            "id": "320583",
                            "lnglat": "12096600,3138523",
                            "leaf": true
                        },
                        {
                            "text": "沧浪区",
                            "id": "320502",
                            "lnglat": "12062715,3130445",
                            "leaf": true
                        },
                        {
                            "text": "平江区",
                            "id": "320503",
                            "lnglat": "12062513,3131631",
                            "leaf": true
                        },
                        {
                            "text": "金阊区",
                            "id": "320504",
                            "lnglat": "12059662,3131255",
                            "leaf": true
                        },
                        {
                            "text": "虎丘区",
                            "id": "320505",
                            "lnglat": "12056744,3129945",
                            "leaf": true
                        },
                        {
                            "text": "吴中区",
                            "id": "320506",
                            "lnglat": "12062897,3126454",
                            "leaf": true
                        },
                        {
                            "text": "相城区",
                            "id": "320507",
                            "lnglat": "12061747,3136479",
                            "leaf": true
                        },
                        {
                            "text": "常熟市",
                            "id": "320581",
                            "lnglat": "12073719,3164293",
                            "leaf": true
                        },
                        {
                            "text": "吴江市",
                            "id": "320584",
                            "lnglat": "12064337,3116720",
                            "leaf": true
                        },
                        {
                            "text": "太仓市",
                            "id": "320585",
                            "lnglat": "12109743,3144959",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "镇江市",
                    "id": "321100",
                    "lnglat": "11945006,3220389",
                    "children": [
                        {
                            "text": "京口区",
                            "id": "321102",
                            "lnglat": "11946423,3220019",
                            "leaf": true
                        },
                        {
                            "text": "润州区",
                            "id": "321111",
                            "lnglat": "11940518,3219739",
                            "leaf": true
                        },
                        {
                            "text": "丹徒区",
                            "id": "321112",
                            "lnglat": "11951212,3219479",
                            "leaf": true
                        },
                        {
                            "text": "丹阳市",
                            "id": "321181",
                            "lnglat": "11956971,3199435",
                            "leaf": true
                        },
                        {
                            "text": "扬中市",
                            "id": "321182",
                            "lnglat": "11982114,3224547",
                            "leaf": true
                        },
                        {
                            "text": "句容市",
                            "id": "321183",
                            "lnglat": "11916419,3194345",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "盐城市",
                    "id": "320900",
                    "lnglat": "12013363,3338395",
                    "children": [
                        {
                            "text": "亭湖区",
                            "id": "320902",
                            "lnglat": "12013447,3339332",
                            "leaf": true
                        },
                        {
                            "text": "盐都区",
                            "id": "320903",
                            "lnglat": "12003625,3327743",
                            "leaf": true
                        },
                        {
                            "text": "响水县",
                            "id": "320921",
                            "lnglat": "11956806,3420465",
                            "leaf": true
                        },
                        {
                            "text": "滨海县",
                            "id": "320922",
                            "lnglat": "11983771,3400964",
                            "leaf": true
                        },
                        {
                            "text": "阜宁县",
                            "id": "320923",
                            "lnglat": "11979651,3378475",
                            "leaf": true
                        },
                        {
                            "text": "射阳县",
                            "id": "320924",
                            "lnglat": "12024774,3377794",
                            "leaf": true
                        },
                        {
                            "text": "建湖县",
                            "id": "320925",
                            "lnglat": "11979159,3347115",
                            "leaf": true
                        },
                        {
                            "text": "东台市",
                            "id": "320981",
                            "lnglat": "12030639,3285293",
                            "leaf": true
                        },
                        {
                            "text": "大丰市",
                            "id": "320982",
                            "lnglat": "12046188,3320319",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "徐州市",
                    "id": "320300",
                    "lnglat": "11718011,3426440",
                    "children": [
                        {
                            "text": "鼓楼区",
                            "id": "320302",
                            "lnglat": "11720892,3429054",
                            "leaf": true
                        },
                        {
                            "text": "云龙区",
                            "id": "320303",
                            "lnglat": "11722349,3425042",
                            "leaf": true
                        },
                        {
                            "text": "九里区",
                            "id": "320304",
                            "lnglat": "11712992,3430322",
                            "leaf": true
                        },
                        {
                            "text": "贾汪区",
                            "id": "320305",
                            "lnglat": "11743882,3443358",
                            "leaf": true
                        },
                        {
                            "text": "泉山区",
                            "id": "320311",
                            "lnglat": "11718811,3424521",
                            "leaf": true
                        },
                        {
                            "text": "丰县",
                            "id": "320321",
                            "lnglat": "11658543,3469435",
                            "leaf": true
                        },
                        {
                            "text": "沛县",
                            "id": "320322",
                            "lnglat": "11692116,3473821",
                            "leaf": true
                        },
                        {
                            "text": "铜山县",
                            "id": "320323",
                            "lnglat": "11717592,3417626",
                            "leaf": true
                        },
                        {
                            "text": "睢宁县",
                            "id": "320324",
                            "lnglat": "11794285,3390431",
                            "leaf": true
                        },
                        {
                            "text": "新沂市",
                            "id": "320381",
                            "lnglat": "11834607,3437913",
                            "leaf": true
                        },
                        {
                            "text": "邳州市",
                            "id": "320382",
                            "lnglat": "11795141,3431474",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "泰州市",
                    "id": "321200",
                    "lnglat": "11991498,3249174",
                    "children": [
                        {
                            "text": "海陵区",
                            "id": "321202",
                            "lnglat": "11991494,3249228",
                            "leaf": true
                        },
                        {
                            "text": "高港区",
                            "id": "321203",
                            "lnglat": "11986313,3228705",
                            "leaf": true
                        },
                        {
                            "text": "兴化市",
                            "id": "321281",
                            "lnglat": "11983331,3293859",
                            "leaf": true
                        },
                        {
                            "text": "靖江市",
                            "id": "321282",
                            "lnglat": "12026846,3201978",
                            "leaf": true
                        },
                        {
                            "text": "泰兴市",
                            "id": "321283",
                            "lnglat": "12001839,3217221",
                            "leaf": true
                        },
                        {
                            "text": "姜堰市",
                            "id": "321284",
                            "lnglat": "12014240,3250992",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "宿迁市",
                    "id": "321300",
                    "lnglat": "11829463,3396095",
                    "children": [
                        {
                            "text": "宿城区",
                            "id": "321302",
                            "lnglat": "11828545,3394335",
                            "leaf": true
                        },
                        {
                            "text": "宿豫区",
                            "id": "321311",
                            "lnglat": "11829102,3394032",
                            "leaf": true
                        },
                        {
                            "text": "沭阳县",
                            "id": "321322",
                            "lnglat": "11876747,3413905",
                            "leaf": true
                        },
                        {
                            "text": "泗阳县",
                            "id": "321323",
                            "lnglat": "11867854,3371230",
                            "leaf": true
                        },
                        {
                            "text": "泗洪县",
                            "id": "321324",
                            "lnglat": "11820826,3346348",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "连云港市",
                    "id": "320700",
                    "lnglat": "11917806,3460100",
                    "children": [
                        {
                            "text": "连云区",
                            "id": "320703",
                            "lnglat": "11936427,3475319",
                            "leaf": true
                        },
                        {
                            "text": "新浦区",
                            "id": "320705",
                            "lnglat": "11917079,3460650",
                            "leaf": true
                        },
                        {
                            "text": "海州区",
                            "id": "320706",
                            "lnglat": "11912561,3457090",
                            "leaf": true
                        },
                        {
                            "text": "赣榆县",
                            "id": "320721",
                            "lnglat": "11911737,3483981",
                            "leaf": true
                        },
                        {
                            "text": "东海县",
                            "id": "320722",
                            "lnglat": "11876401,3452179",
                            "leaf": true
                        },
                        {
                            "text": "灌云县",
                            "id": "320723",
                            "lnglat": "11925930,3429919",
                            "leaf": true
                        },
                        {
                            "text": "灌南县",
                            "id": "320724",
                            "lnglat": "11934807,3409296",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "淮安市",
                    "id": "320800",
                    "lnglat": "11901645,3359535",
                    "children": [
                        {
                            "text": "清河区",
                            "id": "320802",
                            "lnglat": "12414239,4253853",
                            "leaf": true
                        },
                        {
                            "text": "楚州区",
                            "id": "320803",
                            "lnglat": "11913561,3350451",
                            "leaf": true
                        },
                        {
                            "text": "淮阴区",
                            "id": "320804",
                            "lnglat": "11902941,3363312",
                            "leaf": true
                        },
                        {
                            "text": "清浦区",
                            "id": "320811",
                            "lnglat": "11902698,3357347",
                            "leaf": true
                        },
                        {
                            "text": "涟水县",
                            "id": "320826",
                            "lnglat": "11926427,3377832",
                            "leaf": true
                        },
                        {
                            "text": "洪泽县",
                            "id": "320829",
                            "lnglat": "11884116,3330268",
                            "leaf": true
                        },
                        {
                            "text": "盱眙县",
                            "id": "320830",
                            "lnglat": "11848848,3301592",
                            "leaf": true
                        },
                        {
                            "text": "金湖县",
                            "id": "320831",
                            "lnglat": "11901848,3302335",
                            "leaf": true
                        }
                    ]
                }
            ]
        },
        {
            "text": "浙江省",
            "id": "330000",
            "lnglat": "12016730,3025748",
            "children": [
                {
                    "text": "杭州市",
                    "id": "330100",
                    "lnglat": "12016730,3025748",
                    "children": [
                        {
                            "text": "上城区",
                            "id": "330102",
                            "lnglat": "12016471,3024512",
                            "leaf": true
                        },
                        {
                            "text": "下城区",
                            "id": "330103",
                            "lnglat": "12016227,3026094",
                            "leaf": true
                        },
                        {
                            "text": "江干区",
                            "id": "330104",
                            "lnglat": "12020077,3025971",
                            "leaf": true
                        },
                        {
                            "text": "拱墅区",
                            "id": "330105",
                            "lnglat": "12013698,3032216",
                            "leaf": true
                        },
                        {
                            "text": "西湖区",
                            "id": "330106",
                            "lnglat": "12012536,3026197",
                            "leaf": true
                        },
                        {
                            "text": "滨江区",
                            "id": "330108",
                            "lnglat": "12020745,3021095",
                            "leaf": true
                        },
                        {
                            "text": "萧山区",
                            "id": "330109",
                            "lnglat": "12026111,3016495",
                            "leaf": true
                        },
                        {
                            "text": "余杭区",
                            "id": "330110",
                            "lnglat": "12029615,3042502",
                            "leaf": true
                        },
                        {
                            "text": "桐庐县",
                            "id": "330122",
                            "lnglat": "11967179,2980985",
                            "leaf": true
                        },
                        {
                            "text": "淳安县",
                            "id": "330127",
                            "lnglat": "11903379,2960410",
                            "leaf": true
                        },
                        {
                            "text": "建德市",
                            "id": "330182",
                            "lnglat": "11927442,2947404",
                            "leaf": true
                        },
                        {
                            "text": "富阳市",
                            "id": "330183",
                            "lnglat": "11995310,3005439",
                            "leaf": true
                        },
                        {
                            "text": "临安市",
                            "id": "330185",
                            "lnglat": "11971664,3023719",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "宁波市",
                    "id": "330200",
                    "lnglat": "12156081,2988010",
                    "children": [
                        {
                            "text": "海曙区",
                            "id": "330203",
                            "lnglat": "12154653,2986205",
                            "leaf": true
                        },
                        {
                            "text": "江东区",
                            "id": "330204",
                            "lnglat": "12156618,2986923",
                            "leaf": true
                        },
                        {
                            "text": "江北区",
                            "id": "330205",
                            "lnglat": "12155143,2989099",
                            "leaf": true
                        },
                        {
                            "text": "北仑区",
                            "id": "330206",
                            "lnglat": "12183800,2992056",
                            "leaf": true
                        },
                        {
                            "text": "镇海区",
                            "id": "330211",
                            "lnglat": "12171124,2995511",
                            "leaf": true
                        },
                        {
                            "text": "鄞州区",
                            "id": "330212",
                            "lnglat": "12148494,2991050",
                            "leaf": true
                        },
                        {
                            "text": "象山县",
                            "id": "330225",
                            "lnglat": "12186597,2947709",
                            "leaf": true
                        },
                        {
                            "text": "宁海县",
                            "id": "330226",
                            "lnglat": "12142289,2929121",
                            "leaf": true
                        },
                        {
                            "text": "余姚市",
                            "id": "330281",
                            "lnglat": "12115118,3005023",
                            "leaf": true
                        },
                        {
                            "text": "慈溪市",
                            "id": "330282",
                            "lnglat": "12124273,3017595",
                            "leaf": true
                        },
                        {
                            "text": "奉化市",
                            "id": "330283",
                            "lnglat": "12140879,2966276",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "台州市",
                    "id": "331000",
                    "lnglat": "12143664,2868495",
                    "children": [
                        {
                            "text": "椒江区",
                            "id": "331002",
                            "lnglat": "12143846,2867610",
                            "leaf": true
                        },
                        {
                            "text": "黄岩区",
                            "id": "331003",
                            "lnglat": "12126092,2865078",
                            "leaf": true
                        },
                        {
                            "text": "路桥区",
                            "id": "331004",
                            "lnglat": "12137875,2857679",
                            "leaf": true
                        },
                        {
                            "text": "玉环县",
                            "id": "331021",
                            "lnglat": "12122848,2814195",
                            "leaf": true
                        },
                        {
                            "text": "三门县",
                            "id": "331022",
                            "lnglat": "12137536,2912098",
                            "leaf": true
                        },
                        {
                            "text": "天台县",
                            "id": "331023",
                            "lnglat": "12102024,2914474",
                            "leaf": true
                        },
                        {
                            "text": "仙居县",
                            "id": "331024",
                            "lnglat": "12072934,2885776",
                            "leaf": true
                        },
                        {
                            "text": "温岭市",
                            "id": "331081",
                            "lnglat": "12135950,2836771",
                            "leaf": true
                        },
                        {
                            "text": "临海市",
                            "id": "331082",
                            "lnglat": "12111257,2884966",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "温州市",
                    "id": "330300",
                    "lnglat": "12065878,2802152",
                    "children": [
                        {
                            "text": "鹿城区",
                            "id": "330302",
                            "lnglat": "12065558,2802070",
                            "leaf": true
                        },
                        {
                            "text": "龙湾区",
                            "id": "330303",
                            "lnglat": "12082672,2791640",
                            "leaf": true
                        },
                        {
                            "text": "瓯海区",
                            "id": "330304",
                            "lnglat": "12063363,2801059",
                            "leaf": true
                        },
                        {
                            "text": "洞头县",
                            "id": "330322",
                            "lnglat": "12115223,2783955",
                            "leaf": true
                        },
                        {
                            "text": "永嘉县",
                            "id": "330324",
                            "lnglat": "12069157,2815540",
                            "leaf": true
                        },
                        {
                            "text": "平阳县",
                            "id": "330326",
                            "lnglat": "12055771,2766638",
                            "leaf": true
                        },
                        {
                            "text": "苍南县",
                            "id": "330327",
                            "lnglat": "12039589,2750518",
                            "leaf": true
                        },
                        {
                            "text": "文成县",
                            "id": "330328",
                            "lnglat": "12008647,2779282",
                            "leaf": true
                        },
                        {
                            "text": "泰顺县",
                            "id": "330329",
                            "lnglat": "11970656,2756063",
                            "leaf": true
                        },
                        {
                            "text": "瑞安市",
                            "id": "330381",
                            "lnglat": "12063033,2778456",
                            "leaf": true
                        },
                        {
                            "text": "乐清市",
                            "id": "330382",
                            "lnglat": "12095801,2812841",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "绍兴市",
                    "id": "330600",
                    "lnglat": "12058919,3000989",
                    "children": [
                        {
                            "text": "越城区",
                            "id": "330602",
                            "lnglat": "12058918,2999870",
                            "leaf": true
                        },
                        {
                            "text": "绍兴县",
                            "id": "330621",
                            "lnglat": "12053076,3005668",
                            "leaf": true
                        },
                        {
                            "text": "新昌县",
                            "id": "330624",
                            "lnglat": "12089872,2950502",
                            "leaf": true
                        },
                        {
                            "text": "诸暨市",
                            "id": "330681",
                            "lnglat": "12022999,2971441",
                            "leaf": true
                        },
                        {
                            "text": "上虞市",
                            "id": "330682",
                            "lnglat": "12087495,3001917",
                            "leaf": true
                        },
                        {
                            "text": "嵊州市",
                            "id": "330683",
                            "lnglat": "12081490,2959448",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "金华市",
                    "id": "330700",
                    "lnglat": "11967453,2911044",
                    "children": [
                        {
                            "text": "婺城区",
                            "id": "330702",
                            "lnglat": "11964847,2910802",
                            "leaf": true
                        },
                        {
                            "text": "金东区",
                            "id": "330703",
                            "lnglat": "11967554,2910134",
                            "leaf": true
                        },
                        {
                            "text": "武义县",
                            "id": "330723",
                            "lnglat": "11981617,2889851",
                            "leaf": true
                        },
                        {
                            "text": "浦江县",
                            "id": "330726",
                            "lnglat": "11988519,2945991",
                            "leaf": true
                        },
                        {
                            "text": "磐安县",
                            "id": "330727",
                            "lnglat": "12042615,2905449",
                            "leaf": true
                        },
                        {
                            "text": "兰溪市",
                            "id": "330781",
                            "lnglat": "11947222,2921217",
                            "leaf": true
                        },
                        {
                            "text": "义乌市",
                            "id": "330782",
                            "lnglat": "12006331,2930694",
                            "leaf": true
                        },
                        {
                            "text": "东阳市",
                            "id": "330783",
                            "lnglat": "12022732,2926636",
                            "leaf": true
                        },
                        {
                            "text": "永康市",
                            "id": "330784",
                            "lnglat": "12002445,2891469",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "舟山市",
                    "id": "330900",
                    "lnglat": "12210103,3001514",
                    "children": [
                        {
                            "text": "定海区",
                            "id": "330902",
                            "lnglat": "12210418,3002217",
                            "leaf": true
                        },
                        {
                            "text": "普陀区",
                            "id": "330903",
                            "lnglat": "12232065,2996035",
                            "leaf": true
                        },
                        {
                            "text": "岱山县",
                            "id": "330921",
                            "lnglat": "12220004,3024354",
                            "leaf": true
                        },
                        {
                            "text": "嵊泗县",
                            "id": "330922",
                            "lnglat": "12245552,3072414",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "衢州市",
                    "id": "330800",
                    "lnglat": "11886995,2893888",
                    "children": [
                        {
                            "text": "柯城区",
                            "id": "330802",
                            "lnglat": "11887484,2891649",
                            "leaf": true
                        },
                        {
                            "text": "衢江区",
                            "id": "330803",
                            "lnglat": "11883111,2897323",
                            "leaf": true
                        },
                        {
                            "text": "常山县",
                            "id": "330822",
                            "lnglat": "11850783,2890654",
                            "leaf": true
                        },
                        {
                            "text": "开化县",
                            "id": "330824",
                            "lnglat": "11840193,2913119",
                            "leaf": true
                        },
                        {
                            "text": "龙游县",
                            "id": "330825",
                            "lnglat": "11917146,2903476",
                            "leaf": true
                        },
                        {
                            "text": "江山市",
                            "id": "330881",
                            "lnglat": "11862268,2873817",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "丽水市",
                    "id": "331100",
                    "lnglat": "11991244,2845580",
                    "children": [
                        {
                            "text": "莲都区",
                            "id": "331102",
                            "lnglat": "11987322,2842060",
                            "leaf": true
                        },
                        {
                            "text": "青田县",
                            "id": "331121",
                            "lnglat": "12028279,2814730",
                            "leaf": true
                        },
                        {
                            "text": "缙云县",
                            "id": "331122",
                            "lnglat": "12005880,2865264",
                            "leaf": true
                        },
                        {
                            "text": "遂昌县",
                            "id": "331123",
                            "lnglat": "11926873,2859454",
                            "leaf": true
                        },
                        {
                            "text": "松阳县",
                            "id": "331124",
                            "lnglat": "11947956,2845228",
                            "leaf": true
                        },
                        {
                            "text": "云和县",
                            "id": "331125",
                            "lnglat": "11956426,2811307",
                            "leaf": true
                        },
                        {
                            "text": "庆元县",
                            "id": "331126",
                            "lnglat": "11905686,2762027",
                            "leaf": true
                        },
                        {
                            "text": "景宁畲族自治县",
                            "id": "331127",
                            "lnglat": "11963714,2797142",
                            "leaf": true
                        },
                        {
                            "text": "龙泉市",
                            "id": "331181",
                            "lnglat": "11911253,2806972",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "嘉兴市",
                    "id": "330400",
                    "lnglat": "12074956,3075119",
                    "children": [
                        {
                            "text": "秀城区",
                            "id": "330402",
                            "lnglat": "12077892,3074768",
                            "leaf": true
                        },
                        {
                            "text": "秀洲区",
                            "id": "330411",
                            "lnglat": "12073305,3076168",
                            "leaf": true
                        },
                        {
                            "text": "嘉善县",
                            "id": "330421",
                            "lnglat": "12091574,3084532",
                            "leaf": true
                        },
                        {
                            "text": "海盐县",
                            "id": "330424",
                            "lnglat": "12093679,3051908",
                            "leaf": true
                        },
                        {
                            "text": "海宁市",
                            "id": "330481",
                            "lnglat": "12068234,3052539",
                            "leaf": true
                        },
                        {
                            "text": "平湖市",
                            "id": "330482",
                            "lnglat": "12101659,3070286",
                            "leaf": true
                        },
                        {
                            "text": "桐乡市",
                            "id": "330483",
                            "lnglat": "12054654,3063725",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "湖州市",
                    "id": "330500",
                    "lnglat": "12009324,3086689",
                    "children": [
                        {
                            "text": "吴兴区",
                            "id": "330502",
                            "lnglat": "12012075,3085961",
                            "leaf": true
                        },
                        {
                            "text": "南浔区",
                            "id": "330503",
                            "lnglat": "12024649,3077504",
                            "leaf": true
                        },
                        {
                            "text": "德清县",
                            "id": "330521",
                            "lnglat": "11996057,3054864",
                            "leaf": true
                        },
                        {
                            "text": "长兴县",
                            "id": "330522",
                            "lnglat": "11990365,3100769",
                            "leaf": true
                        },
                        {
                            "text": "安吉县",
                            "id": "330523",
                            "lnglat": "11968476,3063659",
                            "leaf": true
                        }
                    ]
                }
            ]
        },
        {
            "text": "安徽省",
            "id": "340000",
            "lnglat": "11729172,3186646",
            "children": [
                {
                    "text": "合肥市",
                    "id": "340100",
                    "lnglat": "11729172,3186646",
                    "children": [
                        {
                            "text": "瑶海区",
                            "id": "340102",
                            "lnglat": "11730393,3185983",
                            "leaf": true
                        },
                        {
                            "text": "庐阳区",
                            "id": "340103",
                            "lnglat": "11725909,3188076",
                            "leaf": true
                        },
                        {
                            "text": "蜀山区",
                            "id": "340104",
                            "lnglat": "11725514,3185310",
                            "leaf": true
                        },
                        {
                            "text": "包河区",
                            "id": "340111",
                            "lnglat": "11727710,3188188",
                            "leaf": true
                        },
                        {
                            "text": "长丰县",
                            "id": "340121",
                            "lnglat": "11715751,3248060",
                            "leaf": true
                        },
                        {
                            "text": "肥东县",
                            "id": "340122",
                            "lnglat": "11745909,3188359",
                            "leaf": true
                        },
                        {
                            "text": "肥西县",
                            "id": "340123",
                            "lnglat": "11715605,3171951",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "宣城市",
                    "id": "341800",
                    "lnglat": "11875149,3094691",
                    "children": [
                        {
                            "text": "宣州区",
                            "id": "341802",
                            "lnglat": "11876865,3094330",
                            "leaf": true
                        },
                        {
                            "text": "郎溪县",
                            "id": "341821",
                            "lnglat": "11917765,3112862",
                            "leaf": true
                        },
                        {
                            "text": "广德县",
                            "id": "341822",
                            "lnglat": "11941139,3089416",
                            "leaf": true
                        },
                        {
                            "text": "泾县",
                            "id": "341823",
                            "lnglat": "11840375,3068950",
                            "leaf": true
                        },
                        {
                            "text": "绩溪县",
                            "id": "341824",
                            "lnglat": "11859126,3007187",
                            "leaf": true
                        },
                        {
                            "text": "旌德县",
                            "id": "341825",
                            "lnglat": "11853543,3029185",
                            "leaf": true
                        },
                        {
                            "text": "宁国市",
                            "id": "341881",
                            "lnglat": "11897741,3062562",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "芜湖市",
                    "id": "340200",
                    "lnglat": "11837380,3134967",
                    "children": [
                        {
                            "text": "镜湖区",
                            "id": "340202",
                            "lnglat": "11837999,3134223",
                            "leaf": true
                        },
                        {
                            "text": "弋江区",
                            "id": "340203",
                            "lnglat": "11841749,3132645",
                            "leaf": true
                        },
                        {
                            "text": "鸠江区",
                            "id": "340207",
                            "lnglat": "11838630,3137109",
                            "leaf": true
                        },
                        {
                            "text": "三山区",
                            "id": "340208",
                            "leaf": true
                        },
                        {
                            "text": "芜湖县",
                            "id": "340221",
                            "lnglat": "11856420,3114716",
                            "leaf": true
                        },
                        {
                            "text": "繁昌县",
                            "id": "340222",
                            "lnglat": "11819199,3108406",
                            "leaf": true
                        },
                        {
                            "text": "南陵县",
                            "id": "340223",
                            "lnglat": "11833446,3092167",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "铜陵市",
                    "id": "340700",
                    "lnglat": "11780755,3092991",
                    "children": [
                        {
                            "text": "铜官山区",
                            "id": "340702",
                            "lnglat": "11780951,3093659",
                            "leaf": true
                        },
                        {
                            "text": "狮子山区",
                            "id": "340703",
                            "lnglat": "11788473,3092985",
                            "leaf": true
                        },
                        {
                            "text": "郊区",
                            "id": "340711",
                            "lnglat": "11780335,3092186",
                            "leaf": true
                        },
                        {
                            "text": "铜陵县",
                            "id": "340721",
                            "lnglat": "11778392,3095673",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "宿州市",
                    "id": "341300",
                    "lnglat": "11697726,3364220",
                    "children": [
                        {
                            "text": "埇桥区",
                            "id": "341302",
                            "lnglat": "11713821,3368854",
                            "leaf": true
                        },
                        {
                            "text": "砀山县",
                            "id": "341321",
                            "lnglat": "11633594,3441282",
                            "leaf": true
                        },
                        {
                            "text": "萧县",
                            "id": "341322",
                            "lnglat": "11693901,3419087",
                            "leaf": true
                        },
                        {
                            "text": "灵璧县",
                            "id": "341323",
                            "lnglat": "11754906,3354736",
                            "leaf": true
                        },
                        {
                            "text": "泗县",
                            "id": "341324",
                            "lnglat": "11788300,3348339",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "马鞍山市",
                    "id": "340500",
                    "lnglat": "11849950,3168128",
                    "children": [
                        {
                            "text": "金家庄区",
                            "id": "340502",
                            "lnglat": "11847146,3172821",
                            "leaf": true
                        },
                        {
                            "text": "花山区",
                            "id": "340503",
                            "lnglat": "11850577,3170206",
                            "leaf": true
                        },
                        {
                            "text": "雨山区",
                            "id": "340504",
                            "lnglat": "11849361,3168461",
                            "leaf": true
                        },
                        {
                            "text": "当涂县",
                            "id": "340521",
                            "lnglat": "11848413,3155705",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "六安市",
                    "id": "341500",
                    "lnglat": "11650035,3175806",
                    "children": [
                        {
                            "text": "金安区",
                            "id": "341502",
                            "lnglat": "11650400,3175818",
                            "leaf": true
                        },
                        {
                            "text": "裕安区",
                            "id": "341503",
                            "lnglat": "11648923,3175798",
                            "leaf": true
                        },
                        {
                            "text": "寿县",
                            "id": "341521",
                            "lnglat": "11677233,3257991",
                            "leaf": true
                        },
                        {
                            "text": "霍邱县",
                            "id": "341522",
                            "lnglat": "11626531,3233839",
                            "leaf": true
                        },
                        {
                            "text": "舒城县",
                            "id": "341523",
                            "lnglat": "11693606,3146069",
                            "leaf": true
                        },
                        {
                            "text": "金寨县",
                            "id": "341524",
                            "lnglat": "11587734,3169169",
                            "leaf": true
                        },
                        {
                            "text": "霍山县",
                            "id": "341525",
                            "lnglat": "11632677,3140846",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "黄山市",
                    "id": "341000",
                    "lnglat": "11832944,2972064",
                    "children": [
                        {
                            "text": "屯溪区",
                            "id": "341002",
                            "lnglat": "11831856,2971146",
                            "leaf": true
                        },
                        {
                            "text": "黄山区",
                            "id": "341003",
                            "lnglat": "11813373,3029409",
                            "leaf": true
                        },
                        {
                            "text": "徽州区",
                            "id": "341004",
                            "lnglat": "11833414,2982076",
                            "leaf": true
                        },
                        {
                            "text": "歙县",
                            "id": "341021",
                            "lnglat": "11843697,2986954",
                            "leaf": true
                        },
                        {
                            "text": "休宁县",
                            "id": "341022",
                            "lnglat": "11817866,2978584",
                            "leaf": true
                        },
                        {
                            "text": "黟县",
                            "id": "341023",
                            "lnglat": "11793306,2992898",
                            "leaf": true
                        },
                        {
                            "text": "祁门县",
                            "id": "341024",
                            "lnglat": "11771215,2986091",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "淮南市",
                    "id": "340400",
                    "lnglat": "11704224,3266046",
                    "children": [
                        {
                            "text": "大通区",
                            "id": "340402",
                            "lnglat": "11704789,3262095",
                            "leaf": true
                        },
                        {
                            "text": "田家庵区",
                            "id": "340403",
                            "lnglat": "11701181,3264911",
                            "leaf": true
                        },
                        {
                            "text": "谢家集区",
                            "id": "340404",
                            "lnglat": "11690462,3260105",
                            "leaf": true
                        },
                        {
                            "text": "八公山区",
                            "id": "340405",
                            "lnglat": "11683032,3263200",
                            "leaf": true
                        },
                        {
                            "text": "潘集区",
                            "id": "340406",
                            "lnglat": "11681133,3278469",
                            "leaf": true
                        },
                        {
                            "text": "凤台县",
                            "id": "340421",
                            "lnglat": "11672134,3269811",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "淮北市",
                    "id": "340600",
                    "lnglat": "11678984,3397454",
                    "children": [
                        {
                            "text": "杜集区",
                            "id": "340602",
                            "lnglat": "11686622,3399331",
                            "leaf": true
                        },
                        {
                            "text": "相山区",
                            "id": "340603",
                            "lnglat": "11678901,3396126",
                            "leaf": true
                        },
                        {
                            "text": "烈山区",
                            "id": "340604",
                            "lnglat": "11684087,3388607",
                            "leaf": true
                        },
                        {
                            "text": "濉溪县",
                            "id": "340621",
                            "lnglat": "11678628,3391212",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "阜阳市",
                    "id": "341200",
                    "lnglat": "11581086,3291043",
                    "children": [
                        {
                            "text": "颍州区",
                            "id": "341202",
                            "lnglat": "11580126,3288520",
                            "leaf": true
                        },
                        {
                            "text": "颍东区",
                            "id": "341203",
                            "lnglat": "11585122,3291519",
                            "leaf": true
                        },
                        {
                            "text": "颍泉区",
                            "id": "341204",
                            "lnglat": "11580234,3292734",
                            "leaf": true
                        },
                        {
                            "text": "临泉县",
                            "id": "341221",
                            "lnglat": "11525467,3306842",
                            "leaf": true
                        },
                        {
                            "text": "太和县",
                            "id": "341222",
                            "lnglat": "11561751,3316746",
                            "leaf": true
                        },
                        {
                            "text": "阜南县",
                            "id": "341225",
                            "lnglat": "11558661,3263799",
                            "leaf": true
                        },
                        {
                            "text": "颍上县",
                            "id": "341226",
                            "lnglat": "11626026,3263254",
                            "leaf": true
                        },
                        {
                            "text": "界首市",
                            "id": "341282",
                            "lnglat": "11534794,3326101",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "滁州市",
                    "id": "341100",
                    "lnglat": "11831417,3230298",
                    "children": [
                        {
                            "text": "琅琊区",
                            "id": "341102",
                            "lnglat": "11830041,3229749",
                            "leaf": true
                        },
                        {
                            "text": "南谯区",
                            "id": "341103",
                            "lnglat": "11830701,3232064",
                            "leaf": true
                        },
                        {
                            "text": "来安县",
                            "id": "341122",
                            "lnglat": "11843349,3246692",
                            "leaf": true
                        },
                        {
                            "text": "全椒县",
                            "id": "341124",
                            "lnglat": "11827964,3209725",
                            "leaf": true
                        },
                        {
                            "text": "定远县",
                            "id": "341125",
                            "lnglat": "11767689,3252304",
                            "leaf": true
                        },
                        {
                            "text": "凤阳县",
                            "id": "341126",
                            "lnglat": "11755985,3286835",
                            "leaf": true
                        },
                        {
                            "text": "天长市",
                            "id": "341181",
                            "lnglat": "11893912,3270947",
                            "leaf": true
                        },
                        {
                            "text": "明光市",
                            "id": "341182",
                            "lnglat": "11797874,3278118",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "池州市",
                    "id": "341700",
                    "lnglat": "11748284,3065941",
                    "children": [
                        {
                            "text": "贵池区",
                            "id": "341702",
                            "lnglat": "11746888,3053183",
                            "leaf": true
                        },
                        {
                            "text": "东至县",
                            "id": "341721",
                            "lnglat": "11701885,3010151",
                            "leaf": true
                        },
                        {
                            "text": "石台县",
                            "id": "341722",
                            "lnglat": "11747638,3021317",
                            "leaf": true
                        },
                        {
                            "text": "青阳县",
                            "id": "341723",
                            "lnglat": "11784829,3064055",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "巢湖市",
                    "id": "341400",
                    "lnglat": "11786134,3160151",
                    "children": [
                        {
                            "text": "居巢区",
                            "id": "341402",
                            "lnglat": "11769022,3164130",
                            "leaf": true
                        },
                        {
                            "text": "庐江县",
                            "id": "341421",
                            "lnglat": "11728461,3124538",
                            "leaf": true
                        },
                        {
                            "text": "无为县",
                            "id": "341422",
                            "lnglat": "11791278,3122293",
                            "leaf": true
                        },
                        {
                            "text": "含山县",
                            "id": "341423",
                            "lnglat": "11810308,3172044",
                            "leaf": true
                        },
                        {
                            "text": "和县",
                            "id": "341424",
                            "lnglat": "11836133,3171601",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "亳州市",
                    "id": "341600",
                    "lnglat": "11578067,3387526",
                    "children": [
                        {
                            "text": "谯城区",
                            "id": "341602",
                            "lnglat": "11580622,3374384",
                            "leaf": true
                        },
                        {
                            "text": "涡阳县",
                            "id": "341621",
                            "lnglat": "11620583,3351032",
                            "leaf": true
                        },
                        {
                            "text": "蒙城县",
                            "id": "341622",
                            "lnglat": "11655993,3326863",
                            "leaf": true
                        },
                        {
                            "text": "利辛县",
                            "id": "341623",
                            "lnglat": "11619864,3314410",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "蚌埠市",
                    "id": "340300",
                    "lnglat": "11738358,3294222",
                    "children": [
                        {
                            "text": "龙子湖区",
                            "id": "340302",
                            "lnglat": "11738763,3294449",
                            "leaf": true
                        },
                        {
                            "text": "蚌山区",
                            "id": "340303",
                            "lnglat": "11736251,3294660",
                            "leaf": true
                        },
                        {
                            "text": "禹会区",
                            "id": "340304",
                            "lnglat": "11734782,3293501",
                            "leaf": true
                        },
                        {
                            "text": "淮上区",
                            "id": "340311",
                            "lnglat": "11735404,3296595",
                            "leaf": true
                        },
                        {
                            "text": "怀远县",
                            "id": "340321",
                            "lnglat": "11721968,3295601",
                            "leaf": true
                        },
                        {
                            "text": "五河县",
                            "id": "340322",
                            "lnglat": "11788766,3313671",
                            "leaf": true
                        },
                        {
                            "text": "固镇县",
                            "id": "340323",
                            "lnglat": "11730700,3332399",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "安庆市",
                    "id": "340800",
                    "lnglat": "11705042,3052774",
                    "children": [
                        {
                            "text": "迎江区",
                            "id": "340802",
                            "lnglat": "11704402,3050684",
                            "leaf": true
                        },
                        {
                            "text": "大观区",
                            "id": "340803",
                            "lnglat": "11702901,3051448",
                            "leaf": true
                        },
                        {
                            "text": "宜秀区",
                            "id": "340811",
                            "lnglat": "11707911,3065867",
                            "leaf": true
                        },
                        {
                            "text": "怀宁县",
                            "id": "340822",
                            "lnglat": "11664939,3040919",
                            "leaf": true
                        },
                        {
                            "text": "枞阳县",
                            "id": "340823",
                            "lnglat": "11721226,3069294",
                            "leaf": true
                        },
                        {
                            "text": "潜山县",
                            "id": "340824",
                            "lnglat": "11657128,3063876",
                            "leaf": true
                        },
                        {
                            "text": "太湖县",
                            "id": "340825",
                            "lnglat": "11626728,3042556",
                            "leaf": true
                        },
                        {
                            "text": "宿松县",
                            "id": "340826",
                            "lnglat": "11612287,3015725",
                            "leaf": true
                        },
                        {
                            "text": "望江县",
                            "id": "340827",
                            "lnglat": "11668258,3012400",
                            "leaf": true
                        },
                        {
                            "text": "岳西县",
                            "id": "340828",
                            "lnglat": "11635669,3085097",
                            "leaf": true
                        },
                        {
                            "text": "桐城市",
                            "id": "340881",
                            "lnglat": "11694589,3105689",
                            "leaf": true
                        }
                    ]
                }
            ]
        },
        {
            "text": "山东省",
            "id": "370000",
            "lnglat": "11697009,3665319",
            "children": [
                {
                    "text": "济南市",
                    "id": "370100",
                    "lnglat": "11697009,3665319",
                    "children": [
                        {
                            "text": "历下区",
                            "id": "370102",
                            "lnglat": "11727583,3661194",
                            "leaf": true
                        },
                        {
                            "text": "市中区",
                            "id": "370103",
                            "lnglat": "11699165,3665115",
                            "leaf": true
                        },
                        {
                            "text": "槐荫区",
                            "id": "370104",
                            "lnglat": "11691644,3655193",
                            "leaf": true
                        },
                        {
                            "text": "天桥区",
                            "id": "370105",
                            "lnglat": "11687695,3668819",
                            "leaf": true
                        },
                        {
                            "text": "历城区",
                            "id": "370112",
                            "lnglat": "11707226,3667768",
                            "leaf": true
                        },
                        {
                            "text": "长清区",
                            "id": "370113",
                            "lnglat": "11672662,3655831",
                            "leaf": true
                        },
                        {
                            "text": "平阴县",
                            "id": "370124",
                            "lnglat": "11645261,3628475",
                            "leaf": true
                        },
                        {
                            "text": "济阳县",
                            "id": "370125",
                            "lnglat": "11720710,3697702",
                            "leaf": true
                        },
                        {
                            "text": "商河县",
                            "id": "370126",
                            "lnglat": "11715006,3731123",
                            "leaf": true
                        },
                        {
                            "text": "章丘市",
                            "id": "370181",
                            "lnglat": "11752691,3671749",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "青岛市",
                    "id": "370200",
                    "lnglat": "12035483,3610582",
                    "children": [
                        {
                            "text": "市南区",
                            "id": "370202",
                            "lnglat": "12038214,3606627",
                            "leaf": true
                        },
                        {
                            "text": "市北区",
                            "id": "370203",
                            "lnglat": "12036964,3608717",
                            "leaf": true
                        },
                        {
                            "text": "四方区",
                            "id": "370205",
                            "lnglat": "12036169,3610324",
                            "leaf": true
                        },
                        {
                            "text": "黄岛区",
                            "id": "370211",
                            "lnglat": "12021173,3595937",
                            "leaf": true
                        },
                        {
                            "text": "崂山区",
                            "id": "370212",
                            "lnglat": "12041016,3615578",
                            "leaf": true
                        },
                        {
                            "text": "李沧区",
                            "id": "370213",
                            "lnglat": "12037063,3618381",
                            "leaf": true
                        },
                        {
                            "text": "城阳区",
                            "id": "370214",
                            "lnglat": "12035592,3630192",
                            "leaf": true
                        },
                        {
                            "text": "胶州市",
                            "id": "370281",
                            "lnglat": "12000549,3628870",
                            "leaf": true
                        },
                        {
                            "text": "即墨市",
                            "id": "370282",
                            "lnglat": "12045082,3638591",
                            "leaf": true
                        },
                        {
                            "text": "平度市",
                            "id": "370283",
                            "lnglat": "11995693,3678450",
                            "leaf": true
                        },
                        {
                            "text": "胶南市",
                            "id": "370284",
                            "lnglat": "11998322,3587770",
                            "leaf": true
                        },
                        {
                            "text": "莱西市",
                            "id": "370285",
                            "lnglat": "12050409,3686049",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "烟台市",
                    "id": "370600",
                    "lnglat": "12138051,3754736",
                    "children": [
                        {
                            "text": "芝罘区",
                            "id": "370602",
                            "lnglat": "12136118,3753760",
                            "leaf": true
                        },
                        {
                            "text": "福山区",
                            "id": "370611",
                            "lnglat": "12125594,3749501",
                            "leaf": true
                        },
                        {
                            "text": "牟平区",
                            "id": "370612",
                            "lnglat": "12159875,3738627",
                            "leaf": true
                        },
                        {
                            "text": "莱山区",
                            "id": "370613",
                            "lnglat": "12149428,3742816",
                            "leaf": true
                        },
                        {
                            "text": "长岛县",
                            "id": "370634",
                            "lnglat": "12073320,3794664",
                            "leaf": true
                        },
                        {
                            "text": "龙口市",
                            "id": "370681",
                            "lnglat": "12032758,3765630",
                            "leaf": true
                        },
                        {
                            "text": "莱阳市",
                            "id": "370682",
                            "lnglat": "12069529,3697836",
                            "leaf": true
                        },
                        {
                            "text": "莱州市",
                            "id": "370683",
                            "lnglat": "11994455,3717548",
                            "leaf": true
                        },
                        {
                            "text": "蓬莱市",
                            "id": "370684",
                            "lnglat": "12075611,3781094",
                            "leaf": true
                        },
                        {
                            "text": "招远市",
                            "id": "370685",
                            "lnglat": "12039392,3735869",
                            "leaf": true
                        },
                        {
                            "text": "栖霞市",
                            "id": "370686",
                            "lnglat": "12082784,3730533",
                            "leaf": true
                        },
                        {
                            "text": "海阳市",
                            "id": "370687",
                            "lnglat": "12115411,3677474",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "威海市",
                    "id": "371000",
                    "lnglat": "12212184,3750621",
                    "children": [
                        {
                            "text": "环翠区",
                            "id": "371002",
                            "lnglat": "12211978,3751385",
                            "leaf": true
                        },
                        {
                            "text": "文登市",
                            "id": "371081",
                            "lnglat": "12205378,3719530",
                            "leaf": true
                        },
                        {
                            "text": "荣成市",
                            "id": "371082",
                            "lnglat": "12241530,3716824",
                            "leaf": true
                        },
                        {
                            "text": "乳山市",
                            "id": "371083",
                            "lnglat": "12151981,3691296",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "淄博市",
                    "id": "370300",
                    "lnglat": "11805825,3680982",
                    "children": [
                        {
                            "text": "淄川区",
                            "id": "370302",
                            "lnglat": "11796219,3664645",
                            "leaf": true
                        },
                        {
                            "text": "张店区",
                            "id": "370303",
                            "lnglat": "11805534,3675590",
                            "leaf": true
                        },
                        {
                            "text": "博山区",
                            "id": "370304",
                            "lnglat": "11785198,3650025",
                            "leaf": true
                        },
                        {
                            "text": "临淄区",
                            "id": "370305",
                            "lnglat": "11829467,3680588",
                            "leaf": true
                        },
                        {
                            "text": "周村区",
                            "id": "370306",
                            "lnglat": "11784564,3679935",
                            "leaf": true
                        },
                        {
                            "text": "桓台县",
                            "id": "370321",
                            "lnglat": "11810616,3695908",
                            "leaf": true
                        },
                        {
                            "text": "高青县",
                            "id": "370322",
                            "lnglat": "11782464,3717273",
                            "leaf": true
                        },
                        {
                            "text": "沂源县",
                            "id": "370323",
                            "lnglat": "11815977,3618297",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "潍坊市",
                    "id": "370700",
                    "lnglat": "11911343,3671303",
                    "children": [
                        {
                            "text": "潍城区",
                            "id": "370702",
                            "lnglat": "11910031,3671297",
                            "leaf": true
                        },
                        {
                            "text": "寒亭区",
                            "id": "370703",
                            "lnglat": "11919894,3677293",
                            "leaf": true
                        },
                        {
                            "text": "坊子区",
                            "id": "370704",
                            "lnglat": "11915481,3665005",
                            "leaf": true
                        },
                        {
                            "text": "奎文区",
                            "id": "370705",
                            "lnglat": "11911915,3670649",
                            "leaf": true
                        },
                        {
                            "text": "临朐县",
                            "id": "370724",
                            "lnglat": "11853548,3651391",
                            "leaf": true
                        },
                        {
                            "text": "昌乐县",
                            "id": "370725",
                            "lnglat": "11883512,3670596",
                            "leaf": true
                        },
                        {
                            "text": "青州市",
                            "id": "370781",
                            "lnglat": "11847451,3670140",
                            "leaf": true
                        },
                        {
                            "text": "诸城市",
                            "id": "370782",
                            "lnglat": "11939791,3599211",
                            "leaf": true
                        },
                        {
                            "text": "寿光市",
                            "id": "370783",
                            "lnglat": "11873128,3687798",
                            "leaf": true
                        },
                        {
                            "text": "安丘市",
                            "id": "370784",
                            "lnglat": "11919618,3643164",
                            "leaf": true
                        },
                        {
                            "text": "高密市",
                            "id": "370785",
                            "lnglat": "11975993,3638371",
                            "leaf": true
                        },
                        {
                            "text": "昌邑市",
                            "id": "370786",
                            "lnglat": "11939010,3685380",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "枣庄市",
                    "id": "370400",
                    "lnglat": "11756665,3485406",
                    "children": [
                        {
                            "text": "市中区",
                            "id": "370402",
                            "lnglat": "11755093,3486504",
                            "leaf": true
                        },
                        {
                            "text": "薛城区",
                            "id": "370403",
                            "lnglat": "11725000,3479310",
                            "leaf": true
                        },
                        {
                            "text": "峄城区",
                            "id": "370404",
                            "lnglat": "11758485,3476522",
                            "leaf": true
                        },
                        {
                            "text": "台儿庄区",
                            "id": "370405",
                            "lnglat": "11773546,3455936",
                            "leaf": true
                        },
                        {
                            "text": "山亭区",
                            "id": "370406",
                            "lnglat": "11745990,3508279",
                            "leaf": true
                        },
                        {
                            "text": "滕州市",
                            "id": "370481",
                            "lnglat": "11715174,3508436",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "泰安市",
                    "id": "370900",
                    "lnglat": "11711217,3618812",
                    "children": [
                        {
                            "text": "泰山区",
                            "id": "370902",
                            "lnglat": "11713021,3619200",
                            "leaf": true
                        },
                        {
                            "text": "岱岳区",
                            "id": "370903",
                            "lnglat": "11703636,3618485",
                            "leaf": true
                        },
                        {
                            "text": "宁阳县",
                            "id": "370921",
                            "lnglat": "11678764,3576304",
                            "leaf": true
                        },
                        {
                            "text": "东平县",
                            "id": "370923",
                            "lnglat": "11646169,3592908",
                            "leaf": true
                        },
                        {
                            "text": "新泰市",
                            "id": "370982",
                            "lnglat": "11775776,3591114",
                            "leaf": true
                        },
                        {
                            "text": "肥城市",
                            "id": "370983",
                            "lnglat": "11677011,3618644",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "日照市",
                    "id": "371100",
                    "lnglat": "11952180,3541602",
                    "children": [
                        {
                            "text": "东港区",
                            "id": "371102",
                            "lnglat": "11945416,3542823",
                            "leaf": true
                        },
                        {
                            "text": "岚山区",
                            "id": "371103",
                            "lnglat": "11936106,3510587",
                            "leaf": true
                        },
                        {
                            "text": "五莲县",
                            "id": "371121",
                            "lnglat": "11920156,3575193",
                            "leaf": true
                        },
                        {
                            "text": "莒县",
                            "id": "371122",
                            "lnglat": "11882450,3558245",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "临沂市",
                    "id": "371300",
                    "lnglat": "11833587,3506265",
                    "children": [
                        {
                            "text": "兰山区",
                            "id": "371302",
                            "lnglat": "11834650,3505423",
                            "leaf": true
                        },
                        {
                            "text": "罗庄区",
                            "id": "371311",
                            "lnglat": "11829661,3497869",
                            "leaf": true
                        },
                        {
                            "text": "河东区",
                            "id": "371312",
                            "lnglat": "11721628,3913625",
                            "leaf": true
                        },
                        {
                            "text": "沂南县",
                            "id": "371321",
                            "lnglat": "11845961,3554966",
                            "leaf": true
                        },
                        {
                            "text": "郯城县",
                            "id": "371322",
                            "lnglat": "11834138,3461481",
                            "leaf": true
                        },
                        {
                            "text": "沂水县",
                            "id": "371323",
                            "lnglat": "11862738,3578809",
                            "leaf": true
                        },
                        {
                            "text": "苍山县",
                            "id": "371324",
                            "lnglat": "11804427,3485459",
                            "leaf": true
                        },
                        {
                            "text": "费县",
                            "id": "371325",
                            "lnglat": "11797040,3526990",
                            "leaf": true
                        },
                        {
                            "text": "平邑县",
                            "id": "371326",
                            "lnglat": "11762765,3550558",
                            "leaf": true
                        },
                        {
                            "text": "莒南县",
                            "id": "371327",
                            "lnglat": "11883203,3517643",
                            "leaf": true
                        },
                        {
                            "text": "蒙阴县",
                            "id": "371328",
                            "lnglat": "11792636,3571136",
                            "leaf": true
                        },
                        {
                            "text": "临沭县",
                            "id": "371329",
                            "lnglat": "11864101,3491984",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "聊城市",
                    "id": "371500",
                    "lnglat": "11597994,3645686",
                    "children": [
                        {
                            "text": "东昌府区",
                            "id": "371502",
                            "lnglat": "11598936,3643620",
                            "leaf": true
                        },
                        {
                            "text": "阳谷县",
                            "id": "371521",
                            "lnglat": "11577262,3611246",
                            "leaf": true
                        },
                        {
                            "text": "莘县",
                            "id": "371522",
                            "lnglat": "11566213,3623685",
                            "leaf": true
                        },
                        {
                            "text": "茌平县",
                            "id": "371523",
                            "lnglat": "11625153,3659065",
                            "leaf": true
                        },
                        {
                            "text": "东阿县",
                            "id": "371524",
                            "lnglat": "11624013,3633257",
                            "leaf": true
                        },
                        {
                            "text": "冠县",
                            "id": "371525",
                            "lnglat": "11543223,3647891",
                            "leaf": true
                        },
                        {
                            "text": "高唐县",
                            "id": "371526",
                            "lnglat": "11622090,3685978",
                            "leaf": true
                        },
                        {
                            "text": "临清市",
                            "id": "371581",
                            "lnglat": "11570036,3684635",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "莱芜市",
                    "id": "371200",
                    "lnglat": "11766940,3621379",
                    "children": [
                        {
                            "text": "莱城区",
                            "id": "371202",
                            "lnglat": "11767189,3619916",
                            "leaf": true
                        },
                        {
                            "text": "钢城区",
                            "id": "371203",
                            "lnglat": "11780655,3607930",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "济宁市",
                    "id": "370800",
                    "lnglat": "11658144,3541508",
                    "children": [
                        {
                            "text": "市中区",
                            "id": "370802",
                            "lnglat": "11659124,3540819",
                            "leaf": true
                        },
                        {
                            "text": "任城区",
                            "id": "370811",
                            "lnglat": "11655314,3531515",
                            "leaf": true
                        },
                        {
                            "text": "微山县",
                            "id": "370826",
                            "lnglat": "11711730,3481087",
                            "leaf": true
                        },
                        {
                            "text": "鱼台县",
                            "id": "370827",
                            "lnglat": "11664470,3499659",
                            "leaf": true
                        },
                        {
                            "text": "金乡县",
                            "id": "370828",
                            "lnglat": "11630249,3506881",
                            "leaf": true
                        },
                        {
                            "text": "嘉祥县",
                            "id": "370829",
                            "lnglat": "11633594,3539857",
                            "leaf": true
                        },
                        {
                            "text": "汶上县",
                            "id": "370830",
                            "lnglat": "11648550,3572449",
                            "leaf": true
                        },
                        {
                            "text": "泗水县",
                            "id": "370831",
                            "lnglat": "11727186,3565957",
                            "leaf": true
                        },
                        {
                            "text": "梁山县",
                            "id": "370832",
                            "lnglat": "11608309,3581267",
                            "leaf": true
                        },
                        {
                            "text": "曲阜市",
                            "id": "370881",
                            "lnglat": "11698342,3559680",
                            "leaf": true
                        },
                        {
                            "text": "兖州市",
                            "id": "370882",
                            "lnglat": "11682329,3555405",
                            "leaf": true
                        },
                        {
                            "text": "邹城市",
                            "id": "370883",
                            "lnglat": "11696176,3540247",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "东营市",
                    "id": "370500",
                    "lnglat": "11866868,3743247",
                    "children": [
                        {
                            "text": "东营区",
                            "id": "370502",
                            "lnglat": "11849396,3748270",
                            "leaf": true
                        },
                        {
                            "text": "河口区",
                            "id": "370503",
                            "lnglat": "11852972,3789204",
                            "leaf": true
                        },
                        {
                            "text": "垦利县",
                            "id": "370521",
                            "lnglat": "11854323,3759244",
                            "leaf": true
                        },
                        {
                            "text": "利津县",
                            "id": "370522",
                            "lnglat": "11825236,3749429",
                            "leaf": true
                        },
                        {
                            "text": "广饶县",
                            "id": "370523",
                            "lnglat": "11839982,3705203",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "德州市",
                    "id": "371400",
                    "lnglat": "11629707,3745018",
                    "children": [
                        {
                            "text": "德城区",
                            "id": "371402",
                            "lnglat": "11632133,3744592",
                            "leaf": true
                        },
                        {
                            "text": "陵县",
                            "id": "371421",
                            "lnglat": "11656994,3733601",
                            "leaf": true
                        },
                        {
                            "text": "宁津县",
                            "id": "371422",
                            "lnglat": "11679229,3764857",
                            "leaf": true
                        },
                        {
                            "text": "庆云县",
                            "id": "371423",
                            "lnglat": "11737514,3777223",
                            "leaf": true
                        },
                        {
                            "text": "临邑县",
                            "id": "371424",
                            "lnglat": "11686632,3718943",
                            "leaf": true
                        },
                        {
                            "text": "齐河县",
                            "id": "371425",
                            "lnglat": "11675301,3679543",
                            "leaf": true
                        },
                        {
                            "text": "平原县",
                            "id": "371426",
                            "lnglat": "11642323,3716373",
                            "leaf": true
                        },
                        {
                            "text": "夏津县",
                            "id": "371427",
                            "lnglat": "11599289,3694763",
                            "leaf": true
                        },
                        {
                            "text": "武城县",
                            "id": "371428",
                            "lnglat": "11606484,3721408",
                            "leaf": true
                        },
                        {
                            "text": "乐陵市",
                            "id": "371481",
                            "lnglat": "11720797,3772973",
                            "leaf": true
                        },
                        {
                            "text": "禹城市",
                            "id": "371482",
                            "lnglat": "11663499,3693017",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "滨州市",
                    "id": "371600",
                    "lnglat": "11801190,3737758",
                    "children": [
                        {
                            "text": "滨城区",
                            "id": "371602",
                            "lnglat": "11799527,3737243",
                            "leaf": true
                        },
                        {
                            "text": "惠民县",
                            "id": "371621",
                            "lnglat": "11749988,3748797",
                            "leaf": true
                        },
                        {
                            "text": "阳信县",
                            "id": "371622",
                            "lnglat": "11757084,3764818",
                            "leaf": true
                        },
                        {
                            "text": "无棣县",
                            "id": "371623",
                            "lnglat": "11759606,3774212",
                            "leaf": true
                        },
                        {
                            "text": "沾化县",
                            "id": "371624",
                            "lnglat": "11811769,3770428",
                            "leaf": true
                        },
                        {
                            "text": "博兴县",
                            "id": "371625",
                            "lnglat": "11812565,3714284",
                            "leaf": true
                        },
                        {
                            "text": "邹平县",
                            "id": "371626",
                            "lnglat": "11772595,3688448",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "菏泽市",
                    "id": "371700",
                    "lnglat": "11544983,3524871",
                    "children": [
                        {
                            "text": "牡丹区",
                            "id": "371702",
                            "lnglat": "11544284,3525944",
                            "leaf": true
                        },
                        {
                            "text": "曹县",
                            "id": "371721",
                            "lnglat": "11554125,3482552",
                            "leaf": true
                        },
                        {
                            "text": "单县",
                            "id": "371722",
                            "lnglat": "11607974,3479032",
                            "leaf": true
                        },
                        {
                            "text": "成武县",
                            "id": "371723",
                            "lnglat": "11587048,3496270",
                            "leaf": true
                        },
                        {
                            "text": "巨野县",
                            "id": "371724",
                            "lnglat": "11608599,3539533",
                            "leaf": true
                        },
                        {
                            "text": "郓城县",
                            "id": "371725",
                            "lnglat": "11593520,3560046",
                            "leaf": true
                        },
                        {
                            "text": "鄄城县",
                            "id": "371726",
                            "lnglat": "11550761,3556731",
                            "leaf": true
                        },
                        {
                            "text": "定陶县",
                            "id": "371727",
                            "lnglat": "11555839,3507699",
                            "leaf": true
                        },
                        {
                            "text": "东明县",
                            "id": "371728",
                            "lnglat": "11508559,3529271",
                            "leaf": true
                        }
                    ]
                }
            ]
        },
        {
            "text": "江西省",
            "id": "360000",
            "lnglat": "11591655,2866246",
            "children": [
                {
                    "text": "南昌市",
                    "id": "360100",
                    "lnglat": "11591655,2866246",
                    "children": [
                        {
                            "text": "东湖区",
                            "id": "360102",
                            "lnglat": "11590259,2870186",
                            "leaf": true
                        },
                        {
                            "text": "西湖区",
                            "id": "360103",
                            "lnglat": "11589646,2866643",
                            "leaf": true
                        },
                        {
                            "text": "青云谱区",
                            "id": "360104",
                            "lnglat": "11590580,2863033",
                            "leaf": true
                        },
                        {
                            "text": "湾里区",
                            "id": "360105",
                            "lnglat": "11572639,2871864",
                            "leaf": true
                        },
                        {
                            "text": "青山湖区",
                            "id": "360111",
                            "lnglat": "11585009,2874252",
                            "leaf": true
                        },
                        {
                            "text": "南昌县",
                            "id": "360121",
                            "lnglat": "11593566,2855363",
                            "leaf": true
                        },
                        {
                            "text": "新建县",
                            "id": "360122",
                            "lnglat": "11581572,2868454",
                            "leaf": true
                        },
                        {
                            "text": "安义县",
                            "id": "360123",
                            "lnglat": "11554723,2884330",
                            "leaf": true
                        },
                        {
                            "text": "进贤县",
                            "id": "360124",
                            "lnglat": "11626358,2836788",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "鹰潭市",
                    "id": "360600",
                    "lnglat": "11702708,2824294",
                    "children": [
                        {
                            "text": "月湖区",
                            "id": "360602",
                            "lnglat": "11703715,2824249",
                            "leaf": true
                        },
                        {
                            "text": "余江县",
                            "id": "360622",
                            "lnglat": "11681785,2821070",
                            "leaf": true
                        },
                        {
                            "text": "贵溪市",
                            "id": "360681",
                            "lnglat": "11720966,2829122",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "宜春市",
                    "id": "360900",
                    "lnglat": "11439030,2779960",
                    "children": [
                        {
                            "text": "袁州区",
                            "id": "360902",
                            "lnglat": "11437924,2779341",
                            "leaf": true
                        },
                        {
                            "text": "奉新县",
                            "id": "360921",
                            "lnglat": "11538360,2870620",
                            "leaf": true
                        },
                        {
                            "text": "万载县",
                            "id": "360922",
                            "lnglat": "11444296,2811187",
                            "leaf": true
                        },
                        {
                            "text": "上高县",
                            "id": "360923",
                            "lnglat": "11492025,2824295",
                            "leaf": true
                        },
                        {
                            "text": "宜丰县",
                            "id": "360924",
                            "lnglat": "11477491,2839022",
                            "leaf": true
                        },
                        {
                            "text": "靖安县",
                            "id": "360925",
                            "lnglat": "11534617,2886332",
                            "leaf": true
                        },
                        {
                            "text": "铜鼓县",
                            "id": "360926",
                            "lnglat": "11435722,2852167",
                            "leaf": true
                        },
                        {
                            "text": "丰城市",
                            "id": "360981",
                            "lnglat": "11578458,2819367",
                            "leaf": true
                        },
                        {
                            "text": "樟树市",
                            "id": "360982",
                            "lnglat": "11553866,2806597",
                            "leaf": true
                        },
                        {
                            "text": "高安市",
                            "id": "360983",
                            "lnglat": "11537202,2841676",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "新余市",
                    "id": "360500",
                    "lnglat": "11491368,2782167",
                    "children": [
                        {
                            "text": "渝水区",
                            "id": "360502",
                            "lnglat": "11493592,2780157",
                            "leaf": true
                        },
                        {
                            "text": "分宜县",
                            "id": "360521",
                            "lnglat": "11466209,2781745",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "上饶市",
                    "id": "361100",
                    "lnglat": "11796646,2844695",
                    "children": [
                        {
                            "text": "信州区",
                            "id": "361102",
                            "lnglat": "11796506,2844868",
                            "leaf": true
                        },
                        {
                            "text": "上饶县",
                            "id": "361121",
                            "lnglat": "11791915,2844050",
                            "leaf": true
                        },
                        {
                            "text": "广丰县",
                            "id": "361122",
                            "lnglat": "11818555,2844158",
                            "leaf": true
                        },
                        {
                            "text": "玉山县",
                            "id": "361123",
                            "lnglat": "11825101,2868071",
                            "leaf": true
                        },
                        {
                            "text": "铅山县",
                            "id": "361124",
                            "lnglat": "11770797,2831942",
                            "leaf": true
                        },
                        {
                            "text": "横峰县",
                            "id": "361125",
                            "lnglat": "11762139,2842922",
                            "leaf": true
                        },
                        {
                            "text": "弋阳县",
                            "id": "361126",
                            "lnglat": "11742553,2840241",
                            "leaf": true
                        },
                        {
                            "text": "余干县",
                            "id": "361127",
                            "lnglat": "11668526,2869492",
                            "leaf": true
                        },
                        {
                            "text": "鄱阳县",
                            "id": "361128",
                            "lnglat": "11674349,2924018",
                            "leaf": true
                        },
                        {
                            "text": "万年县",
                            "id": "361129",
                            "lnglat": "11707938,2869814",
                            "leaf": true
                        },
                        {
                            "text": "婺源县",
                            "id": "361130",
                            "lnglat": "11785571,2925126",
                            "leaf": true
                        },
                        {
                            "text": "德兴市",
                            "id": "361181",
                            "lnglat": "11757154,2895387",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "萍乡市",
                    "id": "360300",
                    "lnglat": "11384902,2762671",
                    "children": [
                        {
                            "text": "安源区",
                            "id": "360302",
                            "lnglat": "11389207,2760668",
                            "leaf": true
                        },
                        {
                            "text": "湘东区",
                            "id": "360313",
                            "lnglat": "11373570,2764797",
                            "leaf": true
                        },
                        {
                            "text": "莲花县",
                            "id": "360321",
                            "lnglat": "11394778,2712950",
                            "leaf": true
                        },
                        {
                            "text": "上栗县",
                            "id": "360322",
                            "lnglat": "11379414,2787698",
                            "leaf": true
                        },
                        {
                            "text": "芦溪县",
                            "id": "360323",
                            "lnglat": "11403446,2763664",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "九江市",
                    "id": "360400",
                    "lnglat": "11598961,2971515",
                    "children": [
                        {
                            "text": "庐山区",
                            "id": "360402",
                            "lnglat": "11598417,2968561",
                            "leaf": true
                        },
                        {
                            "text": "浔阳区",
                            "id": "360403",
                            "lnglat": "11597658,2972511",
                            "leaf": true
                        },
                        {
                            "text": "九江县",
                            "id": "360421",
                            "lnglat": "11588252,2961597",
                            "leaf": true
                        },
                        {
                            "text": "武宁县",
                            "id": "360423",
                            "lnglat": "11509120,2926495",
                            "leaf": true
                        },
                        {
                            "text": "修水县",
                            "id": "360424",
                            "lnglat": "11456064,2903801",
                            "leaf": true
                        },
                        {
                            "text": "永修县",
                            "id": "360425",
                            "lnglat": "11580296,2902659",
                            "leaf": true
                        },
                        {
                            "text": "德安县",
                            "id": "360426",
                            "lnglat": "11575742,2933199",
                            "leaf": true
                        },
                        {
                            "text": "星子县",
                            "id": "360427",
                            "lnglat": "11603620,2945430",
                            "leaf": true
                        },
                        {
                            "text": "都昌县",
                            "id": "360428",
                            "lnglat": "11618572,2926479",
                            "leaf": true
                        },
                        {
                            "text": "湖口县",
                            "id": "360429",
                            "lnglat": "11621696,2974407",
                            "leaf": true
                        },
                        {
                            "text": "彭泽县",
                            "id": "360430",
                            "lnglat": "11654549,2989867",
                            "leaf": true
                        },
                        {
                            "text": "瑞昌市",
                            "id": "360481",
                            "lnglat": "11566216,2968113",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "景德镇市",
                    "id": "360200",
                    "lnglat": "11720185,2929635",
                    "children": [
                        {
                            "text": "昌江区",
                            "id": "360202",
                            "lnglat": "11720694,2928737",
                            "leaf": true
                        },
                        {
                            "text": "珠山区",
                            "id": "360203",
                            "lnglat": "11720279,2930008",
                            "leaf": true
                        },
                        {
                            "text": "浮梁县",
                            "id": "360222",
                            "lnglat": "11724567,2937683",
                            "leaf": true
                        },
                        {
                            "text": "乐平市",
                            "id": "360281",
                            "lnglat": "11711421,2897074",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "吉安市",
                    "id": "360800",
                    "lnglat": "11498511,2711408",
                    "children": [
                        {
                            "text": "吉州区",
                            "id": "360802",
                            "lnglat": "11497788,2711195",
                            "leaf": true
                        },
                        {
                            "text": "青原区",
                            "id": "360803",
                            "lnglat": "11500173,2709898",
                            "leaf": true
                        },
                        {
                            "text": "吉安县",
                            "id": "360821",
                            "lnglat": "11490447,2704513",
                            "leaf": true
                        },
                        {
                            "text": "吉水县",
                            "id": "360822",
                            "lnglat": "11512874,2721425",
                            "leaf": true
                        },
                        {
                            "text": "峡江县",
                            "id": "360823",
                            "lnglat": "11512953,2756261",
                            "leaf": true
                        },
                        {
                            "text": "新干县",
                            "id": "360824",
                            "lnglat": "11539192,2776221",
                            "leaf": true
                        },
                        {
                            "text": "永丰县",
                            "id": "360825",
                            "lnglat": "11543336,2732131",
                            "leaf": true
                        },
                        {
                            "text": "泰和县",
                            "id": "360826",
                            "lnglat": "11488381,2679289",
                            "leaf": true
                        },
                        {
                            "text": "遂川县",
                            "id": "360827",
                            "lnglat": "11450063,2632722",
                            "leaf": true
                        },
                        {
                            "text": "万安县",
                            "id": "360828",
                            "lnglat": "11478928,2645881",
                            "leaf": true
                        },
                        {
                            "text": "安福县",
                            "id": "360829",
                            "lnglat": "11458634,2737932",
                            "leaf": true
                        },
                        {
                            "text": "永新县",
                            "id": "360830",
                            "lnglat": "11423163,2696206",
                            "leaf": true
                        },
                        {
                            "text": "井冈山市",
                            "id": "360881",
                            "lnglat": "11416364,2657016",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "赣州市",
                    "id": "360700",
                    "lnglat": "11493688,2585251",
                    "children": [
                        {
                            "text": "章贡区",
                            "id": "360702",
                            "lnglat": "11493834,2585069",
                            "leaf": true
                        },
                        {
                            "text": "赣县",
                            "id": "360721",
                            "lnglat": "11501900,2587076",
                            "leaf": true
                        },
                        {
                            "text": "信丰县",
                            "id": "360722",
                            "lnglat": "11492992,2538214",
                            "leaf": true
                        },
                        {
                            "text": "大余县",
                            "id": "360723",
                            "lnglat": "11435861,2540229",
                            "leaf": true
                        },
                        {
                            "text": "上犹县",
                            "id": "360724",
                            "lnglat": "11452795,2579851",
                            "leaf": true
                        },
                        {
                            "text": "崇义县",
                            "id": "360725",
                            "lnglat": "11429685,2569918",
                            "leaf": true
                        },
                        {
                            "text": "安远县",
                            "id": "360726",
                            "lnglat": "11538965,2514049",
                            "leaf": true
                        },
                        {
                            "text": "龙南县",
                            "id": "360727",
                            "lnglat": "11478419,2491192",
                            "leaf": true
                        },
                        {
                            "text": "定南县",
                            "id": "360728",
                            "lnglat": "11502473,2477871",
                            "leaf": true
                        },
                        {
                            "text": "全南县",
                            "id": "360729",
                            "lnglat": "11452516,2474773",
                            "leaf": true
                        },
                        {
                            "text": "宁都县",
                            "id": "360730",
                            "lnglat": "11600927,2647605",
                            "leaf": true
                        },
                        {
                            "text": "于都县",
                            "id": "360731",
                            "lnglat": "11541359,2596099",
                            "leaf": true
                        },
                        {
                            "text": "兴国县",
                            "id": "360732",
                            "lnglat": "11534839,2633229",
                            "leaf": true
                        },
                        {
                            "text": "会昌县",
                            "id": "360733",
                            "lnglat": "11577753,2560397",
                            "leaf": true
                        },
                        {
                            "text": "寻乌县",
                            "id": "360734",
                            "lnglat": "11564233,2495274",
                            "leaf": true
                        },
                        {
                            "text": "石城县",
                            "id": "360735",
                            "lnglat": "11631836,2633404",
                            "leaf": true
                        },
                        {
                            "text": "瑞金市",
                            "id": "360781",
                            "lnglat": "11602565,2587813",
                            "leaf": true
                        },
                        {
                            "text": "南康市",
                            "id": "360782",
                            "lnglat": "11474610,2565952",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "抚州市",
                    "id": "361000",
                    "lnglat": "11635463,2799251",
                    "children": [
                        {
                            "text": "临川区",
                            "id": "361002",
                            "lnglat": "11634899,2800350",
                            "leaf": true
                        },
                        {
                            "text": "南城县",
                            "id": "361021",
                            "lnglat": "11663307,2755959",
                            "leaf": true
                        },
                        {
                            "text": "黎川县",
                            "id": "361022",
                            "lnglat": "11690780,2729837",
                            "leaf": true
                        },
                        {
                            "text": "南丰县",
                            "id": "361023",
                            "lnglat": "11652631,2721031",
                            "leaf": true
                        },
                        {
                            "text": "崇仁县",
                            "id": "361024",
                            "lnglat": "11604734,2776452",
                            "leaf": true
                        },
                        {
                            "text": "乐安县",
                            "id": "361025",
                            "lnglat": "11583499,2742924",
                            "leaf": true
                        },
                        {
                            "text": "宜黄县",
                            "id": "361026",
                            "lnglat": "11621559,2754935",
                            "leaf": true
                        },
                        {
                            "text": "金溪县",
                            "id": "361027",
                            "lnglat": "11677971,2790773",
                            "leaf": true
                        },
                        {
                            "text": "资溪县",
                            "id": "361028",
                            "lnglat": "11706196,2771023",
                            "leaf": true
                        },
                        {
                            "text": "东乡县",
                            "id": "361029",
                            "lnglat": "11661797,2823586",
                            "leaf": true
                        },
                        {
                            "text": "广昌县",
                            "id": "361030",
                            "lnglat": "11629665,2684254",
                            "leaf": true
                        }
                    ]
                }
            ]
        },
        {
            "text": "福建省",
            "id": "350000",
            "lnglat": "11930491,2607912",
            "children": [
                {
                    "text": "福州市",
                    "id": "350100",
                    "lnglat": "11930491,2607912",
                    "children": [
                        {
                            "text": "鼓楼区",
                            "id": "350102",
                            "lnglat": "11929944,2608485",
                            "leaf": true
                        },
                        {
                            "text": "台江区",
                            "id": "350103",
                            "lnglat": "11930394,2606551",
                            "leaf": true
                        },
                        {
                            "text": "仓山区",
                            "id": "350104",
                            "lnglat": "11931050,2604637",
                            "leaf": true
                        },
                        {
                            "text": "马尾区",
                            "id": "350105",
                            "lnglat": "11944394,2599248",
                            "leaf": true
                        },
                        {
                            "text": "晋安区",
                            "id": "350111",
                            "lnglat": "11932373,2608464",
                            "leaf": true
                        },
                        {
                            "text": "闽侯县",
                            "id": "350121",
                            "lnglat": "11913473,2614994",
                            "leaf": true
                        },
                        {
                            "text": "连江县",
                            "id": "350122",
                            "lnglat": "11953622,2620131",
                            "leaf": true
                        },
                        {
                            "text": "罗源县",
                            "id": "350123",
                            "lnglat": "11954361,2649096",
                            "leaf": true
                        },
                        {
                            "text": "闽清县",
                            "id": "350124",
                            "lnglat": "11885916,2622430",
                            "leaf": true
                        },
                        {
                            "text": "永泰县",
                            "id": "350125",
                            "lnglat": "11893170,2587058",
                            "leaf": true
                        },
                        {
                            "text": "平潭县",
                            "id": "350128",
                            "lnglat": "11975844,2550639",
                            "leaf": true
                        },
                        {
                            "text": "福清市",
                            "id": "350181",
                            "lnglat": "11937551,2572420",
                            "leaf": true
                        },
                        {
                            "text": "长乐市",
                            "id": "350182",
                            "lnglat": "11950840,2595810",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "厦门市",
                    "id": "350200",
                    "lnglat": "11809924,2446792",
                    "children": [
                        {
                            "text": "思明区",
                            "id": "350203",
                            "lnglat": "11810983,2447438",
                            "leaf": true
                        },
                        {
                            "text": "海沧区",
                            "id": "350205",
                            "lnglat": "11803026,2449826",
                            "leaf": true
                        },
                        {
                            "text": "湖里区",
                            "id": "350206",
                            "lnglat": "11809213,2451156",
                            "leaf": true
                        },
                        {
                            "text": "集美区",
                            "id": "350211",
                            "lnglat": "11809234,2457859",
                            "leaf": true
                        },
                        {
                            "text": "同安区",
                            "id": "350212",
                            "lnglat": "11814741,2472596",
                            "leaf": true
                        },
                        {
                            "text": "翔安区",
                            "id": "350213",
                            "lnglat": "11824068,2462152",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "泉州市",
                    "id": "350500",
                    "lnglat": "11859437,2491486",
                    "children": [
                        {
                            "text": "鲤城区",
                            "id": "350502",
                            "lnglat": "11859145,2490299",
                            "leaf": true
                        },
                        {
                            "text": "丰泽区",
                            "id": "350503",
                            "lnglat": "11860878,2489440",
                            "leaf": true
                        },
                        {
                            "text": "洛江区",
                            "id": "350504",
                            "lnglat": "11866663,2494278",
                            "leaf": true
                        },
                        {
                            "text": "泉港区",
                            "id": "350505",
                            "lnglat": "11891137,2512301",
                            "leaf": true
                        },
                        {
                            "text": "惠安县",
                            "id": "350521",
                            "lnglat": "11879306,2503309",
                            "leaf": true
                        },
                        {
                            "text": "安溪县",
                            "id": "350524",
                            "lnglat": "11818268,2507274",
                            "leaf": true
                        },
                        {
                            "text": "永春县",
                            "id": "350525",
                            "lnglat": "11829144,2532726",
                            "leaf": true
                        },
                        {
                            "text": "德化县",
                            "id": "350526",
                            "lnglat": "11824309,2549089",
                            "leaf": true
                        },
                        {
                            "text": "金门县",
                            "id": "350527",
                            "lnglat": "11816420,2446170",
                            "leaf": true
                        },
                        {
                            "text": "石狮市",
                            "id": "350581",
                            "lnglat": "11862234,2473794",
                            "leaf": true
                        },
                        {
                            "text": "晋江市",
                            "id": "350582",
                            "lnglat": "11857498,2481827",
                            "leaf": true
                        },
                        {
                            "text": "南安市",
                            "id": "350583",
                            "lnglat": "11838257,2496372",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "漳州市",
                    "id": "350600",
                    "lnglat": "11765339,2451441",
                    "children": [
                        {
                            "text": "芗城区",
                            "id": "350602",
                            "lnglat": "11764933,2451359",
                            "leaf": true
                        },
                        {
                            "text": "龙文区",
                            "id": "350603",
                            "lnglat": "11770541,2450729",
                            "leaf": true
                        },
                        {
                            "text": "云霄县",
                            "id": "350622",
                            "lnglat": "11733246,2396123",
                            "leaf": true
                        },
                        {
                            "text": "漳浦县",
                            "id": "350623",
                            "lnglat": "11760961,2411728",
                            "leaf": true
                        },
                        {
                            "text": "诏安县",
                            "id": "350624",
                            "lnglat": "11717816,2371030",
                            "leaf": true
                        },
                        {
                            "text": "长泰县",
                            "id": "350625",
                            "lnglat": "11775307,2462653",
                            "leaf": true
                        },
                        {
                            "text": "东山县",
                            "id": "350626",
                            "lnglat": "11742573,2370115",
                            "leaf": true
                        },
                        {
                            "text": "南靖县",
                            "id": "350627",
                            "lnglat": "11736547,2451617",
                            "leaf": true
                        },
                        {
                            "text": "平和县",
                            "id": "350628",
                            "lnglat": "11730858,2436665",
                            "leaf": true
                        },
                        {
                            "text": "华安县",
                            "id": "350629",
                            "lnglat": "11753324,2500405",
                            "leaf": true
                        },
                        {
                            "text": "龙海市",
                            "id": "350681",
                            "lnglat": "11781450,2445055",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "三明市",
                    "id": "350400",
                    "lnglat": "11763373,2626706",
                    "children": [
                        {
                            "text": "梅列区",
                            "id": "350402",
                            "lnglat": "11763895,2628144",
                            "leaf": true
                        },
                        {
                            "text": "三元区",
                            "id": "350403",
                            "lnglat": "11760329,2623715",
                            "leaf": true
                        },
                        {
                            "text": "明溪县",
                            "id": "350421",
                            "lnglat": "11719741,2635785",
                            "leaf": true
                        },
                        {
                            "text": "清流县",
                            "id": "350423",
                            "lnglat": "11681800,2618381",
                            "leaf": true
                        },
                        {
                            "text": "宁化县",
                            "id": "350424",
                            "lnglat": "11665069,2625699",
                            "leaf": true
                        },
                        {
                            "text": "大田县",
                            "id": "350425",
                            "lnglat": "11784158,2569327",
                            "leaf": true
                        },
                        {
                            "text": "尤溪县",
                            "id": "350426",
                            "lnglat": "11818147,2617430",
                            "leaf": true
                        },
                        {
                            "text": "沙县",
                            "id": "350427",
                            "lnglat": "11777818,2639510",
                            "leaf": true
                        },
                        {
                            "text": "将乐县",
                            "id": "350428",
                            "lnglat": "11746436,2673226",
                            "leaf": true
                        },
                        {
                            "text": "泰宁县",
                            "id": "350429",
                            "lnglat": "11716893,2689999",
                            "leaf": true
                        },
                        {
                            "text": "建宁县",
                            "id": "350430",
                            "lnglat": "11683852,2683397",
                            "leaf": true
                        },
                        {
                            "text": "永安市",
                            "id": "350481",
                            "lnglat": "11735654,2597973",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "莆田市",
                    "id": "350300",
                    "lnglat": "11900669,2543473",
                    "children": [
                        {
                            "text": "城厢区",
                            "id": "350302",
                            "lnglat": "11899001,2542157",
                            "leaf": true
                        },
                        {
                            "text": "涵江区",
                            "id": "350303",
                            "lnglat": "11911968,2545565",
                            "leaf": true
                        },
                        {
                            "text": "荔城区",
                            "id": "350304",
                            "lnglat": "11900893,2543632",
                            "leaf": true
                        },
                        {
                            "text": "秀屿区",
                            "id": "350305",
                            "lnglat": "11910074,2532098",
                            "leaf": true
                        },
                        {
                            "text": "仙游县",
                            "id": "350322",
                            "lnglat": "11868894,2536442",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "宁德市",
                    "id": "350900",
                    "lnglat": "11952011,2666696",
                    "children": [
                        {
                            "text": "蕉城区",
                            "id": "350902",
                            "lnglat": "11945913,2674820",
                            "leaf": true
                        },
                        {
                            "text": "霞浦县",
                            "id": "350921",
                            "lnglat": "11999582,2688853",
                            "leaf": true
                        },
                        {
                            "text": "古田县",
                            "id": "350922",
                            "lnglat": "11873565,2657973",
                            "leaf": true
                        },
                        {
                            "text": "屏南县",
                            "id": "350923",
                            "lnglat": "11898095,2691351",
                            "leaf": true
                        },
                        {
                            "text": "寿宁县",
                            "id": "350924",
                            "lnglat": "11949844,2746005",
                            "leaf": true
                        },
                        {
                            "text": "周宁县",
                            "id": "350925",
                            "lnglat": "11933103,2710651",
                            "leaf": true
                        },
                        {
                            "text": "柘荣县",
                            "id": "350926",
                            "lnglat": "11989479,2723856",
                            "leaf": true
                        },
                        {
                            "text": "福安市",
                            "id": "350981",
                            "lnglat": "11964306,2709266",
                            "leaf": true
                        },
                        {
                            "text": "福鼎市",
                            "id": "350982",
                            "lnglat": "12020845,2733260",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "南平市",
                    "id": "350700",
                    "lnglat": "11817304,2664459",
                    "children": [
                        {
                            "text": "延平区",
                            "id": "350702",
                            "lnglat": "11825634,2656261",
                            "leaf": true
                        },
                        {
                            "text": "顺昌县",
                            "id": "350721",
                            "lnglat": "11780248,2679807",
                            "leaf": true
                        },
                        {
                            "text": "浦城县",
                            "id": "350722",
                            "lnglat": "11853300,2792096",
                            "leaf": true
                        },
                        {
                            "text": "光泽县",
                            "id": "350723",
                            "lnglat": "11732747,2754357",
                            "leaf": true
                        },
                        {
                            "text": "松溪县",
                            "id": "350724",
                            "lnglat": "11877851,2752632",
                            "leaf": true
                        },
                        {
                            "text": "政和县",
                            "id": "350725",
                            "lnglat": "11884935,2736795",
                            "leaf": true
                        },
                        {
                            "text": "邵武市",
                            "id": "350781",
                            "lnglat": "11746178,2735592",
                            "leaf": true
                        },
                        {
                            "text": "武夷山市",
                            "id": "350782",
                            "lnglat": "11802553,2776012",
                            "leaf": true
                        },
                        {
                            "text": "建瓯市",
                            "id": "350783",
                            "lnglat": "11832274,2704060",
                            "leaf": true
                        },
                        {
                            "text": "建阳市",
                            "id": "350784",
                            "lnglat": "11811841,2733186",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "龙岩市",
                    "id": "350800",
                    "lnglat": "11702706,2509539",
                    "children": [
                        {
                            "text": "新罗区",
                            "id": "350802",
                            "lnglat": "11700375,2518719",
                            "leaf": true
                        },
                        {
                            "text": "长汀县",
                            "id": "350821",
                            "lnglat": "11634791,2583302",
                            "leaf": true
                        },
                        {
                            "text": "永定县",
                            "id": "350822",
                            "lnglat": "11672497,2472593",
                            "leaf": true
                        },
                        {
                            "text": "上杭县",
                            "id": "350823",
                            "lnglat": "11642157,2505335",
                            "leaf": true
                        },
                        {
                            "text": "武平县",
                            "id": "350824",
                            "lnglat": "11609381,2510275",
                            "leaf": true
                        },
                        {
                            "text": "连城县",
                            "id": "350825",
                            "lnglat": "11675589,2571457",
                            "leaf": true
                        },
                        {
                            "text": "漳平市",
                            "id": "350881",
                            "lnglat": "11740715,2529351",
                            "leaf": true
                        }
                    ]
                }
            ]
        },
        {
            "text": "台湾省",
            "id": "710000",
            "lnglat": "12103795,2360374",
            "children": [
                {
                    "text": "台北市",
                    "lnglat": "12153225,2503022",
                    "leaf": true
                },
                {
                    "text": "新竹市",
                    "lnglat": "12094670,2477758",
                    "leaf": true
                },
                {
                    "text": "嘉义市",
                    "lnglat": "12042570,2350286",
                    "leaf": true
                },
                {
                    "text": "台中市",
                    "lnglat": "12066806,2417210",
                    "leaf": true
                },
                {
                    "text": "高雄市",
                    "lnglat": "12028644,2264437",
                    "leaf": true
                },
                {
                    "text": "台南市",
                    "lnglat": "12021193,2299143",
                    "leaf": true
                },
                {
                    "text": "基隆市",
                    "lnglat": "12173398,2513201",
                    "leaf": true
                },
                {
                    "text": "南投县",
                    "lnglat": "12066959,2391545",
                    "leaf": true
                },
                {
                    "text": "台北县",
                    "lnglat": "12153225,2503022",
                    "leaf": true
                },
                {
                    "text": "宜兰县",
                    "lnglat": "12176221,2475820",
                    "leaf": true
                },
                {
                    "text": "花莲县",
                    "lnglat": "12161860,2397973",
                    "leaf": true
                },
                {
                    "text": "台东县",
                    "lnglat": "12116470,2275539",
                    "leaf": true
                },
                {
                    "text": "屏东县",
                    "lnglat": "12048351,2267678",
                    "leaf": true
                },
                {
                    "text": "高雄县",
                    "lnglat": "12028644,2264437",
                    "leaf": true
                },
                {
                    "text": "台南县",
                    "lnglat": "12034412,2315382",
                    "leaf": true
                },
                {
                    "text": "桃园县",
                    "lnglat": "12132526,2499207",
                    "leaf": true
                },
                {
                    "text": "新竹县",
                    "lnglat": "12094670,2477758",
                    "leaf": true
                },
                {
                    "text": "苗栗县",
                    "lnglat": "12081403,2457313",
                    "leaf": true
                },
                {
                    "text": "台中县",
                    "lnglat": "12066806,2417210",
                    "leaf": true
                },
                {
                    "text": "彰化县",
                    "lnglat": "12057065,2408474",
                    "leaf": true
                },
                {
                    "text": "云林县",
                    "lnglat": "12054151,2370991",
                    "leaf": true
                },
                {
                    "text": "嘉义县",
                    "lnglat": "12042570,2350286",
                    "leaf": true
                },
                {
                    "text": "澎湖县",
                    "lnglat": "11961912,2356611",
                    "leaf": true
                }
            ]
        },
        {
            "text": "湖南省",
            "id": "430000",
            "lnglat": "11299369,2819602",
            "children": [
                {
                    "text": "长沙市",
                    "id": "430100",
                    "lnglat": "11299369,2819602",
                    "children": [
                        {
                            "text": "芙蓉区",
                            "id": "430102",
                            "lnglat": "11302627,2818814",
                            "leaf": true
                        },
                        {
                            "text": "天心区",
                            "id": "430103",
                            "lnglat": "11298480,2811586",
                            "leaf": true
                        },
                        {
                            "text": "岳麓区",
                            "id": "430104",
                            "lnglat": "11292659,2823855",
                            "leaf": true
                        },
                        {
                            "text": "开福区",
                            "id": "430105",
                            "lnglat": "11298117,2825950",
                            "leaf": true
                        },
                        {
                            "text": "雨花区",
                            "id": "430111",
                            "lnglat": "11303007,2813829",
                            "leaf": true
                        },
                        {
                            "text": "长沙县",
                            "id": "430121",
                            "lnglat": "11312909,2822905",
                            "leaf": true
                        },
                        {
                            "text": "望城县",
                            "id": "430122",
                            "lnglat": "11281234,2837235",
                            "leaf": true
                        },
                        {
                            "text": "宁乡县",
                            "id": "430124",
                            "lnglat": "11255179,2825741",
                            "leaf": true
                        },
                        {
                            "text": "浏阳市",
                            "id": "430181",
                            "lnglat": "11362547,2814446",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "株洲市",
                    "id": "430200",
                    "lnglat": "11312818,2783166",
                    "children": [
                        {
                            "text": "荷塘区",
                            "id": "430202",
                            "lnglat": "11316714,2785906",
                            "leaf": true
                        },
                        {
                            "text": "芦淞区",
                            "id": "430203",
                            "lnglat": "11315343,2782799",
                            "leaf": true
                        },
                        {
                            "text": "石峰区",
                            "id": "430204",
                            "lnglat": "11311199,2787868",
                            "leaf": true
                        },
                        {
                            "text": "天元区",
                            "id": "430211",
                            "lnglat": "11311737,2783464",
                            "leaf": true
                        },
                        {
                            "text": "株洲县",
                            "id": "430221",
                            "lnglat": "11314383,2770449",
                            "leaf": true
                        },
                        {
                            "text": "攸县",
                            "id": "430223",
                            "lnglat": "11334012,2699881",
                            "leaf": true
                        },
                        {
                            "text": "茶陵县",
                            "id": "430224",
                            "lnglat": "11355465,2679852",
                            "leaf": true
                        },
                        {
                            "text": "炎陵县",
                            "id": "430225",
                            "lnglat": "11376682,2649457",
                            "leaf": true
                        },
                        {
                            "text": "醴陵市",
                            "id": "430281",
                            "lnglat": "11349317,2766377",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "张家界市",
                    "id": "430800",
                    "lnglat": "11050037,2913202",
                    "children": [
                        {
                            "text": "永定区",
                            "id": "430802",
                            "lnglat": "11047980,2912799",
                            "leaf": true
                        },
                        {
                            "text": "武陵源区",
                            "id": "430811",
                            "lnglat": "11056630,2935421",
                            "leaf": true
                        },
                        {
                            "text": "慈利县",
                            "id": "430821",
                            "lnglat": "11111878,2942752",
                            "leaf": true
                        },
                        {
                            "text": "桑植县",
                            "id": "430822",
                            "lnglat": "11015750,2939986",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "岳阳市",
                    "id": "430600",
                    "lnglat": "11311599,2937775",
                    "children": [
                        {
                            "text": "岳阳楼区",
                            "id": "430602",
                            "lnglat": "11312342,2937432",
                            "leaf": true
                        },
                        {
                            "text": "云溪区",
                            "id": "430603",
                            "lnglat": "11322936,2945229",
                            "leaf": true
                        },
                        {
                            "text": "君山区",
                            "id": "430611",
                            "lnglat": "11297979,2939313",
                            "leaf": true
                        },
                        {
                            "text": "岳阳县",
                            "id": "430621",
                            "lnglat": "11312431,2914589",
                            "leaf": true
                        },
                        {
                            "text": "华容县",
                            "id": "430623",
                            "lnglat": "11256800,2952858",
                            "leaf": true
                        },
                        {
                            "text": "湘阴县",
                            "id": "430624",
                            "lnglat": "11287651,2868273",
                            "leaf": true
                        },
                        {
                            "text": "平江县",
                            "id": "430626",
                            "lnglat": "11357832,2870825",
                            "leaf": true
                        },
                        {
                            "text": "汨罗市",
                            "id": "430681",
                            "lnglat": "11307485,2880693",
                            "leaf": true
                        },
                        {
                            "text": "临湘市",
                            "id": "430682",
                            "lnglat": "11344473,2948071",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "永州市",
                    "id": "431100",
                    "lnglat": "11161797,2622927",
                    "children": [
                        {
                            "text": "零陵区",
                            "id": "431102",
                            "lnglat": "11162423,2623420",
                            "leaf": true
                        },
                        {
                            "text": "冷水滩区",
                            "id": "431103",
                            "lnglat": "11157886,2644804",
                            "leaf": true
                        },
                        {
                            "text": "祁阳县",
                            "id": "431121",
                            "lnglat": "11185827,2658649",
                            "leaf": true
                        },
                        {
                            "text": "东安县",
                            "id": "431122",
                            "lnglat": "11128339,2639729",
                            "leaf": true
                        },
                        {
                            "text": "双牌县",
                            "id": "431123",
                            "lnglat": "11165389,2596295",
                            "leaf": true
                        },
                        {
                            "text": "道县",
                            "id": "431124",
                            "lnglat": "11158441,2552040",
                            "leaf": true
                        },
                        {
                            "text": "江永县",
                            "id": "431125",
                            "lnglat": "11133807,2527740",
                            "leaf": true
                        },
                        {
                            "text": "宁远县",
                            "id": "431126",
                            "lnglat": "11193456,2559619",
                            "leaf": true
                        },
                        {
                            "text": "蓝山县",
                            "id": "431127",
                            "lnglat": "11219168,2537462",
                            "leaf": true
                        },
                        {
                            "text": "新田县",
                            "id": "431128",
                            "lnglat": "11221548,2590833",
                            "leaf": true
                        },
                        {
                            "text": "江华瑶族自治县",
                            "id": "431129",
                            "lnglat": "11158171,2519125",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "益阳市",
                    "id": "430900",
                    "lnglat": "11234484,2858542",
                    "children": [
                        {
                            "text": "资阳区",
                            "id": "430902",
                            "lnglat": "11231854,2859417",
                            "leaf": true
                        },
                        {
                            "text": "赫山区",
                            "id": "430903",
                            "lnglat": "11236778,2858345",
                            "leaf": true
                        },
                        {
                            "text": "南县",
                            "id": "430921",
                            "lnglat": "11240921,2937561",
                            "leaf": true
                        },
                        {
                            "text": "桃江县",
                            "id": "430922",
                            "lnglat": "11212562,2851951",
                            "leaf": true
                        },
                        {
                            "text": "安化县",
                            "id": "430923",
                            "lnglat": "11121301,2838360",
                            "leaf": true
                        },
                        {
                            "text": "沅江市",
                            "id": "430981",
                            "lnglat": "11237954,2885125",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "湘西土家族苗族自治州",
                    "id": "433100",
                    "lnglat": "10973358,2831546",
                    "children": [
                        {
                            "text": "吉首市",
                            "id": "433101",
                            "lnglat": "10973290,2831797",
                            "leaf": true
                        },
                        {
                            "text": "泸溪县",
                            "id": "433122",
                            "lnglat": "11015581,2827952",
                            "leaf": true
                        },
                        {
                            "text": "凤凰县",
                            "id": "433123",
                            "lnglat": "10959594,2795049",
                            "leaf": true
                        },
                        {
                            "text": "花垣县",
                            "id": "433124",
                            "lnglat": "10947758,2858924",
                            "leaf": true
                        },
                        {
                            "text": "保靖县",
                            "id": "433125",
                            "lnglat": "10964002,2871418",
                            "leaf": true
                        },
                        {
                            "text": "古丈县",
                            "id": "433126",
                            "lnglat": "10994012,2862146",
                            "leaf": true
                        },
                        {
                            "text": "永顺县",
                            "id": "433127",
                            "lnglat": "10984610,2900498",
                            "leaf": true
                        },
                        {
                            "text": "龙山县",
                            "id": "433130",
                            "lnglat": "10943529,2945892",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "湘潭市",
                    "id": "430300",
                    "lnglat": "11290060,2786387",
                    "children": [
                        {
                            "text": "雨湖区",
                            "id": "430302",
                            "lnglat": "11289871,2787184",
                            "leaf": true
                        },
                        {
                            "text": "岳塘区",
                            "id": "430304",
                            "lnglat": "11291549,2781808",
                            "leaf": true
                        },
                        {
                            "text": "湘潭县",
                            "id": "430321",
                            "lnglat": "11295147,2786482",
                            "leaf": true
                        },
                        {
                            "text": "湘乡市",
                            "id": "430381",
                            "lnglat": "11252172,2773293",
                            "leaf": true
                        },
                        {
                            "text": "韶山市",
                            "id": "430382",
                            "lnglat": "11251071,2792811",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "邵阳市",
                    "id": "430500",
                    "lnglat": "11147724,2724231",
                    "children": [
                        {
                            "text": "双清区",
                            "id": "430502",
                            "lnglat": "11149230,2723605",
                            "leaf": true
                        },
                        {
                            "text": "大祥区",
                            "id": "430503",
                            "lnglat": "11144946,2723614",
                            "leaf": true
                        },
                        {
                            "text": "北塔区",
                            "id": "430511",
                            "lnglat": "11146357,2724790",
                            "leaf": true
                        },
                        {
                            "text": "邵东县",
                            "id": "430521",
                            "lnglat": "11174464,2724804",
                            "leaf": true
                        },
                        {
                            "text": "新邵县",
                            "id": "430522",
                            "lnglat": "11144379,2732103",
                            "leaf": true
                        },
                        {
                            "text": "邵阳县",
                            "id": "430523",
                            "lnglat": "11126587,2699428",
                            "leaf": true
                        },
                        {
                            "text": "隆回县",
                            "id": "430524",
                            "lnglat": "11102260,2712019",
                            "leaf": true
                        },
                        {
                            "text": "洞口县",
                            "id": "430525",
                            "lnglat": "11057875,2706481",
                            "leaf": true
                        },
                        {
                            "text": "绥宁县",
                            "id": "430527",
                            "lnglat": "11014925,2660481",
                            "leaf": true
                        },
                        {
                            "text": "新宁县",
                            "id": "430528",
                            "lnglat": "11084860,2643988",
                            "leaf": true
                        },
                        {
                            "text": "城步苗族自治县",
                            "id": "430529",
                            "lnglat": "11030845,2635970",
                            "leaf": true
                        },
                        {
                            "text": "武冈市",
                            "id": "430581",
                            "lnglat": "11063202,2673150",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "娄底市",
                    "id": "431300",
                    "lnglat": "11200175,2773400",
                    "children": [
                        {
                            "text": "娄星区",
                            "id": "431302",
                            "lnglat": "11200328,2778431",
                            "leaf": true
                        },
                        {
                            "text": "双峰县",
                            "id": "431321",
                            "lnglat": "11218602,2745735",
                            "leaf": true
                        },
                        {
                            "text": "新化县",
                            "id": "431322",
                            "lnglat": "11130144,2773957",
                            "leaf": true
                        },
                        {
                            "text": "冷水江市",
                            "id": "431381",
                            "lnglat": "11142987,2768629",
                            "leaf": true
                        },
                        {
                            "text": "涟源市",
                            "id": "431382",
                            "lnglat": "11166438,2769158",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "怀化市",
                    "id": "431200",
                    "lnglat": "10996634,2755401",
                    "children": [
                        {
                            "text": "鹤城区",
                            "id": "431202",
                            "lnglat": "11001345,2762358",
                            "leaf": true
                        },
                        {
                            "text": "中方县",
                            "id": "431221",
                            "lnglat": "10993723,2740354",
                            "leaf": true
                        },
                        {
                            "text": "沅陵县",
                            "id": "431222",
                            "lnglat": "11039368,2845507",
                            "leaf": true
                        },
                        {
                            "text": "辰溪县",
                            "id": "431223",
                            "lnglat": "11018487,2801096",
                            "leaf": true
                        },
                        {
                            "text": "溆浦县",
                            "id": "431224",
                            "lnglat": "11058638,2791392",
                            "leaf": true
                        },
                        {
                            "text": "会同县",
                            "id": "431225",
                            "lnglat": "10971387,2687500",
                            "leaf": true
                        },
                        {
                            "text": "麻阳苗族自治县",
                            "id": "431226",
                            "lnglat": "10980325,2787500",
                            "leaf": true
                        },
                        {
                            "text": "新晃侗族自治县",
                            "id": "431227",
                            "lnglat": "10916953,2736499",
                            "leaf": true
                        },
                        {
                            "text": "芷江侗族自治县",
                            "id": "431228",
                            "lnglat": "10968310,2744360",
                            "leaf": true
                        },
                        {
                            "text": "靖州苗族侗族自治县",
                            "id": "431229",
                            "lnglat": "10969055,2657973",
                            "leaf": true
                        },
                        {
                            "text": "通道侗族自治县",
                            "id": "431230",
                            "lnglat": "10977575,2616171",
                            "leaf": true
                        },
                        {
                            "text": "洪江市",
                            "id": "431281",
                            "lnglat": "10981343,2719492",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "衡阳市",
                    "id": "430400",
                    "lnglat": "11260608,2689977",
                    "children": [
                        {
                            "text": "珠晖区",
                            "id": "430405",
                            "lnglat": "11261492,2689827",
                            "leaf": true
                        },
                        {
                            "text": "雁峰区",
                            "id": "430406",
                            "lnglat": "11261156,2689246",
                            "leaf": true
                        },
                        {
                            "text": "石鼓区",
                            "id": "430407",
                            "lnglat": "11260550,2690595",
                            "leaf": true
                        },
                        {
                            "text": "蒸湘区",
                            "id": "430408",
                            "lnglat": "11259825,2689982",
                            "leaf": true
                        },
                        {
                            "text": "南岳区",
                            "id": "430412",
                            "lnglat": "11273162,2724747",
                            "leaf": true
                        },
                        {
                            "text": "衡阳县",
                            "id": "430421",
                            "lnglat": "11236805,2696989",
                            "leaf": true
                        },
                        {
                            "text": "衡南县",
                            "id": "430422",
                            "lnglat": "11258176,2691152",
                            "leaf": true
                        },
                        {
                            "text": "衡山县",
                            "id": "430423",
                            "lnglat": "11285606,2724054",
                            "leaf": true
                        },
                        {
                            "text": "衡东县",
                            "id": "430424",
                            "lnglat": "11294137,2708513",
                            "leaf": true
                        },
                        {
                            "text": "祁东县",
                            "id": "430426",
                            "lnglat": "11212440,2678506",
                            "leaf": true
                        },
                        {
                            "text": "耒阳市",
                            "id": "430481",
                            "lnglat": "11285138,2641103",
                            "leaf": true
                        },
                        {
                            "text": "常宁市",
                            "id": "430482",
                            "lnglat": "11238269,2641315",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "郴州市",
                    "id": "431000",
                    "lnglat": "11303127,2579673",
                    "children": [
                        {
                            "text": "北湖区",
                            "id": "431002",
                            "lnglat": "11302353,2579775",
                            "leaf": true
                        },
                        {
                            "text": "苏仙区",
                            "id": "431003",
                            "lnglat": "11303508,2580331",
                            "leaf": true
                        },
                        {
                            "text": "桂阳县",
                            "id": "431021",
                            "lnglat": "11272929,2573971",
                            "leaf": true
                        },
                        {
                            "text": "宜章县",
                            "id": "431022",
                            "lnglat": "11294899,2540541",
                            "leaf": true
                        },
                        {
                            "text": "永兴县",
                            "id": "431023",
                            "lnglat": "11310439,2613367",
                            "leaf": true
                        },
                        {
                            "text": "嘉禾县",
                            "id": "431024",
                            "lnglat": "11236536,2558503",
                            "leaf": true
                        },
                        {
                            "text": "临武县",
                            "id": "431025",
                            "lnglat": "11254705,2528209",
                            "leaf": true
                        },
                        {
                            "text": "汝城县",
                            "id": "431026",
                            "lnglat": "11368013,2555312",
                            "leaf": true
                        },
                        {
                            "text": "桂东县",
                            "id": "431027",
                            "lnglat": "11393986,2608106",
                            "leaf": true
                        },
                        {
                            "text": "安仁县",
                            "id": "431028",
                            "lnglat": "11326781,2670932",
                            "leaf": true
                        },
                        {
                            "text": "资兴市",
                            "id": "431081",
                            "lnglat": "11340096,2597316",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "常德市",
                    "id": "430700",
                    "lnglat": "11169352,2903453",
                    "children": [
                        {
                            "text": "武陵区",
                            "id": "430702",
                            "lnglat": "11169242,2903063",
                            "leaf": true
                        },
                        {
                            "text": "鼎城区",
                            "id": "430703",
                            "lnglat": "11167507,2902175",
                            "leaf": true
                        },
                        {
                            "text": "安乡县",
                            "id": "430721",
                            "lnglat": "11216386,2941317",
                            "leaf": true
                        },
                        {
                            "text": "汉寿县",
                            "id": "430722",
                            "lnglat": "11195773,2890912",
                            "leaf": true
                        },
                        {
                            "text": "澧县",
                            "id": "430723",
                            "lnglat": "11174956,2963845",
                            "leaf": true
                        },
                        {
                            "text": "临澧县",
                            "id": "430724",
                            "lnglat": "11164311,2944461",
                            "leaf": true
                        },
                        {
                            "text": "桃源县",
                            "id": "430725",
                            "lnglat": "11148275,2891056",
                            "leaf": true
                        },
                        {
                            "text": "石门县",
                            "id": "430726",
                            "lnglat": "11137510,2958912",
                            "leaf": true
                        },
                        {
                            "text": "津市市",
                            "id": "430781",
                            "lnglat": "11188104,2963046",
                            "leaf": true
                        }
                    ]
                }
            ]
        },
        {
            "text": "湖北省",
            "id": "420000",
            "lnglat": "11428742,3058965",
            "children": [
                {
                    "text": "武汉市",
                    "id": "420100",
                    "lnglat": "11428742,3058965",
                    "children": [
                        {
                            "text": "江岸区",
                            "id": "420102",
                            "lnglat": "11429363,3059001",
                            "leaf": true
                        },
                        {
                            "text": "江汉区",
                            "id": "420103",
                            "lnglat": "11428767,3057249",
                            "leaf": true
                        },
                        {
                            "text": "硚口区",
                            "id": "420104",
                            "lnglat": "11425885,3057183",
                            "leaf": true
                        },
                        {
                            "text": "汉阳区",
                            "id": "420105",
                            "lnglat": "11426939,3055162",
                            "leaf": true
                        },
                        {
                            "text": "武昌区",
                            "id": "420106",
                            "lnglat": "11431047,3055621",
                            "leaf": true
                        },
                        {
                            "text": "青山区",
                            "id": "420107",
                            "lnglat": "11439392,3064363",
                            "leaf": true
                        },
                        {
                            "text": "洪山区",
                            "id": "420111",
                            "lnglat": "11433811,3050229",
                            "leaf": true
                        },
                        {
                            "text": "东西湖区",
                            "id": "420112",
                            "lnglat": "11424477,3058855",
                            "leaf": true
                        },
                        {
                            "text": "汉南区",
                            "id": "420113",
                            "lnglat": "11396308,3042973",
                            "leaf": true
                        },
                        {
                            "text": "蔡甸区",
                            "id": "420114",
                            "lnglat": "11403710,3058346",
                            "leaf": true
                        },
                        {
                            "text": "江夏区",
                            "id": "420115",
                            "lnglat": "11431998,3026699",
                            "leaf": true
                        },
                        {
                            "text": "黄陂区",
                            "id": "420116",
                            "lnglat": "11436777,3087227",
                            "leaf": true
                        },
                        {
                            "text": "新洲区",
                            "id": "420117",
                            "lnglat": "11479731,3084769",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "宜昌市",
                    "id": "420500",
                    "lnglat": "11129069,3070277",
                    "children": [
                        {
                            "text": "西陵区",
                            "id": "420502",
                            "lnglat": "11127955,3071434",
                            "leaf": true
                        },
                        {
                            "text": "伍家岗区",
                            "id": "420503",
                            "lnglat": "11135511,3064672",
                            "leaf": true
                        },
                        {
                            "text": "点军区",
                            "id": "420504",
                            "lnglat": "11126238,3069564",
                            "leaf": true
                        },
                        {
                            "text": "猇亭区",
                            "id": "420505",
                            "lnglat": "11142488,3052587",
                            "leaf": true
                        },
                        {
                            "text": "夷陵区",
                            "id": "420506",
                            "lnglat": "11132043,3077114",
                            "leaf": true
                        },
                        {
                            "text": "远安县",
                            "id": "420525",
                            "lnglat": "11163155,3106222",
                            "leaf": true
                        },
                        {
                            "text": "兴山县",
                            "id": "420526",
                            "lnglat": "11075602,3123829",
                            "leaf": true
                        },
                        {
                            "text": "秭归县",
                            "id": "420527",
                            "lnglat": "11069050,3099943",
                            "leaf": true
                        },
                        {
                            "text": "长阳土家族自治县",
                            "id": "420528",
                            "lnglat": "11114192,3046119",
                            "leaf": true
                        },
                        {
                            "text": "五峰土家族自治县",
                            "id": "420529",
                            "lnglat": "11064596,3020013",
                            "leaf": true
                        },
                        {
                            "text": "宜都市",
                            "id": "420581",
                            "lnglat": "11147432,3039116",
                            "leaf": true
                        },
                        {
                            "text": "当阳市",
                            "id": "420582",
                            "lnglat": "11178672,3082767",
                            "leaf": true
                        },
                        {
                            "text": "枝江市",
                            "id": "420583",
                            "lnglat": "11175062,3043011",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "孝感市",
                    "id": "420900",
                    "lnglat": "11391136,3092749",
                    "children": [
                        {
                            "text": "孝南区",
                            "id": "420902",
                            "lnglat": "11400092,3091603",
                            "leaf": true
                        },
                        {
                            "text": "孝昌县",
                            "id": "420921",
                            "lnglat": "11393633,3123417",
                            "leaf": true
                        },
                        {
                            "text": "大悟县",
                            "id": "420922",
                            "lnglat": "11411883,3156419",
                            "leaf": true
                        },
                        {
                            "text": "云梦县",
                            "id": "420923",
                            "lnglat": "11373775,3102302",
                            "leaf": true
                        },
                        {
                            "text": "应城市",
                            "id": "420981",
                            "lnglat": "11356694,3095574",
                            "leaf": true
                        },
                        {
                            "text": "安陆市",
                            "id": "420982",
                            "lnglat": "11368181,3126268",
                            "leaf": true
                        },
                        {
                            "text": "汉川市",
                            "id": "420984",
                            "lnglat": "11382714,3064556",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "襄樊市",
                    "id": "420600",
                    "lnglat": "11214802,3202354",
                    "children": [
                        {
                            "text": "襄城区",
                            "id": "420602",
                            "lnglat": "11212781,3201241",
                            "leaf": true
                        },
                        {
                            "text": "樊城区",
                            "id": "420606",
                            "lnglat": "11212837,3204672",
                            "leaf": true
                        },
                        {
                            "text": "襄阳区",
                            "id": "420607",
                            "lnglat": "11214846,3204361",
                            "leaf": true
                        },
                        {
                            "text": "南漳县",
                            "id": "420624",
                            "lnglat": "11184384,3178345",
                            "leaf": true
                        },
                        {
                            "text": "谷城县",
                            "id": "420625",
                            "lnglat": "11164203,3226469",
                            "leaf": true
                        },
                        {
                            "text": "保康县",
                            "id": "420626",
                            "lnglat": "11127178,3188053",
                            "leaf": true
                        },
                        {
                            "text": "老河口市",
                            "id": "420682",
                            "lnglat": "11166719,3238502",
                            "leaf": true
                        },
                        {
                            "text": "枣阳市",
                            "id": "420683",
                            "lnglat": "11275371,3212788",
                            "leaf": true
                        },
                        {
                            "text": "宜城市",
                            "id": "420684",
                            "lnglat": "11225477,3170959",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "咸宁市",
                    "id": "421200",
                    "lnglat": "11426976,2988650",
                    "children": [
                        {
                            "text": "咸安区",
                            "id": "421202",
                            "lnglat": "11441326,2984589",
                            "leaf": true
                        },
                        {
                            "text": "嘉鱼县",
                            "id": "421221",
                            "lnglat": "11389986,2998049",
                            "leaf": true
                        },
                        {
                            "text": "通城县",
                            "id": "421222",
                            "lnglat": "11380430,2924768",
                            "leaf": true
                        },
                        {
                            "text": "崇阳县",
                            "id": "421223",
                            "lnglat": "11402684,2954079",
                            "leaf": true
                        },
                        {
                            "text": "通山县",
                            "id": "421224",
                            "lnglat": "11452195,2958973",
                            "leaf": true
                        },
                        {
                            "text": "赤壁市",
                            "id": "421281",
                            "lnglat": "11387924,2970753",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "随州市",
                    "id": "421300",
                    "lnglat": "11336015,3172151",
                    "children": [
                        {
                            "text": "曾都区",
                            "id": "421302",
                            "lnglat": "11324877,3188178",
                            "leaf": true
                        },
                        {
                            "text": "广水市",
                            "id": "421381",
                            "lnglat": "11380841,3161482",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "十堰市",
                    "id": "420300",
                    "lnglat": "11077559,3263073",
                    "children": [
                        {
                            "text": "茅箭区",
                            "id": "420302",
                            "lnglat": "11082633,3258755",
                            "leaf": true
                        },
                        {
                            "text": "张湾区",
                            "id": "420303",
                            "lnglat": "11077442,3265525",
                            "leaf": true
                        },
                        {
                            "text": "郧县",
                            "id": "420321",
                            "lnglat": "11080434,3283198",
                            "leaf": true
                        },
                        {
                            "text": "郧西县",
                            "id": "420322",
                            "lnglat": "11042352,3299181",
                            "leaf": true
                        },
                        {
                            "text": "竹山县",
                            "id": "420323",
                            "lnglat": "11024821,3222110",
                            "leaf": true
                        },
                        {
                            "text": "竹溪县",
                            "id": "420324",
                            "lnglat": "10970781,3233060",
                            "leaf": true
                        },
                        {
                            "text": "房县",
                            "id": "420325",
                            "lnglat": "11073858,3206043",
                            "leaf": true
                        },
                        {
                            "text": "丹江口市",
                            "id": "420381",
                            "lnglat": "11150314,3255346",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "荆州市",
                    "id": "421000",
                    "lnglat": "11228090,3032097",
                    "children": [
                        {
                            "text": "沙市区",
                            "id": "421002",
                            "lnglat": "11224967,3031376",
                            "leaf": true
                        },
                        {
                            "text": "荆州区",
                            "id": "421003",
                            "lnglat": "11218454,3035547",
                            "leaf": true
                        },
                        {
                            "text": "公安县",
                            "id": "421022",
                            "lnglat": "11222159,3006549",
                            "leaf": true
                        },
                        {
                            "text": "监利县",
                            "id": "421023",
                            "lnglat": "11289138,2982097",
                            "leaf": true
                        },
                        {
                            "text": "江陵县",
                            "id": "421024",
                            "lnglat": "11240449,3003514",
                            "leaf": true
                        },
                        {
                            "text": "石首市",
                            "id": "421081",
                            "lnglat": "11239736,2972746",
                            "leaf": true
                        },
                        {
                            "text": "洪湖市",
                            "id": "421083",
                            "lnglat": "11346156,2981282",
                            "leaf": true
                        },
                        {
                            "text": "松滋市",
                            "id": "421087",
                            "lnglat": "11177043,3018066",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "荆门市",
                    "id": "420800",
                    "lnglat": "11219408,3104024",
                    "children": [
                        {
                            "text": "东宝区",
                            "id": "420802",
                            "lnglat": "11219580,3105381",
                            "leaf": true
                        },
                        {
                            "text": "掇刀区",
                            "id": "420804",
                            "lnglat": "11220238,3097543",
                            "leaf": true
                        },
                        {
                            "text": "京山县",
                            "id": "420821",
                            "lnglat": "11309898,3102921",
                            "leaf": true
                        },
                        {
                            "text": "沙洋县",
                            "id": "420822",
                            "lnglat": "11258209,3069955",
                            "leaf": true
                        },
                        {
                            "text": "钟祥市",
                            "id": "420881",
                            "lnglat": "11258714,3116989",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "黄石市",
                    "id": "420200",
                    "lnglat": "11509070,3021830",
                    "children": [
                        {
                            "text": "黄石港区",
                            "id": "420202",
                            "lnglat": "11506071,3022526",
                            "leaf": true
                        },
                        {
                            "text": "西塞山区",
                            "id": "420203",
                            "lnglat": "11510477,3020728",
                            "leaf": true
                        },
                        {
                            "text": "下陆区",
                            "id": "420204",
                            "lnglat": "11495620,3017641",
                            "leaf": true
                        },
                        {
                            "text": "铁山区",
                            "id": "420205",
                            "lnglat": "11489115,3020762",
                            "leaf": true
                        },
                        {
                            "text": "阳新县",
                            "id": "420222",
                            "lnglat": "11520374,2983917",
                            "leaf": true
                        },
                        {
                            "text": "大冶市",
                            "id": "420281",
                            "lnglat": "11496661,3009286",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "黄冈市",
                    "id": "421100",
                    "lnglat": "11486834,3045047",
                    "children": [
                        {
                            "text": "黄州区",
                            "id": "421102",
                            "lnglat": "11496252,3052321",
                            "leaf": true
                        },
                        {
                            "text": "团风县",
                            "id": "421121",
                            "lnglat": "11486674,3063062",
                            "leaf": true
                        },
                        {
                            "text": "红安县",
                            "id": "421122",
                            "lnglat": "11461473,3129074",
                            "leaf": true
                        },
                        {
                            "text": "罗田县",
                            "id": "421123",
                            "lnglat": "11539459,3079023",
                            "leaf": true
                        },
                        {
                            "text": "英山县",
                            "id": "421124",
                            "lnglat": "11567433,3074138",
                            "leaf": true
                        },
                        {
                            "text": "浠水县",
                            "id": "421125",
                            "lnglat": "11526055,3046686",
                            "leaf": true
                        },
                        {
                            "text": "蕲春县",
                            "id": "421126",
                            "lnglat": "11539335,3024638",
                            "leaf": true
                        },
                        {
                            "text": "黄梅县",
                            "id": "421127",
                            "lnglat": "11593570,3007382",
                            "leaf": true
                        },
                        {
                            "text": "麻城市",
                            "id": "421181",
                            "lnglat": "11501598,3118212",
                            "leaf": true
                        },
                        {
                            "text": "武穴市",
                            "id": "421182",
                            "lnglat": "11555464,2985230",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "恩施土家族苗族自治州",
                    "id": "422800",
                    "lnglat": "10948157,3027527",
                    "children": [
                        {
                            "text": "恩施市",
                            "id": "422801",
                            "lnglat": "10953621,3025733",
                            "leaf": true
                        },
                        {
                            "text": "利川市",
                            "id": "422802",
                            "lnglat": "10893235,3029995",
                            "leaf": true
                        },
                        {
                            "text": "建始县",
                            "id": "422822",
                            "lnglat": "10972474,3060400",
                            "leaf": true
                        },
                        {
                            "text": "巴东县",
                            "id": "422823",
                            "lnglat": "11040488,3102383",
                            "leaf": true
                        },
                        {
                            "text": "宣恩县",
                            "id": "422825",
                            "lnglat": "10947911,2999492",
                            "leaf": true
                        },
                        {
                            "text": "咸丰县",
                            "id": "422826",
                            "lnglat": "10913951,2968283",
                            "leaf": true
                        },
                        {
                            "text": "来凤县",
                            "id": "422827",
                            "lnglat": "10940026,2951217",
                            "leaf": true
                        },
                        {
                            "text": "鹤峰县",
                            "id": "422828",
                            "lnglat": "11002885,2989576",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "鄂州市",
                    "id": "420700",
                    "lnglat": "11487261,3040375",
                    "children": [
                        {
                            "text": "梁子湖区",
                            "id": "420702",
                            "lnglat": "11467031,3007051",
                            "leaf": true
                        },
                        {
                            "text": "华容区",
                            "id": "420703",
                            "lnglat": "11472875,3053854",
                            "leaf": true
                        },
                        {
                            "text": "鄂城区",
                            "id": "420704",
                            "lnglat": "11488661,3040352",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "仙桃市",
                    "id": "429004",
                    "lnglat": "11345985,3037421",
                    "leaf": true
                },
                {
                    "text": "潜江市",
                    "id": "429005",
                    "lnglat": "11289449,3042576",
                    "leaf": true
                },
                {
                    "text": "天门市",
                    "id": "429006",
                    "lnglat": "11316019,3065305",
                    "leaf": true
                },
                {
                    "text": "神农架林区",
                    "id": "429021",
                    "lnglat": "11064906,3175975",
                    "leaf": true
                }
            ]
        },
        {
            "text": "河南省",
            "id": "410000",
            "lnglat": "11367769,3476714",
            "children": [
                {
                    "text": "郑州市",
                    "id": "410100",
                    "lnglat": "11367769,3476714",
                    "children": [
                        {
                            "text": "中原区",
                            "id": "410102",
                            "lnglat": "11360717,3474899",
                            "leaf": true
                        },
                        {
                            "text": "二七区",
                            "id": "410103",
                            "lnglat": "11363417,3472556",
                            "leaf": true
                        },
                        {
                            "text": "管城回族区",
                            "id": "410104",
                            "lnglat": "11367126,3475489",
                            "leaf": true
                        },
                        {
                            "text": "金水区",
                            "id": "410105",
                            "lnglat": "11365419,3480084",
                            "leaf": true
                        },
                        {
                            "text": "上街区",
                            "id": "410106",
                            "lnglat": "11328332,3480565",
                            "leaf": true
                        },
                        {
                            "text": "惠济区",
                            "id": "410108",
                            "lnglat": "11361083,3486839",
                            "leaf": true
                        },
                        {
                            "text": "中牟县",
                            "id": "410122",
                            "lnglat": "11401807,3472367",
                            "leaf": true
                        },
                        {
                            "text": "巩义市",
                            "id": "410181",
                            "lnglat": "11298322,3475705",
                            "leaf": true
                        },
                        {
                            "text": "荥阳市",
                            "id": "410182",
                            "lnglat": "11338185,3479011",
                            "leaf": true
                        },
                        {
                            "text": "新密市",
                            "id": "410183",
                            "lnglat": "11338312,3454110",
                            "leaf": true
                        },
                        {
                            "text": "新郑市",
                            "id": "410184",
                            "lnglat": "11373075,3439511",
                            "leaf": true
                        },
                        {
                            "text": "登封市",
                            "id": "410185",
                            "lnglat": "11302199,3446375",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "驻马店市",
                    "id": "411700",
                    "lnglat": "11403500,3297780",
                    "children": [
                        {
                            "text": "驿城区",
                            "id": "411702",
                            "lnglat": "11406435,3298575",
                            "leaf": true
                        },
                        {
                            "text": "西平县",
                            "id": "411721",
                            "lnglat": "11402040,3338757",
                            "leaf": true
                        },
                        {
                            "text": "上蔡县",
                            "id": "411722",
                            "lnglat": "11426349,3326675",
                            "leaf": true
                        },
                        {
                            "text": "平舆县",
                            "id": "411723",
                            "lnglat": "11462711,3295644",
                            "leaf": true
                        },
                        {
                            "text": "正阳县",
                            "id": "411724",
                            "lnglat": "11437405,3260570",
                            "leaf": true
                        },
                        {
                            "text": "确山县",
                            "id": "411725",
                            "lnglat": "11402506,3279843",
                            "leaf": true
                        },
                        {
                            "text": "泌阳县",
                            "id": "411726",
                            "lnglat": "11331320,3271692",
                            "leaf": true
                        },
                        {
                            "text": "汝南县",
                            "id": "411727",
                            "lnglat": "11435333,3300302",
                            "leaf": true
                        },
                        {
                            "text": "遂平县",
                            "id": "411728",
                            "lnglat": "11398328,3314994",
                            "leaf": true
                        },
                        {
                            "text": "新蔡县",
                            "id": "411729",
                            "lnglat": "11497176,3274257",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "周口市",
                    "id": "411600",
                    "lnglat": "11463617,3362657",
                    "children": [
                        {
                            "text": "川汇区",
                            "id": "411602",
                            "lnglat": "11464370,3363525",
                            "leaf": true
                        },
                        {
                            "text": "扶沟县",
                            "id": "411621",
                            "lnglat": "11439057,3405577",
                            "leaf": true
                        },
                        {
                            "text": "西华县",
                            "id": "411622",
                            "lnglat": "11452818,3380198",
                            "leaf": true
                        },
                        {
                            "text": "商水县",
                            "id": "411623",
                            "lnglat": "11460345,3354657",
                            "leaf": true
                        },
                        {
                            "text": "沈丘县",
                            "id": "411624",
                            "lnglat": "11506620,3339529",
                            "leaf": true
                        },
                        {
                            "text": "郸城县",
                            "id": "411625",
                            "lnglat": "11519892,3364549",
                            "leaf": true
                        },
                        {
                            "text": "淮阳县",
                            "id": "411626",
                            "lnglat": "11488863,3375299",
                            "leaf": true
                        },
                        {
                            "text": "太康县",
                            "id": "411627",
                            "lnglat": "11485670,3406034",
                            "leaf": true
                        },
                        {
                            "text": "鹿邑县",
                            "id": "411628",
                            "lnglat": "11547388,3385802",
                            "leaf": true
                        },
                        {
                            "text": "项城市",
                            "id": "411681",
                            "lnglat": "11490162,3344454",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "许昌市",
                    "id": "411000",
                    "lnglat": "11382251,3402552",
                    "children": [
                        {
                            "text": "魏都区",
                            "id": "411002",
                            "lnglat": "11381509,3404194",
                            "leaf": true
                        },
                        {
                            "text": "许昌县",
                            "id": "411023",
                            "lnglat": "11379851,3400882",
                            "leaf": true
                        },
                        {
                            "text": "鄢陵县",
                            "id": "411024",
                            "lnglat": "11419517,3410767",
                            "leaf": true
                        },
                        {
                            "text": "襄城县",
                            "id": "411025",
                            "lnglat": "11347809,3385696",
                            "leaf": true
                        },
                        {
                            "text": "禹州市",
                            "id": "411081",
                            "lnglat": "11347181,3416528",
                            "leaf": true
                        },
                        {
                            "text": "长葛市",
                            "id": "411082",
                            "lnglat": "11377755,3421262",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "信阳市",
                    "id": "411500",
                    "lnglat": "11406212,3212872",
                    "children": [
                        {
                            "text": "浉河区",
                            "id": "411502",
                            "lnglat": "11405273,3211909",
                            "leaf": true
                        },
                        {
                            "text": "平桥区",
                            "id": "411503",
                            "lnglat": "11412092,3211366",
                            "leaf": true
                        },
                        {
                            "text": "罗山县",
                            "id": "411521",
                            "lnglat": "11451820,3220248",
                            "leaf": true
                        },
                        {
                            "text": "光山县",
                            "id": "411522",
                            "lnglat": "11490089,3201185",
                            "leaf": true
                        },
                        {
                            "text": "新县",
                            "id": "411523",
                            "lnglat": "11486785,3162544",
                            "leaf": true
                        },
                        {
                            "text": "商城县",
                            "id": "411524",
                            "lnglat": "11540319,3179925",
                            "leaf": true
                        },
                        {
                            "text": "固始县",
                            "id": "411525",
                            "lnglat": "11567270,3218378",
                            "leaf": true
                        },
                        {
                            "text": "潢川县",
                            "id": "411526",
                            "lnglat": "11504476,3213664",
                            "leaf": true
                        },
                        {
                            "text": "淮滨县",
                            "id": "411527",
                            "lnglat": "11541332,3245572",
                            "leaf": true
                        },
                        {
                            "text": "息县",
                            "id": "411528",
                            "lnglat": "11473663,3234772",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "新乡市",
                    "id": "410700",
                    "lnglat": "11386393,3530560",
                    "children": [
                        {
                            "text": "红旗区",
                            "id": "410702",
                            "lnglat": "11386915,3530490",
                            "leaf": true
                        },
                        {
                            "text": "卫滨区",
                            "id": "410703",
                            "lnglat": "11385981,3530279",
                            "leaf": true
                        },
                        {
                            "text": "凤泉区",
                            "id": "410704",
                            "lnglat": "11393825,3538841",
                            "leaf": true
                        },
                        {
                            "text": "牧野区",
                            "id": "410711",
                            "lnglat": "11390267,3531547",
                            "leaf": true
                        },
                        {
                            "text": "新乡县",
                            "id": "410721",
                            "lnglat": "11387165,3529004",
                            "leaf": true
                        },
                        {
                            "text": "获嘉县",
                            "id": "410724",
                            "lnglat": "11363451,3527019",
                            "leaf": true
                        },
                        {
                            "text": "原阳县",
                            "id": "410725",
                            "lnglat": "11395569,3505526",
                            "leaf": true
                        },
                        {
                            "text": "延津县",
                            "id": "410726",
                            "lnglat": "11419916,3514430",
                            "leaf": true
                        },
                        {
                            "text": "封丘县",
                            "id": "410727",
                            "lnglat": "11442348,3503879",
                            "leaf": true
                        },
                        {
                            "text": "长垣县",
                            "id": "410728",
                            "lnglat": "11469857,3518963",
                            "leaf": true
                        },
                        {
                            "text": "卫辉市",
                            "id": "410781",
                            "lnglat": "11407363,3541557",
                            "leaf": true
                        },
                        {
                            "text": "辉县市",
                            "id": "410782",
                            "lnglat": "11380456,3546188",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "商丘市",
                    "id": "411400",
                    "lnglat": "11566306,3444623",
                    "children": [
                        {
                            "text": "梁园区",
                            "id": "411402",
                            "lnglat": "11563973,3444404",
                            "leaf": true
                        },
                        {
                            "text": "睢阳区",
                            "id": "411403",
                            "lnglat": "11562138,3438326",
                            "leaf": true
                        },
                        {
                            "text": "民权县",
                            "id": "411421",
                            "lnglat": "11514181,3465225",
                            "leaf": true
                        },
                        {
                            "text": "睢县",
                            "id": "411422",
                            "lnglat": "11506670,3442821",
                            "leaf": true
                        },
                        {
                            "text": "宁陵县",
                            "id": "411423",
                            "lnglat": "11532434,3445038",
                            "leaf": true
                        },
                        {
                            "text": "柘城县",
                            "id": "411424",
                            "lnglat": "11529955,3408060",
                            "leaf": true
                        },
                        {
                            "text": "虞城县",
                            "id": "411425",
                            "lnglat": "11586300,3439503",
                            "leaf": true
                        },
                        {
                            "text": "夏邑县",
                            "id": "411426",
                            "lnglat": "11610959,3424247",
                            "leaf": true
                        },
                        {
                            "text": "永城市",
                            "id": "411481",
                            "lnglat": "11636656,3393933",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "三门峡市",
                    "id": "411200",
                    "lnglat": "11119230,3477522",
                    "children": [
                        {
                            "text": "湖滨区",
                            "id": "411202",
                            "lnglat": "11126148,3474903",
                            "leaf": true
                        },
                        {
                            "text": "渑池县",
                            "id": "411221",
                            "lnglat": "11177390,3475623",
                            "leaf": true
                        },
                        {
                            "text": "陕县",
                            "id": "411222",
                            "lnglat": "11119691,3479387",
                            "leaf": true
                        },
                        {
                            "text": "卢氏县",
                            "id": "411224",
                            "lnglat": "11104035,3405600",
                            "leaf": true
                        },
                        {
                            "text": "义马市",
                            "id": "411281",
                            "lnglat": "11186594,3474659",
                            "leaf": true
                        },
                        {
                            "text": "灵宝市",
                            "id": "411282",
                            "lnglat": "11086697,3452318",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "濮阳市",
                    "id": "410900",
                    "lnglat": "11502106,3575972",
                    "children": [
                        {
                            "text": "华龙区",
                            "id": "410902",
                            "lnglat": "11504398,3576891",
                            "leaf": true
                        },
                        {
                            "text": "清丰县",
                            "id": "410922",
                            "lnglat": "11510735,3589344",
                            "leaf": true
                        },
                        {
                            "text": "南乐县",
                            "id": "410923",
                            "lnglat": "11519286,3607850",
                            "leaf": true
                        },
                        {
                            "text": "范县",
                            "id": "410926",
                            "lnglat": "11548155,3590532",
                            "leaf": true
                        },
                        {
                            "text": "台前县",
                            "id": "410927",
                            "lnglat": "11584631,3599767",
                            "leaf": true
                        },
                        {
                            "text": "濮阳县",
                            "id": "410928",
                            "lnglat": "11500950,3571484",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "平顶山市",
                    "id": "410400",
                    "lnglat": "11329903,3373186",
                    "children": [
                        {
                            "text": "新华区",
                            "id": "410402",
                            "lnglat": "11328707,3373851",
                            "leaf": true
                        },
                        {
                            "text": "卫东区",
                            "id": "410403",
                            "lnglat": "11332828,3373621",
                            "leaf": true
                        },
                        {
                            "text": "石龙区",
                            "id": "410404",
                            "lnglat": "11289269,3390020",
                            "leaf": true
                        },
                        {
                            "text": "湛河区",
                            "id": "410411",
                            "lnglat": "11328537,3373778",
                            "leaf": true
                        },
                        {
                            "text": "宝丰县",
                            "id": "410421",
                            "lnglat": "11306155,3387503",
                            "leaf": true
                        },
                        {
                            "text": "叶县",
                            "id": "410422",
                            "lnglat": "11335269,3362574",
                            "leaf": true
                        },
                        {
                            "text": "鲁山县",
                            "id": "410423",
                            "lnglat": "11289890,3374191",
                            "leaf": true
                        },
                        {
                            "text": "郏县",
                            "id": "410425",
                            "lnglat": "11320994,3397626",
                            "leaf": true
                        },
                        {
                            "text": "舞钢市",
                            "id": "410481",
                            "lnglat": "11351490,3329553",
                            "leaf": true
                        },
                        {
                            "text": "汝州市",
                            "id": "410482",
                            "lnglat": "11283804,3415730",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "南阳市",
                    "id": "411300",
                    "lnglat": "11252067,3299503",
                    "children": [
                        {
                            "text": "宛城区",
                            "id": "411302",
                            "lnglat": "11253426,3300568",
                            "leaf": true
                        },
                        {
                            "text": "卧龙区",
                            "id": "411303",
                            "lnglat": "11252870,3298798",
                            "leaf": true
                        },
                        {
                            "text": "南召县",
                            "id": "411321",
                            "lnglat": "11241646,3348966",
                            "leaf": true
                        },
                        {
                            "text": "方城县",
                            "id": "411322",
                            "lnglat": "11298986,3326025",
                            "leaf": true
                        },
                        {
                            "text": "西峡县",
                            "id": "411323",
                            "lnglat": "11147471,3330196",
                            "leaf": true
                        },
                        {
                            "text": "镇平县",
                            "id": "411324",
                            "lnglat": "11221725,3303259",
                            "leaf": true
                        },
                        {
                            "text": "内乡县",
                            "id": "411325",
                            "lnglat": "11183477,3305618",
                            "leaf": true
                        },
                        {
                            "text": "淅川县",
                            "id": "411326",
                            "lnglat": "11148657,3314145",
                            "leaf": true
                        },
                        {
                            "text": "社旗县",
                            "id": "411327",
                            "lnglat": "11293441,3305874",
                            "leaf": true
                        },
                        {
                            "text": "唐河县",
                            "id": "411328",
                            "lnglat": "11282252,3269046",
                            "leaf": true
                        },
                        {
                            "text": "新野县",
                            "id": "411329",
                            "lnglat": "11236042,3252669",
                            "leaf": true
                        },
                        {
                            "text": "桐柏县",
                            "id": "411330",
                            "lnglat": "11339885,3236491",
                            "leaf": true
                        },
                        {
                            "text": "邓州市",
                            "id": "411381",
                            "lnglat": "11209002,3269008",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "漯河市",
                    "id": "411100",
                    "lnglat": "11401117,3358199",
                    "children": [
                        {
                            "text": "源汇区",
                            "id": "411102",
                            "lnglat": "11404644,3356184",
                            "leaf": true
                        },
                        {
                            "text": "郾城区",
                            "id": "411103",
                            "lnglat": "11399147,3359217",
                            "leaf": true
                        },
                        {
                            "text": "召陵区",
                            "id": "411104",
                            "lnglat": "11408631,3357157",
                            "leaf": true
                        },
                        {
                            "text": "舞阳县",
                            "id": "411121",
                            "lnglat": "11359002,3344017",
                            "leaf": true
                        },
                        {
                            "text": "临颍县",
                            "id": "411122",
                            "lnglat": "11395304,3381532",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "洛阳市",
                    "id": "410300",
                    "lnglat": "11244435,3467194",
                    "children": [
                        {
                            "text": "老城区",
                            "id": "410302",
                            "lnglat": "11246379,3468468",
                            "leaf": true
                        },
                        {
                            "text": "西工区",
                            "id": "410303",
                            "lnglat": "11243131,3467041",
                            "leaf": true
                        },
                        {
                            "text": "廛河回族区",
                            "id": "410304",
                            "lnglat": "11248689,3468645",
                            "leaf": true
                        },
                        {
                            "text": "涧西区",
                            "id": "410305",
                            "lnglat": "11238979,3465868",
                            "leaf": true
                        },
                        {
                            "text": "吉利区",
                            "id": "410306",
                            "lnglat": "11259580,3491398",
                            "leaf": true
                        },
                        {
                            "text": "洛龙区",
                            "id": "410307",
                            "lnglat": "11245782,3461991",
                            "leaf": true
                        },
                        {
                            "text": "孟津县",
                            "id": "410322",
                            "lnglat": "11243163,3482979",
                            "leaf": true
                        },
                        {
                            "text": "新安县",
                            "id": "410323",
                            "lnglat": "11213977,3472180",
                            "leaf": true
                        },
                        {
                            "text": "栾川县",
                            "id": "410324",
                            "lnglat": "11161257,3378837",
                            "leaf": true
                        },
                        {
                            "text": "嵩县",
                            "id": "410325",
                            "lnglat": "11208766,3414073",
                            "leaf": true
                        },
                        {
                            "text": "汝阳县",
                            "id": "410326",
                            "lnglat": "11245513,3415233",
                            "leaf": true
                        },
                        {
                            "text": "宜阳县",
                            "id": "410327",
                            "lnglat": "11218498,3451069",
                            "leaf": true
                        },
                        {
                            "text": "洛宁县",
                            "id": "410328",
                            "lnglat": "11165545,3438940",
                            "leaf": true
                        },
                        {
                            "text": "伊川县",
                            "id": "410329",
                            "lnglat": "11242448,3442624",
                            "leaf": true
                        },
                        {
                            "text": "偃师市",
                            "id": "410381",
                            "lnglat": "11277512,3472677",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "开封市",
                    "id": "410200",
                    "lnglat": "11430335,3479855",
                    "children": [
                        {
                            "text": "龙亭区",
                            "id": "410202",
                            "lnglat": "11434916,3480081",
                            "leaf": true
                        },
                        {
                            "text": "顺河回族区",
                            "id": "410203",
                            "lnglat": "11435497,3479688",
                            "leaf": true
                        },
                        {
                            "text": "鼓楼区",
                            "id": "410204",
                            "lnglat": "11434939,3479611",
                            "leaf": true
                        },
                        {
                            "text": "禹王台区",
                            "id": "410205",
                            "lnglat": "11434235,3477754",
                            "leaf": true
                        },
                        {
                            "text": "金明区",
                            "id": "410211",
                            "lnglat": "11436658,3479327",
                            "leaf": true
                        },
                        {
                            "text": "杞县",
                            "id": "410221",
                            "lnglat": "11477854,3454947",
                            "leaf": true
                        },
                        {
                            "text": "通许县",
                            "id": "410222",
                            "lnglat": "11446112,3447613",
                            "leaf": true
                        },
                        {
                            "text": "尉氏县",
                            "id": "410223",
                            "lnglat": "11418970,3441105",
                            "leaf": true
                        },
                        {
                            "text": "开封县",
                            "id": "410224",
                            "lnglat": "11443266,3476066",
                            "leaf": true
                        },
                        {
                            "text": "兰考县",
                            "id": "410225",
                            "lnglat": "11481907,3482246",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "焦作市",
                    "id": "410800",
                    "lnglat": "11323372,3524328",
                    "children": [
                        {
                            "text": "解放区",
                            "id": "410802",
                            "lnglat": "11322254,3524055",
                            "leaf": true
                        },
                        {
                            "text": "中站区",
                            "id": "410803",
                            "lnglat": "11320910,3524393",
                            "leaf": true
                        },
                        {
                            "text": "马村区",
                            "id": "410804",
                            "lnglat": "11331376,3527059",
                            "leaf": true
                        },
                        {
                            "text": "山阳区",
                            "id": "410811",
                            "lnglat": "11324918,3521513",
                            "leaf": true
                        },
                        {
                            "text": "修武县",
                            "id": "410821",
                            "lnglat": "11344662,3523119",
                            "leaf": true
                        },
                        {
                            "text": "博爱县",
                            "id": "410822",
                            "lnglat": "11305065,3516747",
                            "leaf": true
                        },
                        {
                            "text": "武陟县",
                            "id": "410823",
                            "lnglat": "11339223,3510159",
                            "leaf": true
                        },
                        {
                            "text": "温县",
                            "id": "410825",
                            "lnglat": "11308122,3493763",
                            "leaf": true
                        },
                        {
                            "text": "济源市",
                            "id": "410881",
                            "lnglat": "11239543,3508778",
                            "leaf": true
                        },
                        {
                            "text": "沁阳市",
                            "id": "410882",
                            "lnglat": "11292598,3509246",
                            "leaf": true
                        },
                        {
                            "text": "孟州市",
                            "id": "410883",
                            "lnglat": "11278789,3490249",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "鹤壁市",
                    "id": "410600",
                    "lnglat": "11417749,3589807",
                    "children": [
                        {
                            "text": "鹤山区",
                            "id": "410602",
                            "lnglat": "11415702,3595454",
                            "leaf": true
                        },
                        {
                            "text": "山城区",
                            "id": "410603",
                            "lnglat": "11417857,3589761",
                            "leaf": true
                        },
                        {
                            "text": "淇滨区",
                            "id": "410611",
                            "lnglat": "11429287,3574134",
                            "leaf": true
                        },
                        {
                            "text": "浚县",
                            "id": "410621",
                            "lnglat": "11454282,3566306",
                            "leaf": true
                        },
                        {
                            "text": "淇县",
                            "id": "410622",
                            "lnglat": "11419598,3559794",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "安阳市",
                    "id": "410500",
                    "lnglat": "11435347,3609605",
                    "children": [
                        {
                            "text": "文峰区",
                            "id": "410502",
                            "lnglat": "11435082,3609002",
                            "leaf": true
                        },
                        {
                            "text": "北关区",
                            "id": "410503",
                            "lnglat": "11435130,3611795",
                            "leaf": true
                        },
                        {
                            "text": "殷都区",
                            "id": "410505",
                            "lnglat": "11429785,3611006",
                            "leaf": true
                        },
                        {
                            "text": "龙安区",
                            "id": "410506",
                            "lnglat": "11434242,3611906",
                            "leaf": true
                        },
                        {
                            "text": "安阳县",
                            "id": "410522",
                            "lnglat": "11436437,3612391",
                            "leaf": true
                        },
                        {
                            "text": "汤阴县",
                            "id": "410523",
                            "lnglat": "11435434,3591802",
                            "leaf": true
                        },
                        {
                            "text": "滑县",
                            "id": "410526",
                            "lnglat": "11450139,3558615",
                            "leaf": true
                        },
                        {
                            "text": "内黄县",
                            "id": "410527",
                            "lnglat": "11490098,3595634",
                            "leaf": true
                        },
                        {
                            "text": "林州市",
                            "id": "410581",
                            "lnglat": "11381255,3606670",
                            "leaf": true
                        }
                    ]
                }
            ]
        },
        {
            "text": "辽宁省",
            "id": "210000",
            "lnglat": "12338035,4181073",
            "children": [
                {
                    "text": "沈阳市",
                    "id": "210100",
                    "lnglat": "12338035,4181073",
                    "children": [
                        {
                            "text": "和平区",
                            "id": "210102",
                            "lnglat": "11717699,3912381",
                            "leaf": true
                        },
                        {
                            "text": "沈河区",
                            "id": "210103",
                            "lnglat": "12345313,4179348",
                            "leaf": true
                        },
                        {
                            "text": "大东区",
                            "id": "210104",
                            "lnglat": "12346415,4180279",
                            "leaf": true
                        },
                        {
                            "text": "皇姑区",
                            "id": "210105",
                            "lnglat": "12341920,4181778",
                            "leaf": true
                        },
                        {
                            "text": "铁西区",
                            "id": "210106",
                            "lnglat": "12337086,4180013",
                            "leaf": true
                        },
                        {
                            "text": "苏家屯区",
                            "id": "210111",
                            "lnglat": "12332558,4165489",
                            "leaf": true
                        },
                        {
                            "text": "东陵区",
                            "id": "210112",
                            "lnglat": "12358783,4181128",
                            "leaf": true
                        },
                        {
                            "text": "沈北新区",
                            "id": "210113",
                            "lnglat": "12351362,4205133",
                            "leaf": true
                        },
                        {
                            "text": "于洪区",
                            "id": "210114",
                            "lnglat": "12330118,4180342",
                            "leaf": true
                        },
                        {
                            "text": "辽中县",
                            "id": "210122",
                            "lnglat": "12272332,4151282",
                            "leaf": true
                        },
                        {
                            "text": "康平县",
                            "id": "210123",
                            "lnglat": "12334531,4275167",
                            "leaf": true
                        },
                        {
                            "text": "法库县",
                            "id": "210124",
                            "lnglat": "12341397,4250470",
                            "leaf": true
                        },
                        {
                            "text": "新民市",
                            "id": "210181",
                            "lnglat": "12282283,4199204",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "大连市",
                    "id": "210200",
                    "lnglat": "12162329,3892425",
                    "children": [
                        {
                            "text": "中山区",
                            "id": "210202",
                            "lnglat": "12164021,3891719",
                            "leaf": true
                        },
                        {
                            "text": "西岗区",
                            "id": "210203",
                            "lnglat": "12160706,3891363",
                            "leaf": true
                        },
                        {
                            "text": "沙河口区",
                            "id": "210204",
                            "lnglat": "12158924,3890411",
                            "leaf": true
                        },
                        {
                            "text": "甘井子区",
                            "id": "210211",
                            "lnglat": "12156031,3894925",
                            "leaf": true
                        },
                        {
                            "text": "旅顺口区",
                            "id": "210212",
                            "lnglat": "12125282,3881845",
                            "leaf": true
                        },
                        {
                            "text": "金州区",
                            "id": "210213",
                            "lnglat": "12170911,3910664",
                            "leaf": true
                        },
                        {
                            "text": "长海县",
                            "id": "210224",
                            "lnglat": "12257638,3927313",
                            "leaf": true
                        },
                        {
                            "text": "瓦房店市",
                            "id": "210281",
                            "lnglat": "12199788,3961920",
                            "leaf": true
                        },
                        {
                            "text": "普兰店市",
                            "id": "210282",
                            "lnglat": "12196061,3939900",
                            "leaf": true
                        },
                        {
                            "text": "庄河市",
                            "id": "210283",
                            "lnglat": "12296962,3969968",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "营口市",
                    "id": "210800",
                    "lnglat": "12223395,4067802",
                    "children": [
                        {
                            "text": "站前区",
                            "id": "210802",
                            "lnglat": "12225592,4068149",
                            "leaf": true
                        },
                        {
                            "text": "西市区",
                            "id": "210803",
                            "lnglat": "12220672,4066058",
                            "leaf": true
                        },
                        {
                            "text": "鲅鱼圈区",
                            "id": "210804",
                            "lnglat": "12211606,4030400",
                            "leaf": true
                        },
                        {
                            "text": "老边区",
                            "id": "210811",
                            "lnglat": "12237866,4067254",
                            "leaf": true
                        },
                        {
                            "text": "盖州市",
                            "id": "210881",
                            "lnglat": "12235947,4039796",
                            "leaf": true
                        },
                        {
                            "text": "大石桥市",
                            "id": "210882",
                            "lnglat": "12248058,4063511",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "铁岭市",
                    "id": "211200",
                    "lnglat": "12384595,4229571",
                    "children": [
                        {
                            "text": "银州区",
                            "id": "211202",
                            "lnglat": "12385165,4229309",
                            "leaf": true
                        },
                        {
                            "text": "清河区",
                            "id": "211204",
                            "lnglat": "12415455,4254408",
                            "leaf": true
                        },
                        {
                            "text": "铁岭县",
                            "id": "211221",
                            "lnglat": "12393377,4228105",
                            "leaf": true
                        },
                        {
                            "text": "西丰县",
                            "id": "211223",
                            "lnglat": "12471215,4274005",
                            "leaf": true
                        },
                        {
                            "text": "昌图县",
                            "id": "211224",
                            "lnglat": "12412719,4277748",
                            "leaf": true
                        },
                        {
                            "text": "调兵山市",
                            "id": "211281",
                            "lnglat": "12354409,4246825",
                            "leaf": true
                        },
                        {
                            "text": "开原市",
                            "id": "211282",
                            "lnglat": "12403810,4253670",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "盘锦市",
                    "id": "211100",
                    "lnglat": "12204954,4119227",
                    "children": [
                        {
                            "text": "双台子区",
                            "id": "211102",
                            "lnglat": "12204757,4119700",
                            "leaf": true
                        },
                        {
                            "text": "兴隆台区",
                            "id": "211103",
                            "lnglat": "12206982,4112277",
                            "leaf": true
                        },
                        {
                            "text": "大洼县",
                            "id": "211121",
                            "lnglat": "12206125,4099113",
                            "leaf": true
                        },
                        {
                            "text": "盘山县",
                            "id": "211122",
                            "lnglat": "12204739,4119938",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "辽阳市",
                    "id": "211000",
                    "lnglat": "12316629,4126683",
                    "children": [
                        {
                            "text": "白塔区",
                            "id": "211002",
                            "lnglat": "12316839,4126811",
                            "leaf": true
                        },
                        {
                            "text": "文圣区",
                            "id": "211003",
                            "lnglat": "12317940,4126055",
                            "leaf": true
                        },
                        {
                            "text": "宏伟区",
                            "id": "211004",
                            "lnglat": "12321642,4120585",
                            "leaf": true
                        },
                        {
                            "text": "弓长岭区",
                            "id": "211005",
                            "lnglat": "12345559,4113189",
                            "leaf": true
                        },
                        {
                            "text": "太子河区",
                            "id": "211011",
                            "lnglat": "12317606,4125153",
                            "leaf": true
                        },
                        {
                            "text": "辽阳县",
                            "id": "211021",
                            "lnglat": "12307937,4121928",
                            "leaf": true
                        },
                        {
                            "text": "灯塔市",
                            "id": "211081",
                            "lnglat": "12331554,4142284",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "锦州市",
                    "id": "210700",
                    "lnglat": "12112818,4112001",
                    "children": [
                        {
                            "text": "古塔区",
                            "id": "210702",
                            "lnglat": "12112254,4111462",
                            "leaf": true
                        },
                        {
                            "text": "凌河区",
                            "id": "210703",
                            "lnglat": "12114552,4111295",
                            "leaf": true
                        },
                        {
                            "text": "太和区",
                            "id": "210711",
                            "lnglat": "12109788,4110744",
                            "leaf": true
                        },
                        {
                            "text": "黑山县",
                            "id": "210726",
                            "lnglat": "12210101,4169274",
                            "leaf": true
                        },
                        {
                            "text": "义县",
                            "id": "210727",
                            "lnglat": "12124107,4154134",
                            "leaf": true
                        },
                        {
                            "text": "凌海市",
                            "id": "210781",
                            "lnglat": "12135494,4117137",
                            "leaf": true
                        },
                        {
                            "text": "北镇市",
                            "id": "210782",
                            "lnglat": "12177990,4159655",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "葫芦岛市",
                    "id": "211400",
                    "lnglat": "12085199,4075609",
                    "children": [
                        {
                            "text": "连山区",
                            "id": "211402",
                            "lnglat": "12085855,4075374",
                            "leaf": true
                        },
                        {
                            "text": "龙港区",
                            "id": "211403",
                            "lnglat": "12094394,4071748",
                            "leaf": true
                        },
                        {
                            "text": "南票区",
                            "id": "211404",
                            "lnglat": "12074842,4110123",
                            "leaf": true
                        },
                        {
                            "text": "绥中县",
                            "id": "211421",
                            "lnglat": "12032600,4033594",
                            "leaf": true
                        },
                        {
                            "text": "建昌县",
                            "id": "211422",
                            "lnglat": "11979201,4081483",
                            "leaf": true
                        },
                        {
                            "text": "兴城市",
                            "id": "211481",
                            "lnglat": "12070344,4061923",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "阜新市",
                    "id": "210900",
                    "lnglat": "12164960,4201213",
                    "children": [
                        {
                            "text": "海州区",
                            "id": "210902",
                            "lnglat": "12165057,4201106",
                            "leaf": true
                        },
                        {
                            "text": "新邱区",
                            "id": "210903",
                            "lnglat": "12179976,4209515",
                            "leaf": true
                        },
                        {
                            "text": "太平区",
                            "id": "210904",
                            "lnglat": "12668916,4577380",
                            "leaf": true
                        },
                        {
                            "text": "清河门区",
                            "id": "210905",
                            "lnglat": "12141354,4175395",
                            "leaf": true
                        },
                        {
                            "text": "细河区",
                            "id": "210911",
                            "lnglat": "12166991,4202242",
                            "leaf": true
                        },
                        {
                            "text": "阜新蒙古族自治县",
                            "id": "210921",
                            "lnglat": "12172070,4215764",
                            "leaf": true
                        },
                        {
                            "text": "彰武县",
                            "id": "210922",
                            "lnglat": "12253390,4238559",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "抚顺市",
                    "id": "210400",
                    "lnglat": "12390556,4187913",
                    "children": [
                        {
                            "text": "新抚区",
                            "id": "210402",
                            "lnglat": "12390717,4185993",
                            "leaf": true
                        },
                        {
                            "text": "东洲区",
                            "id": "210403",
                            "lnglat": "12403303,4185064",
                            "leaf": true
                        },
                        {
                            "text": "望花区",
                            "id": "210404",
                            "lnglat": "12377437,4184558",
                            "leaf": true
                        },
                        {
                            "text": "顺城区",
                            "id": "210411",
                            "lnglat": "12393914,4188109",
                            "leaf": true
                        },
                        {
                            "text": "抚顺县",
                            "id": "210421",
                            "lnglat": "12402625,4183060",
                            "leaf": true
                        },
                        {
                            "text": "新宾满族自治县",
                            "id": "210422",
                            "lnglat": "12503498,4172961",
                            "leaf": true
                        },
                        {
                            "text": "清原满族自治县",
                            "id": "210423",
                            "lnglat": "12491971,4210391",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "丹东市",
                    "id": "210600",
                    "lnglat": "12437858,4012404",
                    "children": [
                        {
                            "text": "元宝区",
                            "id": "210602",
                            "lnglat": "12438967,4013539",
                            "leaf": true
                        },
                        {
                            "text": "振兴区",
                            "id": "210603",
                            "lnglat": "12435457,4010359",
                            "leaf": true
                        },
                        {
                            "text": "振安区",
                            "id": "210604",
                            "lnglat": "12442200,4015664",
                            "leaf": true
                        },
                        {
                            "text": "宽甸满族自治县",
                            "id": "210624",
                            "lnglat": "12477946,4072718",
                            "leaf": true
                        },
                        {
                            "text": "东港市",
                            "id": "210681",
                            "lnglat": "12414262,3987539",
                            "leaf": true
                        },
                        {
                            "text": "凤城市",
                            "id": "210682",
                            "lnglat": "12406611,4046010",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "朝阳市",
                    "id": "211300",
                    "lnglat": "12044236,4157195",
                    "children": [
                        {
                            "text": "双塔区",
                            "id": "211302",
                            "lnglat": "12044776,4156348",
                            "leaf": true
                        },
                        {
                            "text": "龙城区",
                            "id": "211303",
                            "lnglat": "12043172,4159060",
                            "leaf": true
                        },
                        {
                            "text": "朝阳县",
                            "id": "211321",
                            "lnglat": "12047894,4157632",
                            "leaf": true
                        },
                        {
                            "text": "建平县",
                            "id": "211322",
                            "lnglat": "11963579,4140148",
                            "leaf": true
                        },
                        {
                            "text": "喀喇沁左翼蒙古族自治县",
                            "id": "211324",
                            "lnglat": "11975734,4116828",
                            "leaf": true
                        },
                        {
                            "text": "北票市",
                            "id": "211381",
                            "lnglat": "12076239,4181104",
                            "leaf": true
                        },
                        {
                            "text": "凌源市",
                            "id": "211382",
                            "lnglat": "11939724,4124253",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "本溪市",
                    "id": "210500",
                    "lnglat": "12376104,4129104",
                    "children": [
                        {
                            "text": "平山区",
                            "id": "210502",
                            "lnglat": "12375663,4129946",
                            "leaf": true
                        },
                        {
                            "text": "溪湖区",
                            "id": "210503",
                            "lnglat": "12376231,4132700",
                            "leaf": true
                        },
                        {
                            "text": "明山区",
                            "id": "210504",
                            "lnglat": "12380924,4130475",
                            "leaf": true
                        },
                        {
                            "text": "南芬区",
                            "id": "210505",
                            "lnglat": "12374530,4109916",
                            "leaf": true
                        },
                        {
                            "text": "本溪满族自治县",
                            "id": "210521",
                            "lnglat": "12412300,4130109",
                            "leaf": true
                        },
                        {
                            "text": "桓仁满族自治县",
                            "id": "210522",
                            "lnglat": "12534961,4126975",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "鞍山市",
                    "id": "210300",
                    "lnglat": "12299014,4110736",
                    "children": [
                        {
                            "text": "铁东区",
                            "id": "210302",
                            "lnglat": "12298344,4110246",
                            "leaf": true
                        },
                        {
                            "text": "铁西区",
                            "id": "210303",
                            "lnglat": "12296414,4111807",
                            "leaf": true
                        },
                        {
                            "text": "立山区",
                            "id": "210304",
                            "lnglat": "12302369,4114797",
                            "leaf": true
                        },
                        {
                            "text": "千山区",
                            "id": "210311",
                            "lnglat": "12295545,4107298",
                            "leaf": true
                        },
                        {
                            "text": "台安县",
                            "id": "210321",
                            "lnglat": "12242511,4138152",
                            "leaf": true
                        },
                        {
                            "text": "岫岩满族自治县",
                            "id": "210323",
                            "lnglat": "12328770,4027296",
                            "leaf": true
                        },
                        {
                            "text": "海城市",
                            "id": "210381",
                            "lnglat": "12274253,4085123",
                            "leaf": true
                        }
                    ]
                }
            ]
        },
        {
            "text": "吉林省",
            "id": "220000",
            "lnglat": "12532512,4389290",
            "children": [
                {
                    "text": "长春市",
                    "id": "220100",
                    "lnglat": "12532512,4389290",
                    "children": [
                        {
                            "text": "南关区",
                            "id": "220102",
                            "lnglat": "12534200,4387724",
                            "leaf": true
                        },
                        {
                            "text": "宽城区",
                            "id": "220103",
                            "lnglat": "12532234,4389783",
                            "leaf": true
                        },
                        {
                            "text": "朝阳区",
                            "id": "220104",
                            "lnglat": "12529719,4386483",
                            "leaf": true
                        },
                        {
                            "text": "二道区",
                            "id": "220105",
                            "lnglat": "12536682,4388129",
                            "leaf": true
                        },
                        {
                            "text": "绿园区",
                            "id": "220106",
                            "lnglat": "12525792,4389665",
                            "leaf": true
                        },
                        {
                            "text": "双阳区",
                            "id": "220112",
                            "lnglat": "12566499,4352231",
                            "leaf": true
                        },
                        {
                            "text": "农安县",
                            "id": "220122",
                            "lnglat": "12517325,4442977",
                            "leaf": true
                        },
                        {
                            "text": "九台市",
                            "id": "220181",
                            "lnglat": "12583799,4415521",
                            "leaf": true
                        },
                        {
                            "text": "榆树市",
                            "id": "220182",
                            "lnglat": "12654472,4481714",
                            "leaf": true
                        },
                        {
                            "text": "德惠市",
                            "id": "220183",
                            "lnglat": "12570616,4453344",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "吉林市",
                    "id": "220200",
                    "lnglat": "12656460,4385569",
                    "children": [
                        {
                            "text": "昌邑区",
                            "id": "220202",
                            "lnglat": "12656937,4388125",
                            "leaf": true
                        },
                        {
                            "text": "龙潭区",
                            "id": "220203",
                            "lnglat": "12657388,4390454",
                            "leaf": true
                        },
                        {
                            "text": "船营区",
                            "id": "220204",
                            "lnglat": "12652886,4383275",
                            "leaf": true
                        },
                        {
                            "text": "丰满区",
                            "id": "220211",
                            "lnglat": "12655217,4382361",
                            "leaf": true
                        },
                        {
                            "text": "永吉县",
                            "id": "220221",
                            "lnglat": "12649355,4366162",
                            "leaf": true
                        },
                        {
                            "text": "蛟河市",
                            "id": "220281",
                            "lnglat": "12733701,4372321",
                            "leaf": true
                        },
                        {
                            "text": "桦甸市",
                            "id": "220282",
                            "lnglat": "12673551,4296522",
                            "leaf": true
                        },
                        {
                            "text": "舒兰市",
                            "id": "220283",
                            "lnglat": "12694228,4440624",
                            "leaf": true
                        },
                        {
                            "text": "磐石市",
                            "id": "220284",
                            "lnglat": "12605585,4293968",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "延边朝鲜族自治州",
                    "id": "222400",
                    "lnglat": "12942181,4318806",
                    "children": [
                        {
                            "text": "延吉市",
                            "id": "222401",
                            "lnglat": "12952418,4290600",
                            "leaf": true
                        },
                        {
                            "text": "图们市",
                            "id": "222402",
                            "lnglat": "12983836,4296399",
                            "leaf": true
                        },
                        {
                            "text": "敦化市",
                            "id": "222403",
                            "lnglat": "12822636,4336457",
                            "leaf": true
                        },
                        {
                            "text": "珲春市",
                            "id": "222404",
                            "lnglat": "13035577,4287071",
                            "leaf": true
                        },
                        {
                            "text": "龙井市",
                            "id": "222405",
                            "lnglat": "12941698,4276686",
                            "leaf": true
                        },
                        {
                            "text": "和龙市",
                            "id": "222406",
                            "lnglat": "12899939,4253966",
                            "leaf": true
                        },
                        {
                            "text": "汪清县",
                            "id": "222424",
                            "lnglat": "12976241,4331258",
                            "leaf": true
                        },
                        {
                            "text": "安图县",
                            "id": "222426",
                            "lnglat": "12891214,4310764",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "通化市",
                    "id": "220500",
                    "lnglat": "12593401,4172584",
                    "children": [
                        {
                            "text": "东昌区",
                            "id": "220502",
                            "lnglat": "12593453,4172582",
                            "leaf": true
                        },
                        {
                            "text": "二道江区",
                            "id": "220503",
                            "lnglat": "12603802,4177905",
                            "leaf": true
                        },
                        {
                            "text": "通化县",
                            "id": "220521",
                            "lnglat": "12574308,4167651",
                            "leaf": true
                        },
                        {
                            "text": "辉南县",
                            "id": "220523",
                            "lnglat": "12603331,4268253",
                            "leaf": true
                        },
                        {
                            "text": "柳河县",
                            "id": "220524",
                            "lnglat": "12572810,4227641",
                            "leaf": true
                        },
                        {
                            "text": "梅河口市",
                            "id": "220581",
                            "lnglat": "12567500,4253341",
                            "leaf": true
                        },
                        {
                            "text": "集安市",
                            "id": "220582",
                            "lnglat": "12618570,4112415",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "松原市",
                    "id": "220700",
                    "lnglat": "12481485,4512118",
                    "children": [
                        {
                            "text": "宁江区",
                            "id": "220702",
                            "lnglat": "12481667,4516820",
                            "leaf": true
                        },
                        {
                            "text": "前郭尔罗斯蒙古族自治县",
                            "id": "220721",
                            "lnglat": "12446528,4487859",
                            "leaf": true
                        },
                        {
                            "text": "长岭县",
                            "id": "220722",
                            "lnglat": "12397997,4427301",
                            "leaf": true
                        },
                        {
                            "text": "乾安县",
                            "id": "220723",
                            "lnglat": "12401929,4500539",
                            "leaf": true
                        },
                        {
                            "text": "扶余县",
                            "id": "220724",
                            "lnglat": "12602048,4498405",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "四平市",
                    "id": "220300",
                    "lnglat": "12435953,4316796",
                    "children": [
                        {
                            "text": "铁西区",
                            "id": "220302",
                            "lnglat": "12435446,4316989",
                            "leaf": true
                        },
                        {
                            "text": "铁东区",
                            "id": "220303",
                            "lnglat": "12438804,4315879",
                            "leaf": true
                        },
                        {
                            "text": "梨树县",
                            "id": "220322",
                            "lnglat": "12432886,4330848",
                            "leaf": true
                        },
                        {
                            "text": "伊通满族自治县",
                            "id": "220323",
                            "lnglat": "12529685,4334258",
                            "leaf": true
                        },
                        {
                            "text": "公主岭市",
                            "id": "220381",
                            "lnglat": "12481102,4350783",
                            "leaf": true
                        },
                        {
                            "text": "双辽市",
                            "id": "220382",
                            "lnglat": "12350191,4351051",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "辽源市",
                    "id": "220400",
                    "lnglat": "12514163,4290147",
                    "children": [
                        {
                            "text": "龙山区",
                            "id": "220402",
                            "lnglat": "12513016,4289349",
                            "leaf": true
                        },
                        {
                            "text": "西安区",
                            "id": "220403",
                            "lnglat": "12514324,4292522",
                            "leaf": true
                        },
                        {
                            "text": "东丰县",
                            "id": "220421",
                            "lnglat": "12552499,4267313",
                            "leaf": true
                        },
                        {
                            "text": "东辽县",
                            "id": "220422",
                            "lnglat": "12499614,4292169",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "白山市",
                    "id": "220600",
                    "lnglat": "12642042,4193672",
                    "children": [
                        {
                            "text": "八道江区",
                            "id": "220602",
                            "lnglat": "12641981,4194032",
                            "leaf": true
                        },
                        {
                            "text": "江源区",
                            "id": "220604",
                            "lnglat": "12659624,4207795",
                            "leaf": true
                        },
                        {
                            "text": "临江市",
                            "id": "220681",
                            "lnglat": "12690513,4180423",
                            "leaf": true
                        },
                        {
                            "text": "抚松县",
                            "id": "220621",
                            "lnglat": "12726982,4232677",
                            "leaf": true
                        },
                        {
                            "text": "靖宇县",
                            "id": "220622",
                            "lnglat": "12679993,4238912",
                            "leaf": true
                        },
                        {
                            "text": "长白朝鲜族自治县",
                            "id": "220623",
                            "lnglat": "12819290,4141736",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "白城市",
                    "id": "220800",
                    "lnglat": "12284259,4562103",
                    "children": [
                        {
                            "text": "洮北区",
                            "id": "220802",
                            "lnglat": "12283746,4561208",
                            "leaf": true
                        },
                        {
                            "text": "镇赉县",
                            "id": "220821",
                            "lnglat": "12319655,4584604",
                            "leaf": true
                        },
                        {
                            "text": "通榆县",
                            "id": "220822",
                            "lnglat": "12307742,4480679",
                            "leaf": true
                        },
                        {
                            "text": "洮南市",
                            "id": "220881",
                            "lnglat": "12277876,4533431",
                            "leaf": true
                        },
                        {
                            "text": "大安市",
                            "id": "220882",
                            "lnglat": "12428474,4550091",
                            "leaf": true
                        }
                    ]
                }
            ]
        },
        {
            "text": "黑龙江省",
            "id": "230000",
            "lnglat": "12666254,4573957",
            "children": [
                {
                    "text": "哈尔滨市",
                    "id": "230100",
                    "lnglat": "12666254,4573957",
                    "children": [
                        {
                            "text": "道里区",
                            "id": "230102",
                            "lnglat": "12660642,4575693",
                            "leaf": true
                        },
                        {
                            "text": "南岗区",
                            "id": "230103",
                            "lnglat": "12665328,4575374",
                            "leaf": true
                        },
                        {
                            "text": "道外区",
                            "id": "230104",
                            "lnglat": "12664423,4578828",
                            "leaf": true
                        },
                        {
                            "text": "香坊区",
                            "id": "230110",
                            "lnglat": "12668679,4572954",
                            "leaf": true
                        },
                        {
                            "text": "平房区",
                            "id": "230108",
                            "lnglat": "12663956,4559369",
                            "leaf": true
                        },
                        {
                            "text": "松北区",
                            "id": "230109",
                            "lnglat": "12655670,4580616",
                            "leaf": true
                        },
                        {
                            "text": "呼兰区",
                            "id": "230111",
                            "lnglat": "12673143,4612947",
                            "leaf": true
                        },
                        {
                            "text": "阿城区",
                            "id": "230112",
                            "lnglat": "12698248,4555022",
                            "leaf": true
                        },
                        {
                            "text": "依兰县",
                            "id": "230123",
                            "lnglat": "12955855,4631769",
                            "leaf": true
                        },
                        {
                            "text": "方正县",
                            "id": "230124",
                            "lnglat": "12882895,4583539",
                            "leaf": true
                        },
                        {
                            "text": "宾县",
                            "id": "230125",
                            "lnglat": "12747926,4575172",
                            "leaf": true
                        },
                        {
                            "text": "巴彦县",
                            "id": "230126",
                            "lnglat": "12739754,4607614",
                            "leaf": true
                        },
                        {
                            "text": "木兰县",
                            "id": "230127",
                            "lnglat": "12803281,4594728",
                            "leaf": true
                        },
                        {
                            "text": "通河县",
                            "id": "230128",
                            "lnglat": "12874261,4597459",
                            "leaf": true
                        },
                        {
                            "text": "延寿县",
                            "id": "230129",
                            "lnglat": "12832744,4545656",
                            "leaf": true
                        },
                        {
                            "text": "双城市",
                            "id": "230182",
                            "lnglat": "12629712,4537418",
                            "leaf": true
                        },
                        {
                            "text": "尚志市",
                            "id": "230183",
                            "lnglat": "12796154,4521479",
                            "leaf": true
                        },
                        {
                            "text": "五常市",
                            "id": "230184",
                            "lnglat": "12715060,4491777",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "伊春市",
                    "id": "230700",
                    "lnglat": "12890458,4772912",
                    "children": [
                        {
                            "text": "伊春区",
                            "id": "230702",
                            "lnglat": "12889625,4772564",
                            "leaf": true
                        },
                        {
                            "text": "南岔区",
                            "id": "230703",
                            "lnglat": "12927983,4713185",
                            "leaf": true
                        },
                        {
                            "text": "友好区",
                            "id": "230704",
                            "lnglat": "12882213,4785001",
                            "leaf": true
                        },
                        {
                            "text": "西林区",
                            "id": "230705",
                            "lnglat": "12928801,4748682",
                            "leaf": true
                        },
                        {
                            "text": "翠峦区",
                            "id": "230706",
                            "lnglat": "12865564,4771772",
                            "leaf": true
                        },
                        {
                            "text": "新青区",
                            "id": "230707",
                            "lnglat": "12952753,4828698",
                            "leaf": true
                        },
                        {
                            "text": "美溪区",
                            "id": "230708",
                            "lnglat": "12913972,4763246",
                            "leaf": true
                        },
                        {
                            "text": "金山屯区",
                            "id": "230709",
                            "lnglat": "12942603,4741467",
                            "leaf": true
                        },
                        {
                            "text": "五营区",
                            "id": "230710",
                            "lnglat": "12924713,4811962",
                            "leaf": true
                        },
                        {
                            "text": "乌马河区",
                            "id": "230711",
                            "lnglat": "12879216,4772248",
                            "leaf": true
                        },
                        {
                            "text": "汤旺河区",
                            "id": "230712",
                            "lnglat": "12956538,4845375",
                            "leaf": true
                        },
                        {
                            "text": "带岭区",
                            "id": "230713",
                            "lnglat": "12901636,4702520",
                            "leaf": true
                        },
                        {
                            "text": "乌伊岭区",
                            "id": "230714",
                            "lnglat": "12942525,4859481",
                            "leaf": true
                        },
                        {
                            "text": "红星区",
                            "id": "230715",
                            "lnglat": "12937633,4823365",
                            "leaf": true
                        },
                        {
                            "text": "上甘岭区",
                            "id": "230716",
                            "lnglat": "12902103,4797184",
                            "leaf": true
                        },
                        {
                            "text": "嘉荫县",
                            "id": "230722",
                            "lnglat": "13039316,4888824",
                            "leaf": true
                        },
                        {
                            "text": "铁力市",
                            "id": "230781",
                            "lnglat": "12804704,4698237",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "绥化市",
                    "id": "231200",
                    "lnglat": "12698372,4663557",
                    "children": [
                        {
                            "text": "北林区",
                            "id": "231202",
                            "lnglat": "12696523,4663456",
                            "leaf": true
                        },
                        {
                            "text": "望奎县",
                            "id": "231221",
                            "lnglat": "12647803,4683170",
                            "leaf": true
                        },
                        {
                            "text": "兰西县",
                            "id": "231222",
                            "lnglat": "12629152,4625736",
                            "leaf": true
                        },
                        {
                            "text": "青冈县",
                            "id": "231223",
                            "lnglat": "12610065,4668247",
                            "leaf": true
                        },
                        {
                            "text": "庆安县",
                            "id": "231224",
                            "lnglat": "12750422,4687581",
                            "leaf": true
                        },
                        {
                            "text": "明水县",
                            "id": "231225",
                            "lnglat": "12590546,4717854",
                            "leaf": true
                        },
                        {
                            "text": "绥棱县",
                            "id": "231226",
                            "lnglat": "12710489,4724445",
                            "leaf": true
                        },
                        {
                            "text": "安达市",
                            "id": "231281",
                            "lnglat": "12532219,4640183",
                            "leaf": true
                        },
                        {
                            "text": "肇东市",
                            "id": "231282",
                            "lnglat": "12598470,4607316",
                            "leaf": true
                        },
                        {
                            "text": "海伦市",
                            "id": "231283",
                            "lnglat": "12696094,4745991",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "双鸭山市",
                    "id": "230500",
                    "lnglat": "13115046,4664449",
                    "children": [
                        {
                            "text": "尖山区",
                            "id": "230502",
                            "lnglat": "13114498,4663662",
                            "leaf": true
                        },
                        {
                            "text": "岭东区",
                            "id": "230503",
                            "lnglat": "13113406,4656995",
                            "leaf": true
                        },
                        {
                            "text": "四方台区",
                            "id": "230505",
                            "lnglat": "13132787,4659142",
                            "leaf": true
                        },
                        {
                            "text": "宝山区",
                            "id": "230506",
                            "lnglat": "13139332,4657500",
                            "leaf": true
                        },
                        {
                            "text": "集贤县",
                            "id": "230521",
                            "lnglat": "13112857,4671522",
                            "leaf": true
                        },
                        {
                            "text": "友谊县",
                            "id": "230522",
                            "lnglat": "13180249,4677740",
                            "leaf": true
                        },
                        {
                            "text": "宝清县",
                            "id": "230523",
                            "lnglat": "13220555,4632755",
                            "leaf": true
                        },
                        {
                            "text": "饶河县",
                            "id": "230524",
                            "lnglat": "13400415,4679785",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "齐齐哈尔市",
                    "id": "230200",
                    "lnglat": "12395920,4734192",
                    "children": [
                        {
                            "text": "龙沙区",
                            "id": "230202",
                            "lnglat": "12395749,4734035",
                            "leaf": true
                        },
                        {
                            "text": "建华区",
                            "id": "230203",
                            "lnglat": "12395085,4734949",
                            "leaf": true
                        },
                        {
                            "text": "铁锋区",
                            "id": "230204",
                            "lnglat": "12397844,4733687",
                            "leaf": true
                        },
                        {
                            "text": "昂昂溪区",
                            "id": "230205",
                            "lnglat": "12380667,4715643",
                            "leaf": true
                        },
                        {
                            "text": "富拉尔基区",
                            "id": "230206",
                            "lnglat": "12362170,4720635",
                            "leaf": true
                        },
                        {
                            "text": "碾子山区",
                            "id": "230207",
                            "lnglat": "12288412,4751292",
                            "leaf": true
                        },
                        {
                            "text": "梅里斯达斡尔族区",
                            "id": "230208",
                            "lnglat": "12375201,4731403",
                            "leaf": true
                        },
                        {
                            "text": "龙江县",
                            "id": "230221",
                            "lnglat": "12318250,4733289",
                            "leaf": true
                        },
                        {
                            "text": "依安县",
                            "id": "230223",
                            "lnglat": "12530209,4788616",
                            "leaf": true
                        },
                        {
                            "text": "泰来县",
                            "id": "230224",
                            "lnglat": "12341375,4639369",
                            "leaf": true
                        },
                        {
                            "text": "甘南县",
                            "id": "230225",
                            "lnglat": "12349939,4791622",
                            "leaf": true
                        },
                        {
                            "text": "富裕县",
                            "id": "230227",
                            "lnglat": "12445936,4779342",
                            "leaf": true
                        },
                        {
                            "text": "克山县",
                            "id": "230229",
                            "lnglat": "12586339,4802929",
                            "leaf": true
                        },
                        {
                            "text": "克东县",
                            "id": "230230",
                            "lnglat": "12623759,4803506",
                            "leaf": true
                        },
                        {
                            "text": "拜泉县",
                            "id": "230231",
                            "lnglat": "12608753,4760513",
                            "leaf": true
                        },
                        {
                            "text": "讷河市",
                            "id": "230281",
                            "lnglat": "12486483,4847765",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "七台河市",
                    "id": "230900",
                    "lnglat": "13099548,4576782",
                    "children": [
                        {
                            "text": "新兴区",
                            "id": "230902",
                            "lnglat": "13085528,4581188",
                            "leaf": true
                        },
                        {
                            "text": "桃山区",
                            "id": "230903",
                            "lnglat": "13097299,4577225",
                            "leaf": true
                        },
                        {
                            "text": "茄子河区",
                            "id": "230904",
                            "lnglat": "13106457,4577333",
                            "leaf": true
                        },
                        {
                            "text": "勃利县",
                            "id": "230921",
                            "lnglat": "13056139,4574886",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "牡丹江市",
                    "id": "231000",
                    "lnglat": "12961041,4457863",
                    "children": [
                        {
                            "text": "东安区",
                            "id": "231002",
                            "lnglat": "12962365,4458046",
                            "leaf": true
                        },
                        {
                            "text": "阳明区",
                            "id": "231003",
                            "lnglat": "12963081,4459305",
                            "leaf": true
                        },
                        {
                            "text": "爱民区",
                            "id": "231004",
                            "lnglat": "12958375,4459411",
                            "leaf": true
                        },
                        {
                            "text": "西安区",
                            "id": "231005",
                            "lnglat": "12514265,4292647",
                            "leaf": true
                        },
                        {
                            "text": "东宁县",
                            "id": "231024",
                            "lnglat": "13111817,4405932",
                            "leaf": true
                        },
                        {
                            "text": "林口县",
                            "id": "231025",
                            "lnglat": "13026395,4528849",
                            "leaf": true
                        },
                        {
                            "text": "绥芬河市",
                            "id": "231081",
                            "lnglat": "13115343,4439306",
                            "leaf": true
                        },
                        {
                            "text": "海林市",
                            "id": "231083",
                            "lnglat": "12938330,4457312",
                            "leaf": true
                        },
                        {
                            "text": "宁安市",
                            "id": "231084",
                            "lnglat": "12946236,4434441",
                            "leaf": true
                        },
                        {
                            "text": "穆棱市",
                            "id": "231085",
                            "lnglat": "13052934,4492249",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "佳木斯市",
                    "id": "230800",
                    "lnglat": "13036151,4680981",
                    "children": [
                        {
                            "text": "永红区",
                            "id": "230802",
                            "lnglat": "13034220,4680698",
                            "leaf": true
                        },
                        {
                            "text": "向阳区",
                            "id": "230803",
                            "lnglat": "13037433,4681869",
                            "leaf": true
                        },
                        {
                            "text": "前进区",
                            "id": "230804",
                            "lnglat": "13036717,4681132",
                            "leaf": true
                        },
                        {
                            "text": "东风区",
                            "id": "230805",
                            "lnglat": "13039962,4682206",
                            "leaf": true
                        },
                        {
                            "text": "郊区",
                            "id": "230811",
                            "lnglat": "13031919,4680724",
                            "leaf": true
                        },
                        {
                            "text": "桦南县",
                            "id": "230822",
                            "lnglat": "13058577,4624953",
                            "leaf": true
                        },
                        {
                            "text": "桦川县",
                            "id": "230826",
                            "lnglat": "13071167,4702538",
                            "leaf": true
                        },
                        {
                            "text": "汤原县",
                            "id": "230828",
                            "lnglat": "12989816,4672749",
                            "leaf": true
                        },
                        {
                            "text": "抚远县",
                            "id": "230833",
                            "lnglat": "13428044,4836698",
                            "leaf": true
                        },
                        {
                            "text": "同江市",
                            "id": "230881",
                            "lnglat": "13250705,4765678",
                            "leaf": true
                        },
                        {
                            "text": "富锦市",
                            "id": "230882",
                            "lnglat": "13202859,4725536",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "鸡西市",
                    "id": "230300",
                    "lnglat": "13097651,4530044",
                    "children": [
                        {
                            "text": "鸡冠区",
                            "id": "230302",
                            "lnglat": "13097086,4530525",
                            "leaf": true
                        },
                        {
                            "text": "恒山区",
                            "id": "230303",
                            "lnglat": "13092645,4520498",
                            "leaf": true
                        },
                        {
                            "text": "滴道区",
                            "id": "230304",
                            "lnglat": "13077682,4536082",
                            "leaf": true
                        },
                        {
                            "text": "梨树区",
                            "id": "230305",
                            "lnglat": "13069051,4509141",
                            "leaf": true
                        },
                        {
                            "text": "城子河区",
                            "id": "230306",
                            "lnglat": "13098346,4534140",
                            "leaf": true
                        },
                        {
                            "text": "麻山区",
                            "id": "230307",
                            "lnglat": "13046877,4520430",
                            "leaf": true
                        },
                        {
                            "text": "鸡东县",
                            "id": "230321",
                            "lnglat": "13113925,4524808",
                            "leaf": true
                        },
                        {
                            "text": "虎林市",
                            "id": "230381",
                            "lnglat": "13297047,4576572",
                            "leaf": true
                        },
                        {
                            "text": "密山市",
                            "id": "230382",
                            "lnglat": "13186694,4554050",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "黑河市",
                    "id": "231100",
                    "lnglat": "12749599,5024523",
                    "children": [
                        {
                            "text": "爱辉区",
                            "id": "231102",
                            "lnglat": "12748677,5024598",
                            "leaf": true
                        },
                        {
                            "text": "嫩江县",
                            "id": "231121",
                            "lnglat": "12522162,4917262",
                            "leaf": true
                        },
                        {
                            "text": "逊克县",
                            "id": "231123",
                            "lnglat": "12846959,4958176",
                            "leaf": true
                        },
                        {
                            "text": "孙吴县",
                            "id": "231124",
                            "lnglat": "12731572,4942035",
                            "leaf": true
                        },
                        {
                            "text": "北安市",
                            "id": "231181",
                            "lnglat": "12650233,4824462",
                            "leaf": true
                        },
                        {
                            "text": "五大连池市",
                            "id": "231182",
                            "lnglat": "12618743,4851034",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "鹤岗市",
                    "id": "230400",
                    "lnglat": "13028226,4731386",
                    "children": [
                        {
                            "text": "向阳区",
                            "id": "230402",
                            "lnglat": "13030448,4732977",
                            "leaf": true
                        },
                        {
                            "text": "工农区",
                            "id": "230403",
                            "lnglat": "13026831,4733207",
                            "leaf": true
                        },
                        {
                            "text": "南山区",
                            "id": "230404",
                            "lnglat": "13027881,4731347",
                            "leaf": true
                        },
                        {
                            "text": "兴安区",
                            "id": "230405",
                            "lnglat": "13023187,4724760",
                            "leaf": true
                        },
                        {
                            "text": "东山区",
                            "id": "230406",
                            "lnglat": "13030867,4733559",
                            "leaf": true
                        },
                        {
                            "text": "兴山区",
                            "id": "230407",
                            "lnglat": "13028271,4734697",
                            "leaf": true
                        },
                        {
                            "text": "萝北县",
                            "id": "230421",
                            "lnglat": "13082298,4757489",
                            "leaf": true
                        },
                        {
                            "text": "绥滨县",
                            "id": "230422",
                            "lnglat": "13185027,4728752",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "大庆市",
                    "id": "230600",
                    "lnglat": "12500504,4659626",
                    "children": [
                        {
                            "text": "萨尔图区",
                            "id": "230602",
                            "lnglat": "12499915,4659121",
                            "leaf": true
                        },
                        {
                            "text": "龙凤区",
                            "id": "230603",
                            "lnglat": "12510188,4652951",
                            "leaf": true
                        },
                        {
                            "text": "让胡路区",
                            "id": "230604",
                            "lnglat": "12485540,4665314",
                            "leaf": true
                        },
                        {
                            "text": "红岗区",
                            "id": "230605",
                            "lnglat": "12487678,4640122",
                            "leaf": true
                        },
                        {
                            "text": "大同区",
                            "id": "230606",
                            "lnglat": "12481827,4603360",
                            "leaf": true
                        },
                        {
                            "text": "肇州县",
                            "id": "230621",
                            "lnglat": "12526888,4570455",
                            "leaf": true
                        },
                        {
                            "text": "肇源县",
                            "id": "230622",
                            "lnglat": "12507856,4551707",
                            "leaf": true
                        },
                        {
                            "text": "林甸县",
                            "id": "230623",
                            "lnglat": "12487154,4718164",
                            "leaf": true
                        },
                        {
                            "text": "杜尔伯特蒙古族自治县",
                            "id": "230624",
                            "lnglat": "12443806,4685541",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "大兴安岭地区",
                    "id": "232700",
                    "lnglat": "12411838,5041868",
                    "children": [
                        {
                            "text": "呼玛县",
                            "id": "232721",
                            "lnglat": "12665527,5172535",
                            "leaf": true
                        },
                        {
                            "text": "塔河县",
                            "id": "232722",
                            "lnglat": "12470415,5233394",
                            "leaf": true
                        },
                        {
                            "text": "漠河县",
                            "id": "232723",
                            "lnglat": "12252930,5297004",
                            "leaf": true
                        },
                        {
                            "text": "加格达奇区",
                            "id": "232701",
                            "leaf": true
                        },
                        {
                            "text": "松岭区",
                            "id": "232702",
                            "leaf": true
                        },
                        {
                            "text": "新林区",
                            "id": "232703",
                            "leaf": true
                        },
                        {
                            "text": "呼中区",
                            "id": "232704",
                            "leaf": true
                        }
                    ]
                }
            ]
        },
        {
            "text": "宁夏回族自治区",
            "id": "640000",
            "lnglat": "10628956,3847426",
            "children": [
                {
                    "text": "银川市",
                    "id": "640100",
                    "lnglat": "10628956,3847426",
                    "children": [
                        {
                            "text": "兴庆区",
                            "id": "640104",
                            "lnglat": "10628414,3847317",
                            "leaf": true
                        },
                        {
                            "text": "西夏区",
                            "id": "640105",
                            "lnglat": "10614572,3849078",
                            "leaf": true
                        },
                        {
                            "text": "金凤区",
                            "id": "640106",
                            "lnglat": "10618181,3849352",
                            "leaf": true
                        },
                        {
                            "text": "永宁县",
                            "id": "640121",
                            "lnglat": "10625138,3828055",
                            "leaf": true
                        },
                        {
                            "text": "贺兰县",
                            "id": "640122",
                            "lnglat": "10635097,3855143",
                            "leaf": true
                        },
                        {
                            "text": "灵武市",
                            "id": "640181",
                            "lnglat": "10633351,3809080",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "吴忠市",
                    "id": "640300",
                    "lnglat": "10619498,3798149",
                    "children": [
                        {
                            "text": "利通区",
                            "id": "640302",
                            "lnglat": "10620837,3780251",
                            "leaf": true
                        },
                        {
                            "text": "盐池县",
                            "id": "640323",
                            "lnglat": "10740804,3778958",
                            "leaf": true
                        },
                        {
                            "text": "同心县",
                            "id": "640324",
                            "lnglat": "10590861,3697822",
                            "leaf": true
                        },
                        {
                            "text": "青铜峡市",
                            "id": "640381",
                            "lnglat": "10607848,3801969",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "石嘴山市",
                    "id": "640200",
                    "lnglat": "10636317,3901814",
                    "children": [
                        {
                            "text": "大武口区",
                            "id": "640202",
                            "lnglat": "10637231,3901116",
                            "leaf": true
                        },
                        {
                            "text": "惠农区",
                            "id": "640205",
                            "lnglat": "10677642,3923719",
                            "leaf": true
                        },
                        {
                            "text": "平罗县",
                            "id": "640221",
                            "lnglat": "10653851,3890489",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "固原市",
                    "id": "640400",
                    "lnglat": "10627737,3600531",
                    "children": [
                        {
                            "text": "原州区",
                            "id": "640402",
                            "lnglat": "10625237,3609182",
                            "leaf": true
                        },
                        {
                            "text": "西吉县",
                            "id": "640422",
                            "lnglat": "10572435,3596515",
                            "leaf": true
                        },
                        {
                            "text": "隆德县",
                            "id": "640423",
                            "lnglat": "10612031,3561520",
                            "leaf": true
                        },
                        {
                            "text": "泾源县",
                            "id": "640424",
                            "lnglat": "10633162,3549108",
                            "leaf": true
                        },
                        {
                            "text": "彭阳县",
                            "id": "640425",
                            "lnglat": "10664656,3584566",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "中卫市",
                    "id": "640500",
                    "lnglat": "10493868,3734337",
                    "children": [
                        {
                            "text": "沙坡头区",
                            "id": "640502",
                            "lnglat": "10503210,3745165",
                            "leaf": true
                        },
                        {
                            "text": "中宁县",
                            "id": "640521",
                            "lnglat": "10567437,3748739",
                            "leaf": true
                        },
                        {
                            "text": "海原县",
                            "id": "640522",
                            "lnglat": "10564509,3656344",
                            "leaf": true
                        }
                    ]
                }
            ]
        },
        {
            "text": "陕西省",
            "id": "610000",
            "lnglat": "10899760,3430017",
            "children": [
                {
                    "text": "西安市",
                    "id": "610100",
                    "lnglat": "10899760,3430017",
                    "children": [
                        {
                            "text": "新城区",
                            "id": "610102",
                            "lnglat": "10898141,3427478",
                            "leaf": true
                        },
                        {
                            "text": "碑林区",
                            "id": "610103",
                            "lnglat": "10892913,3423197",
                            "leaf": true
                        },
                        {
                            "text": "莲湖区",
                            "id": "610104",
                            "lnglat": "10893523,3426877",
                            "leaf": true
                        },
                        {
                            "text": "灞桥区",
                            "id": "610111",
                            "lnglat": "10905973,3427378",
                            "leaf": true
                        },
                        {
                            "text": "未央区",
                            "id": "610112",
                            "lnglat": "10894210,3429445",
                            "leaf": true
                        },
                        {
                            "text": "雁塔区",
                            "id": "610113",
                            "lnglat": "10894347,3422419",
                            "leaf": true
                        },
                        {
                            "text": "阎良区",
                            "id": "610114",
                            "lnglat": "10922113,3466283",
                            "leaf": true
                        },
                        {
                            "text": "临潼区",
                            "id": "610115",
                            "lnglat": "10921559,3436613",
                            "leaf": true
                        },
                        {
                            "text": "长安区",
                            "id": "610116",
                            "lnglat": "10893868,3416016",
                            "leaf": true
                        },
                        {
                            "text": "蓝田县",
                            "id": "610122",
                            "lnglat": "10947001,3408838",
                            "leaf": true
                        },
                        {
                            "text": "周至县",
                            "id": "610124",
                            "lnglat": "10821561,3416584",
                            "leaf": true
                        },
                        {
                            "text": "户县",
                            "id": "610125",
                            "lnglat": "10860029,3411439",
                            "leaf": true
                        },
                        {
                            "text": "高陵县",
                            "id": "610126",
                            "lnglat": "10906024,3450470",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "榆林市",
                    "id": "610800",
                    "lnglat": "10974866,3828888",
                    "children": [
                        {
                            "text": "榆阳区",
                            "id": "610802",
                            "lnglat": "10972866,3827752",
                            "leaf": true
                        },
                        {
                            "text": "神木县",
                            "id": "610821",
                            "lnglat": "11049080,3882224",
                            "leaf": true
                        },
                        {
                            "text": "府谷县",
                            "id": "610822",
                            "lnglat": "11107117,3902926",
                            "leaf": true
                        },
                        {
                            "text": "横山县",
                            "id": "610823",
                            "lnglat": "10929152,3796306",
                            "leaf": true
                        },
                        {
                            "text": "靖边县",
                            "id": "610824",
                            "lnglat": "10879910,3759717",
                            "leaf": true
                        },
                        {
                            "text": "定边县",
                            "id": "610825",
                            "lnglat": "10760395,3759004",
                            "leaf": true
                        },
                        {
                            "text": "绥德县",
                            "id": "610826",
                            "lnglat": "11025429,3749716",
                            "leaf": true
                        },
                        {
                            "text": "米脂县",
                            "id": "610827",
                            "lnglat": "11018203,3775348",
                            "leaf": true
                        },
                        {
                            "text": "佳县",
                            "id": "610828",
                            "lnglat": "11048917,3802334",
                            "leaf": true
                        },
                        {
                            "text": "吴堡县",
                            "id": "610829",
                            "lnglat": "11073484,3745511",
                            "leaf": true
                        },
                        {
                            "text": "清涧县",
                            "id": "610830",
                            "lnglat": "11011851,3708635",
                            "leaf": true
                        },
                        {
                            "text": "子洲县",
                            "id": "610831",
                            "lnglat": "11003214,3761190",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "延安市",
                    "id": "610600",
                    "lnglat": "10949127,3659553",
                    "children": [
                        {
                            "text": "宝塔区",
                            "id": "610602",
                            "lnglat": "10966369,3660696",
                            "leaf": true
                        },
                        {
                            "text": "延长县",
                            "id": "610621",
                            "lnglat": "11001668,3658572",
                            "leaf": true
                        },
                        {
                            "text": "延川县",
                            "id": "610622",
                            "lnglat": "11016716,3687464",
                            "leaf": true
                        },
                        {
                            "text": "子长县",
                            "id": "610623",
                            "lnglat": "10966752,3713885",
                            "leaf": true
                        },
                        {
                            "text": "安塞县",
                            "id": "610624",
                            "lnglat": "10914353,3691935",
                            "leaf": true
                        },
                        {
                            "text": "志丹县",
                            "id": "610625",
                            "lnglat": "10862734,3677613",
                            "leaf": true
                        },
                        {
                            "text": "吴起县",
                            "id": "610626",
                            "lnglat": "10817561,3692316",
                            "leaf": true
                        },
                        {
                            "text": "甘泉县",
                            "id": "610627",
                            "lnglat": "10934761,3627971",
                            "leaf": true
                        },
                        {
                            "text": "富县",
                            "id": "610628",
                            "lnglat": "10910181,3605147",
                            "leaf": true
                        },
                        {
                            "text": "洛川县",
                            "id": "610629",
                            "lnglat": "10953635,3571441",
                            "leaf": true
                        },
                        {
                            "text": "宜川县",
                            "id": "610630",
                            "lnglat": "11018415,3604610",
                            "leaf": true
                        },
                        {
                            "text": "黄龙县",
                            "id": "610631",
                            "lnglat": "10983883,3557708",
                            "leaf": true
                        },
                        {
                            "text": "黄陵县",
                            "id": "610632",
                            "lnglat": "10897956,3558458",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "咸阳市",
                    "id": "610400",
                    "lnglat": "10872093,3433655",
                    "children": [
                        {
                            "text": "秦都区",
                            "id": "610402",
                            "lnglat": "10870958,3433923",
                            "leaf": true
                        },
                        {
                            "text": "杨凌区",
                            "id": "610403",
                            "lnglat": "10803699,3428059",
                            "leaf": true
                        },
                        {
                            "text": "渭城区",
                            "id": "610404",
                            "lnglat": "10871740,3433342",
                            "leaf": true
                        },
                        {
                            "text": "三原县",
                            "id": "610422",
                            "lnglat": "10893597,3461654",
                            "leaf": true
                        },
                        {
                            "text": "泾阳县",
                            "id": "610423",
                            "lnglat": "10883037,3452980",
                            "leaf": true
                        },
                        {
                            "text": "乾县",
                            "id": "610424",
                            "lnglat": "10823494,3453197",
                            "leaf": true
                        },
                        {
                            "text": "礼泉县",
                            "id": "610425",
                            "lnglat": "10842961,3448334",
                            "leaf": true
                        },
                        {
                            "text": "永寿县",
                            "id": "610426",
                            "lnglat": "10814106,3468974",
                            "leaf": true
                        },
                        {
                            "text": "彬县",
                            "id": "610427",
                            "lnglat": "10807902,3503890",
                            "leaf": true
                        },
                        {
                            "text": "长武县",
                            "id": "610428",
                            "lnglat": "10779058,3520746",
                            "leaf": true
                        },
                        {
                            "text": "旬邑县",
                            "id": "610429",
                            "lnglat": "10832771,3511454",
                            "leaf": true
                        },
                        {
                            "text": "淳化县",
                            "id": "610430",
                            "lnglat": "10858181,3478719",
                            "leaf": true
                        },
                        {
                            "text": "武功县",
                            "id": "610431",
                            "lnglat": "10820090,3426604",
                            "leaf": true
                        },
                        {
                            "text": "兴平市",
                            "id": "610481",
                            "lnglat": "10848099,3430033",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "渭南市",
                    "id": "610500",
                    "lnglat": "10950427,3450081",
                    "children": [
                        {
                            "text": "临渭区",
                            "id": "610502",
                            "lnglat": "10957110,3451626",
                            "leaf": true
                        },
                        {
                            "text": "华县",
                            "id": "610521",
                            "lnglat": "10974986,3451767",
                            "leaf": true
                        },
                        {
                            "text": "潼关县",
                            "id": "610522",
                            "lnglat": "11029180,3451006",
                            "leaf": true
                        },
                        {
                            "text": "大荔县",
                            "id": "610523",
                            "lnglat": "10993982,3479907",
                            "leaf": true
                        },
                        {
                            "text": "合阳县",
                            "id": "610524",
                            "lnglat": "11016415,3524040",
                            "leaf": true
                        },
                        {
                            "text": "澄城县",
                            "id": "610525",
                            "lnglat": "10992551,3518596",
                            "leaf": true
                        },
                        {
                            "text": "蒲城县",
                            "id": "610526",
                            "lnglat": "10958790,3496511",
                            "leaf": true
                        },
                        {
                            "text": "白水县",
                            "id": "610527",
                            "lnglat": "10956737,3517328",
                            "leaf": true
                        },
                        {
                            "text": "富平县",
                            "id": "610528",
                            "lnglat": "10915842,3475695",
                            "leaf": true
                        },
                        {
                            "text": "韩城市",
                            "id": "610581",
                            "lnglat": "11043571,3546479",
                            "leaf": true
                        },
                        {
                            "text": "华阴市",
                            "id": "610582",
                            "lnglat": "11008009,3456772",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "铜川市",
                    "id": "610200",
                    "lnglat": "10907037,3507052",
                    "children": [
                        {
                            "text": "王益区",
                            "id": "610202",
                            "lnglat": "10907069,3506943",
                            "leaf": true
                        },
                        {
                            "text": "印台区",
                            "id": "610203",
                            "lnglat": "10902876,3500474",
                            "leaf": true
                        },
                        {
                            "text": "耀州区",
                            "id": "610204",
                            "lnglat": "10897352,3491297",
                            "leaf": true
                        },
                        {
                            "text": "宜君县",
                            "id": "610222",
                            "lnglat": "10911458,3540272",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "商洛市",
                    "id": "611000",
                    "lnglat": "10987527,3391029",
                    "children": [
                        {
                            "text": "商州区",
                            "id": "611002",
                            "lnglat": "10987527,3391029",
                            "leaf": true
                        },
                        {
                            "text": "洛南县",
                            "id": "611021",
                            "lnglat": "11013669,3409314",
                            "leaf": true
                        },
                        {
                            "text": "丹凤县",
                            "id": "611022",
                            "lnglat": "11032769,3369303",
                            "leaf": true
                        },
                        {
                            "text": "商南县",
                            "id": "611023",
                            "lnglat": "11087601,3353119",
                            "leaf": true
                        },
                        {
                            "text": "山阳县",
                            "id": "611024",
                            "lnglat": "10987764,3353464",
                            "leaf": true
                        },
                        {
                            "text": "镇安县",
                            "id": "611025",
                            "lnglat": "10909330,3341263",
                            "leaf": true
                        },
                        {
                            "text": "柞水县",
                            "id": "611026",
                            "lnglat": "10910607,3368338",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "汉中市",
                    "id": "610700",
                    "lnglat": "10701902,3307000",
                    "children": [
                        {
                            "text": "汉台区",
                            "id": "610702",
                            "lnglat": "10701291,3319731",
                            "leaf": true
                        },
                        {
                            "text": "南郑县",
                            "id": "610721",
                            "lnglat": "10693191,3300147",
                            "leaf": true
                        },
                        {
                            "text": "城固县",
                            "id": "610722",
                            "lnglat": "10732880,3315614",
                            "leaf": true
                        },
                        {
                            "text": "洋县",
                            "id": "610723",
                            "lnglat": "10754547,3321925",
                            "leaf": true
                        },
                        {
                            "text": "西乡县",
                            "id": "610724",
                            "lnglat": "10775884,3297304",
                            "leaf": true
                        },
                        {
                            "text": "勉县",
                            "id": "610725",
                            "lnglat": "10667351,3315746",
                            "leaf": true
                        },
                        {
                            "text": "宁强县",
                            "id": "610726",
                            "lnglat": "10625465,3283035",
                            "leaf": true
                        },
                        {
                            "text": "略阳县",
                            "id": "610727",
                            "lnglat": "10610868,3336686",
                            "leaf": true
                        },
                        {
                            "text": "镇巴县",
                            "id": "610728",
                            "lnglat": "10790204,3252248",
                            "leaf": true
                        },
                        {
                            "text": "留坝县",
                            "id": "610729",
                            "lnglat": "10691697,3361924",
                            "leaf": true
                        },
                        {
                            "text": "佛坪县",
                            "id": "610730",
                            "lnglat": "10790451,3350710",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "宝鸡市",
                    "id": "610300",
                    "lnglat": "10714178,3437353",
                    "children": [
                        {
                            "text": "渭滨区",
                            "id": "610302",
                            "lnglat": "10714517,3437210",
                            "leaf": true
                        },
                        {
                            "text": "金台区",
                            "id": "610303",
                            "lnglat": "10714148,3437769",
                            "leaf": true
                        },
                        {
                            "text": "陈仓区",
                            "id": "610304",
                            "lnglat": "10738289,3435555",
                            "leaf": true
                        },
                        {
                            "text": "凤翔县",
                            "id": "610322",
                            "lnglat": "10739271,3453758",
                            "leaf": true
                        },
                        {
                            "text": "岐山县",
                            "id": "610323",
                            "lnglat": "10770317,3437298",
                            "leaf": true
                        },
                        {
                            "text": "扶风县",
                            "id": "610324",
                            "lnglat": "10786331,3435984",
                            "leaf": true
                        },
                        {
                            "text": "眉县",
                            "id": "610326",
                            "lnglat": "10783501,3414888",
                            "leaf": true
                        },
                        {
                            "text": "陇县",
                            "id": "610327",
                            "lnglat": "10685274,3490326",
                            "leaf": true
                        },
                        {
                            "text": "千阳县",
                            "id": "610328",
                            "lnglat": "10713003,3465027",
                            "leaf": true
                        },
                        {
                            "text": "麟游县",
                            "id": "610329",
                            "lnglat": "10779302,3468118",
                            "leaf": true
                        },
                        {
                            "text": "凤县",
                            "id": "610330",
                            "lnglat": "10676493,3394321",
                            "leaf": true
                        },
                        {
                            "text": "太白县",
                            "id": "610331",
                            "lnglat": "10731544,3406119",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "安康市",
                    "id": "610900",
                    "lnglat": "10902437,3268722",
                    "children": [
                        {
                            "text": "汉滨区",
                            "id": "610902",
                            "lnglat": "10894164,3282653",
                            "leaf": true
                        },
                        {
                            "text": "汉阴县",
                            "id": "610921",
                            "lnglat": "10850362,3289301",
                            "leaf": true
                        },
                        {
                            "text": "石泉县",
                            "id": "610922",
                            "lnglat": "10824278,3304740",
                            "leaf": true
                        },
                        {
                            "text": "宁陕县",
                            "id": "610923",
                            "lnglat": "10829877,3331859",
                            "leaf": true
                        },
                        {
                            "text": "紫阳县",
                            "id": "610924",
                            "lnglat": "10852851,3252440",
                            "leaf": true
                        },
                        {
                            "text": "岚皋县",
                            "id": "610925",
                            "lnglat": "10889733,3230876",
                            "leaf": true
                        },
                        {
                            "text": "平利县",
                            "id": "610926",
                            "lnglat": "10935379,3239389",
                            "leaf": true
                        },
                        {
                            "text": "镇坪县",
                            "id": "610927",
                            "lnglat": "10952101,3188572",
                            "leaf": true
                        },
                        {
                            "text": "旬阳县",
                            "id": "610928",
                            "lnglat": "10937525,3283367",
                            "leaf": true
                        },
                        {
                            "text": "白河县",
                            "id": "610929",
                            "lnglat": "11010808,3281072",
                            "leaf": true
                        }
                    ]
                }
            ]
        },
        {
            "text": "青海省",
            "id": "630000",
            "lnglat": "10180335,3662695",
            "children": [
                {
                    "text": "西宁市",
                    "id": "630100",
                    "lnglat": "10180335,3662695",
                    "children": [
                        {
                            "text": "城东区",
                            "id": "630102",
                            "lnglat": "10179231,3661795",
                            "leaf": true
                        },
                        {
                            "text": "城中区",
                            "id": "630103",
                            "lnglat": "10179641,3663317",
                            "leaf": true
                        },
                        {
                            "text": "城西区",
                            "id": "630104",
                            "lnglat": "10176489,3662744",
                            "leaf": true
                        },
                        {
                            "text": "城北区",
                            "id": "630105",
                            "lnglat": "10830318,2284226",
                            "leaf": true
                        },
                        {
                            "text": "大通回族土族自治县",
                            "id": "630121",
                            "lnglat": "10166232,3694701",
                            "leaf": true
                        },
                        {
                            "text": "湟中县",
                            "id": "630122",
                            "lnglat": "10156820,3650429",
                            "leaf": true
                        },
                        {
                            "text": "湟源县",
                            "id": "630123",
                            "lnglat": "10127389,3668927",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "玉树藏族自治州",
                    "id": "632700",
                    "lnglat": "9700937,3300301",
                    "children": [
                        {
                            "text": "玉树县",
                            "id": "632721",
                            "lnglat": "9700702,3300809",
                            "leaf": true
                        },
                        {
                            "text": "杂多县",
                            "id": "632722",
                            "lnglat": "9529775,3289565",
                            "leaf": true
                        },
                        {
                            "text": "称多县",
                            "id": "632723",
                            "lnglat": "9710263,3336920",
                            "leaf": true
                        },
                        {
                            "text": "治多县",
                            "id": "632724",
                            "lnglat": "9561168,3385546",
                            "leaf": true
                        },
                        {
                            "text": "囊谦县",
                            "id": "632725",
                            "lnglat": "9647365,3220633",
                            "leaf": true
                        },
                        {
                            "text": "曲麻莱县",
                            "id": "632726",
                            "lnglat": "9579996,3413301",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "黄南藏族自治州",
                    "id": "632300",
                    "lnglat": "10201414,3551938",
                    "children": [
                        {
                            "text": "同仁县",
                            "id": "632321",
                            "lnglat": "10201333,3551378",
                            "leaf": true
                        },
                        {
                            "text": "尖扎县",
                            "id": "632322",
                            "lnglat": "10203120,3594221",
                            "leaf": true
                        },
                        {
                            "text": "泽库县",
                            "id": "632323",
                            "lnglat": "10146135,3503819",
                            "leaf": true
                        },
                        {
                            "text": "河南蒙古族自治县",
                            "id": "632324",
                            "lnglat": "10161531,3473622",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "海西蒙古族藏族自治州",
                    "id": "632800",
                    "lnglat": "9736883,3737855",
                    "children": [
                        {
                            "text": "格尔木市",
                            "id": "632801",
                            "lnglat": "9489672,3640288",
                            "leaf": true
                        },
                        {
                            "text": "德令哈市",
                            "id": "632802",
                            "lnglat": "9736495,3737667",
                            "leaf": true
                        },
                        {
                            "text": "乌兰县",
                            "id": "632821",
                            "lnglat": "9847729,3693296",
                            "leaf": true
                        },
                        {
                            "text": "都兰县",
                            "id": "632822",
                            "lnglat": "9808727,3630311",
                            "leaf": true
                        },
                        {
                            "text": "天峻县",
                            "id": "632823",
                            "lnglat": "9902324,3730125",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "海东地区",
                    "id": "632100",
                    "lnglat": "10210682,3650046",
                    "children": [
                        {
                            "text": "平安县",
                            "id": "632121",
                            "lnglat": "10211229,3650106",
                            "leaf": true
                        },
                        {
                            "text": "民和回族土族自治县",
                            "id": "632122",
                            "lnglat": "10280205,3632581",
                            "leaf": true
                        },
                        {
                            "text": "乐都县",
                            "id": "632123",
                            "lnglat": "10239774,3648258",
                            "leaf": true
                        },
                        {
                            "text": "互助土族自治县",
                            "id": "632126",
                            "lnglat": "10195398,3683965",
                            "leaf": true
                        },
                        {
                            "text": "化隆回族自治县",
                            "id": "632127",
                            "lnglat": "10226361,3610299",
                            "leaf": true
                        },
                        {
                            "text": "循化撒拉族自治县",
                            "id": "632128",
                            "lnglat": "10248330,3584835",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "海北藏族自治州",
                    "id": "632200",
                    "lnglat": "10103672,3693493",
                    "children": [
                        {
                            "text": "门源回族自治县",
                            "id": "632221",
                            "lnglat": "10161760,3737817",
                            "leaf": true
                        },
                        {
                            "text": "祁连县",
                            "id": "632222",
                            "lnglat": "10024230,3818006",
                            "leaf": true
                        },
                        {
                            "text": "海晏县",
                            "id": "632223",
                            "lnglat": "10099011,3690144",
                            "leaf": true
                        },
                        {
                            "text": "刚察县",
                            "id": "632224",
                            "lnglat": "10013393,3732786",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "海南藏族自治州",
                    "id": "632500",
                    "lnglat": "10067334,3629086",
                    "children": [
                        {
                            "text": "共和县",
                            "id": "632521",
                            "lnglat": "10061863,3627957",
                            "leaf": true
                        },
                        {
                            "text": "同德县",
                            "id": "632522",
                            "lnglat": "10057711,3525508",
                            "leaf": true
                        },
                        {
                            "text": "贵德县",
                            "id": "632523",
                            "lnglat": "10142779,3604611",
                            "leaf": true
                        },
                        {
                            "text": "兴海县",
                            "id": "632524",
                            "lnglat": "9998504,3559075",
                            "leaf": true
                        },
                        {
                            "text": "贵南县",
                            "id": "632525",
                            "lnglat": "10074674,3558734",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "果洛藏族自治州",
                    "id": "632600",
                    "lnglat": "10026419,3445331",
                    "children": [
                        {
                            "text": "玛沁县",
                            "id": "632621",
                            "lnglat": "10024230,3447839",
                            "leaf": true
                        },
                        {
                            "text": "班玛县",
                            "id": "632622",
                            "lnglat": "10073783,3293134",
                            "leaf": true
                        },
                        {
                            "text": "甘德县",
                            "id": "632623",
                            "lnglat": "9989912,3397048",
                            "leaf": true
                        },
                        {
                            "text": "达日县",
                            "id": "632624",
                            "lnglat": "9965149,3374865",
                            "leaf": true
                        },
                        {
                            "text": "久治县",
                            "id": "632625",
                            "lnglat": "10148554,3343188",
                            "leaf": true
                        },
                        {
                            "text": "玛多县",
                            "id": "632626",
                            "lnglat": "9818247,3491484",
                            "leaf": true
                        }
                    ]
                }
            ]
        },
        {
            "text": "甘肃省",
            "id": "620000",
            "lnglat": "10377926,3607967",
            "children": [
                {
                    "text": "兰州市",
                    "id": "620100",
                    "lnglat": "10377926,3607967",
                    "children": [
                        {
                            "text": "城关区",
                            "id": "620102",
                            "lnglat": "10377926,3607967",
                            "leaf": true
                        },
                        {
                            "text": "七里河区",
                            "id": "620103",
                            "lnglat": "10378380,3606618",
                            "leaf": true
                        },
                        {
                            "text": "西固区",
                            "id": "620104",
                            "lnglat": "10362581,3608879",
                            "leaf": true
                        },
                        {
                            "text": "安宁区",
                            "id": "620105",
                            "lnglat": "10371637,3610412",
                            "leaf": true
                        },
                        {
                            "text": "红古区",
                            "id": "620111",
                            "lnglat": "10285721,3634630",
                            "leaf": true
                        },
                        {
                            "text": "永登县",
                            "id": "620121",
                            "lnglat": "10326023,3673642",
                            "leaf": true
                        },
                        {
                            "text": "皋兰县",
                            "id": "620122",
                            "lnglat": "10393996,3633524",
                            "leaf": true
                        },
                        {
                            "text": "榆中县",
                            "id": "620123",
                            "lnglat": "10411838,3584598",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "张掖市",
                    "id": "620700",
                    "lnglat": "10044999,3893111",
                    "children": [
                        {
                            "text": "甘州区",
                            "id": "620702",
                            "lnglat": "10048179,3897356",
                            "leaf": true
                        },
                        {
                            "text": "肃南裕固族自治县",
                            "id": "620721",
                            "lnglat": "9961202,3883766",
                            "leaf": true
                        },
                        {
                            "text": "民乐县",
                            "id": "620722",
                            "lnglat": "10081029,3843415",
                            "leaf": true
                        },
                        {
                            "text": "临泽县",
                            "id": "620723",
                            "lnglat": "10016837,3913594",
                            "leaf": true
                        },
                        {
                            "text": "高台县",
                            "id": "620724",
                            "lnglat": "9980983,3937081",
                            "leaf": true
                        },
                        {
                            "text": "山丹县",
                            "id": "620725",
                            "lnglat": "10108891,3877927",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "武威市",
                    "id": "620600",
                    "lnglat": "10263599,3792800",
                    "children": [
                        {
                            "text": "凉州区",
                            "id": "620602",
                            "lnglat": "10270968,3779819",
                            "leaf": true
                        },
                        {
                            "text": "民勤县",
                            "id": "620621",
                            "lnglat": "10309709,3862478",
                            "leaf": true
                        },
                        {
                            "text": "古浪县",
                            "id": "620622",
                            "lnglat": "10289218,3746180",
                            "leaf": true
                        },
                        {
                            "text": "天祝藏族自治县",
                            "id": "620623",
                            "lnglat": "10313152,3698228",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "天水市",
                    "id": "620500",
                    "lnglat": "10571927,3458078",
                    "children": [
                        {
                            "text": "秦城区",
                            "id": "620502",
                            "lnglat": "10571875,3457998",
                            "leaf": true
                        },
                        {
                            "text": "北道区",
                            "id": "620503",
                            "lnglat": "10589468,3457083",
                            "leaf": true
                        },
                        {
                            "text": "清水县",
                            "id": "620521",
                            "lnglat": "10613347,3474995",
                            "leaf": true
                        },
                        {
                            "text": "秦安县",
                            "id": "620522",
                            "lnglat": "10566545,3486432",
                            "leaf": true
                        },
                        {
                            "text": "甘谷县",
                            "id": "620523",
                            "lnglat": "10532977,3473969",
                            "leaf": true
                        },
                        {
                            "text": "武山县",
                            "id": "620524",
                            "lnglat": "10488597,3472278",
                            "leaf": true
                        },
                        {
                            "text": "张家川回族自治县",
                            "id": "620525",
                            "lnglat": "10620796,3499565",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "庆阳市",
                    "id": "621000",
                    "lnglat": "10763826,3572999",
                    "children": [
                        {
                            "text": "西峰区",
                            "id": "621002",
                            "lnglat": "10767472,3564677",
                            "leaf": true
                        },
                        {
                            "text": "庆城县",
                            "id": "621021",
                            "lnglat": "10786492,3601735",
                            "leaf": true
                        },
                        {
                            "text": "环县",
                            "id": "621022",
                            "lnglat": "10730354,3657776",
                            "leaf": true
                        },
                        {
                            "text": "华池县",
                            "id": "621023",
                            "lnglat": "10798549,3646493",
                            "leaf": true
                        },
                        {
                            "text": "合水县",
                            "id": "621024",
                            "lnglat": "10801620,3581884",
                            "leaf": true
                        },
                        {
                            "text": "正宁县",
                            "id": "621025",
                            "lnglat": "10836077,3548946",
                            "leaf": true
                        },
                        {
                            "text": "宁县",
                            "id": "621026",
                            "lnglat": "10792329,3549840",
                            "leaf": true
                        },
                        {
                            "text": "镇原县",
                            "id": "621027",
                            "lnglat": "10720076,3567729",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "平凉市",
                    "id": "620800",
                    "lnglat": "10666920,3554409",
                    "children": [
                        {
                            "text": "崆峒区",
                            "id": "620802",
                            "lnglat": "10680943,3550761",
                            "leaf": true
                        },
                        {
                            "text": "泾川县",
                            "id": "620821",
                            "lnglat": "10736708,3533439",
                            "leaf": true
                        },
                        {
                            "text": "灵台县",
                            "id": "620822",
                            "lnglat": "10761265,3506867",
                            "leaf": true
                        },
                        {
                            "text": "崇信县",
                            "id": "620823",
                            "lnglat": "10701972,3530336",
                            "leaf": true
                        },
                        {
                            "text": "华亭县",
                            "id": "620824",
                            "lnglat": "10664839,3522292",
                            "leaf": true
                        },
                        {
                            "text": "庄浪县",
                            "id": "620825",
                            "lnglat": "10603856,3520377",
                            "leaf": true
                        },
                        {
                            "text": "静宁县",
                            "id": "620826",
                            "lnglat": "10572641,3552132",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "临夏回族自治州",
                    "id": "622900",
                    "lnglat": "10320986,3559653",
                    "children": [
                        {
                            "text": "临夏市",
                            "id": "622901",
                            "lnglat": "10320743,3560187",
                            "leaf": true
                        },
                        {
                            "text": "临夏县",
                            "id": "622921",
                            "lnglat": "10298957,3549358",
                            "leaf": true
                        },
                        {
                            "text": "康乐县",
                            "id": "622922",
                            "lnglat": "10370993,3537406",
                            "leaf": true
                        },
                        {
                            "text": "永靖县",
                            "id": "622923",
                            "lnglat": "10331423,3594405",
                            "leaf": true
                        },
                        {
                            "text": "广河县",
                            "id": "622924",
                            "lnglat": "10357034,3547784",
                            "leaf": true
                        },
                        {
                            "text": "和政县",
                            "id": "622925",
                            "lnglat": "10334576,3542606",
                            "leaf": true
                        },
                        {
                            "text": "东乡族自治县",
                            "id": "622926",
                            "lnglat": "10339163,3566572",
                            "leaf": true
                        },
                        {
                            "text": "积石山保安族东乡族撒拉族自治县",
                            "id": "622927",
                            "lnglat": "10289485,3571043",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "酒泉市",
                    "id": "620900",
                    "lnglat": "9850910,3973952",
                    "children": [
                        {
                            "text": "玉门市",
                            "id": "620981",
                            "lnglat": "9757450,3982669",
                            "leaf": true
                        },
                        {
                            "text": "肃州区",
                            "id": "620902",
                            "lnglat": "9882982,3956493",
                            "leaf": true
                        },
                        {
                            "text": "金塔县",
                            "id": "620921",
                            "lnglat": "9890310,3998161",
                            "leaf": true
                        },
                        {
                            "text": "瓜州县",
                            "id": "620922",
                            "lnglat": "9578156,4051192",
                            "leaf": true
                        },
                        {
                            "text": "肃北蒙古族自治县",
                            "id": "620923",
                            "lnglat": "9487186,3951027",
                            "leaf": true
                        },
                        {
                            "text": "阿克塞哈萨克族自治县",
                            "id": "620924",
                            "lnglat": "9426493,3940944",
                            "leaf": true
                        },
                        {
                            "text": "敦煌市",
                            "id": "620982",
                            "lnglat": "9466353,4013779",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "金昌市",
                    "id": "620300",
                    "lnglat": "10218582,3852000",
                    "children": [
                        {
                            "text": "金川区",
                            "id": "620302",
                            "lnglat": "10212835,3867739",
                            "leaf": true
                        },
                        {
                            "text": "永昌县",
                            "id": "620321",
                            "lnglat": "10196324,3824456",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "嘉峪关市",
                    "id": "620200",
                    "lnglat": "9826752,3979764",
                    "leaf": true
                },
                {
                    "text": "甘南藏族自治州",
                    "id": "623000",
                    "lnglat": "10290978,3498450",
                    "children": [
                        {
                            "text": "合作市",
                            "id": "623001",
                            "lnglat": "10290732,3497986",
                            "leaf": true
                        },
                        {
                            "text": "临潭县",
                            "id": "623021",
                            "lnglat": "10335503,3468756",
                            "leaf": true
                        },
                        {
                            "text": "卓尼县",
                            "id": "623022",
                            "lnglat": "10350917,3459242",
                            "leaf": true
                        },
                        {
                            "text": "舟曲县",
                            "id": "623023",
                            "lnglat": "10436503,3378827",
                            "leaf": true
                        },
                        {
                            "text": "迭部县",
                            "id": "623024",
                            "lnglat": "10320698,3405721",
                            "leaf": true
                        },
                        {
                            "text": "玛曲县",
                            "id": "623025",
                            "lnglat": "10207238,3399662",
                            "leaf": true
                        },
                        {
                            "text": "碌曲县",
                            "id": "623026",
                            "lnglat": "10249628,3458861",
                            "leaf": true
                        },
                        {
                            "text": "夏河县",
                            "id": "623027",
                            "lnglat": "10251843,3520517",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "定西市",
                    "id": "621100",
                    "lnglat": "10462139,3557928",
                    "children": [
                        {
                            "text": "安定区",
                            "id": "621102",
                            "lnglat": "10462729,3557880",
                            "leaf": true
                        },
                        {
                            "text": "通渭县",
                            "id": "621121",
                            "lnglat": "10524063,3520999",
                            "leaf": true
                        },
                        {
                            "text": "陇西县",
                            "id": "621122",
                            "lnglat": "10461968,3502546",
                            "leaf": true
                        },
                        {
                            "text": "渭源县",
                            "id": "621123",
                            "lnglat": "10421355,3514046",
                            "leaf": true
                        },
                        {
                            "text": "临洮县",
                            "id": "621124",
                            "lnglat": "10385622,3538626",
                            "leaf": true
                        },
                        {
                            "text": "漳县",
                            "id": "621125",
                            "lnglat": "10446462,3485248",
                            "leaf": true
                        },
                        {
                            "text": "岷县",
                            "id": "621126",
                            "lnglat": "10401984,3442801",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "成县市",
                    "lnglat": "10572608,3374145",
                    "leaf": true
                },
                {
                    "text": "白银市",
                    "id": "620400",
                    "lnglat": "10417050,3654591",
                    "children": [
                        {
                            "text": "白银区",
                            "id": "620402",
                            "lnglat": "10417017,3654383",
                            "leaf": true
                        },
                        {
                            "text": "平川区",
                            "id": "620403",
                            "lnglat": "10492556,3669893",
                            "leaf": true
                        },
                        {
                            "text": "靖远县",
                            "id": "620421",
                            "lnglat": "10468295,3655777",
                            "leaf": true
                        },
                        {
                            "text": "会宁县",
                            "id": "620422",
                            "lnglat": "10504626,3569604",
                            "leaf": true
                        },
                        {
                            "text": "景泰县",
                            "id": "620423",
                            "lnglat": "10406819,3715025",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "陇南市",
                    "id": "621200",
                    "lnglat": "10607975,3377247",
                    "children": [
                        {
                            "text": "武都区",
                            "id": "621202",
                            "lnglat": "10492472,3339391",
                            "leaf": true
                        },
                        {
                            "text": "成县",
                            "id": "621221",
                            "lnglat": "10572369,3374419",
                            "leaf": true
                        },
                        {
                            "text": "文县",
                            "id": "621222",
                            "lnglat": "10468078,3294749",
                            "leaf": true
                        },
                        {
                            "text": "宕昌县",
                            "id": "621223",
                            "lnglat": "10438835,3404523",
                            "leaf": true
                        },
                        {
                            "text": "康县",
                            "id": "621224",
                            "lnglat": "10560432,3333227",
                            "leaf": true
                        },
                        {
                            "text": "西和县",
                            "id": "621225",
                            "lnglat": "10529375,3401241",
                            "leaf": true
                        },
                        {
                            "text": "礼县",
                            "id": "621226",
                            "lnglat": "10517550,3419108",
                            "leaf": true
                        },
                        {
                            "text": "徽县",
                            "id": "621227",
                            "lnglat": "10608162,3377451",
                            "leaf": true
                        },
                        {
                            "text": "两当县",
                            "id": "621228",
                            "lnglat": "10630156,3391027",
                            "leaf": true
                        }
                    ]
                }
            ]
        },
        {
            "text": "新疆维吾尔自治区",
            "id": "650000",
            "lnglat": "8761988,4380553",
            "children": [
                {
                    "text": "乌鲁木齐市",
                    "id": "650100",
                    "lnglat": "8761988,4380553",
                    "children": [
                        {
                            "text": "天山区",
                            "id": "650102",
                            "lnglat": "8762871,4379285",
                            "leaf": true
                        },
                        {
                            "text": "沙依巴克区",
                            "id": "650103",
                            "lnglat": "8759436,4378738",
                            "leaf": true
                        },
                        {
                            "text": "新市区",
                            "id": "650104",
                            "lnglat": "8757110,4384222",
                            "leaf": true
                        },
                        {
                            "text": "水磨沟区",
                            "id": "650105",
                            "lnglat": "8762748,4378568",
                            "leaf": true
                        },
                        {
                            "text": "头屯河区",
                            "id": "650106",
                            "lnglat": "8728976,4385549",
                            "leaf": true
                        },
                        {
                            "text": "达坂城区",
                            "id": "650107",
                            "lnglat": "8830638,4335505",
                            "leaf": true
                        },
                        {
                            "text": "东山区",
                            "id": "650108",
                            "lnglat": "8763964,4390236",
                            "leaf": true
                        },
                        {
                            "text": "乌鲁木齐县",
                            "id": "650121",
                            "lnglat": "8757483,4378124",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "伊犁哈萨克自治州",
                    "id": "654000",
                    "lnglat": "8132064,4391605",
                    "children": [
                        {
                            "text": "伊宁市",
                            "id": "654002",
                            "lnglat": "8134199,4391745",
                            "leaf": true
                        },
                        {
                            "text": "奎屯市",
                            "id": "654003",
                            "lnglat": "8489056,4444160",
                            "leaf": true
                        },
                        {
                            "text": "伊宁县",
                            "id": "654021",
                            "lnglat": "8152470,4398984",
                            "leaf": true
                        },
                        {
                            "text": "察布查尔锡伯自治县",
                            "id": "654022",
                            "lnglat": "8114255,4384401",
                            "leaf": true
                        },
                        {
                            "text": "霍城县",
                            "id": "654023",
                            "lnglat": "8087703,4405238",
                            "leaf": true
                        },
                        {
                            "text": "巩留县",
                            "id": "654024",
                            "lnglat": "8221763,4348193",
                            "leaf": true
                        },
                        {
                            "text": "新源县",
                            "id": "654025",
                            "lnglat": "8325826,4345156",
                            "leaf": true
                        },
                        {
                            "text": "昭苏县",
                            "id": "654026",
                            "lnglat": "8112582,4316857",
                            "leaf": true
                        },
                        {
                            "text": "特克斯县",
                            "id": "654027",
                            "lnglat": "8183058,4321719",
                            "leaf": true
                        },
                        {
                            "text": "尼勒克县",
                            "id": "654028",
                            "lnglat": "8249314,4379110",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "吐鲁番地区",
                    "id": "652100",
                    "lnglat": "8917460,4294195",
                    "children": [
                        {
                            "text": "吐鲁番市",
                            "id": "652101",
                            "lnglat": "8914668,4294798",
                            "leaf": true
                        },
                        {
                            "text": "鄯善县",
                            "id": "652122",
                            "lnglat": "9020975,4286248",
                            "leaf": true
                        },
                        {
                            "text": "托克逊县",
                            "id": "652123",
                            "lnglat": "8865502,4279400",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "塔城地区",
                    "id": "654200",
                    "lnglat": "8297618,4674620",
                    "children": [
                        {
                            "text": "塔城市",
                            "id": "654201",
                            "lnglat": "8299346,4676167",
                            "leaf": true
                        },
                        {
                            "text": "乌苏市",
                            "id": "654202",
                            "lnglat": "8467754,4443670",
                            "leaf": true
                        },
                        {
                            "text": "额敏县",
                            "id": "654221",
                            "lnglat": "8362379,4653018",
                            "leaf": true
                        },
                        {
                            "text": "沙湾县",
                            "id": "654223",
                            "lnglat": "8561267,4432385",
                            "leaf": true
                        },
                        {
                            "text": "托里县",
                            "id": "654224",
                            "lnglat": "8360892,4593526",
                            "leaf": true
                        },
                        {
                            "text": "裕民县",
                            "id": "654225",
                            "lnglat": "8297233,4620913",
                            "leaf": true
                        },
                        {
                            "text": "和布克赛尔蒙古自治县",
                            "id": "654226",
                            "lnglat": "8572918,4679395",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "石河子市",
                    "id": "659001",
                    "lnglat": "8607728,4430433",
                    "leaf": true
                },
                {
                    "text": "克拉玛依市",
                    "id": "650200",
                    "lnglat": "8487199,4559896",
                    "children": [
                        {
                            "text": "独山子区",
                            "id": "650202",
                            "lnglat": "8482649,4432669",
                            "leaf": true
                        },
                        {
                            "text": "克拉玛依区",
                            "id": "650203",
                            "lnglat": "8487000,4559532",
                            "leaf": true
                        },
                        {
                            "text": "白碱滩区",
                            "id": "650204",
                            "lnglat": "8513564,4570042",
                            "leaf": true
                        },
                        {
                            "text": "乌尔禾区",
                            "id": "650205",
                            "lnglat": "8567339,4611212",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "喀什地区",
                    "id": "653100",
                    "lnglat": "7601240,3946725",
                    "children": [
                        {
                            "text": "喀什市",
                            "id": "653101",
                            "lnglat": "7598986,3947573",
                            "leaf": true
                        },
                        {
                            "text": "疏附县",
                            "id": "653121",
                            "lnglat": "7585721,3937890",
                            "leaf": true
                        },
                        {
                            "text": "疏勒县",
                            "id": "653122",
                            "lnglat": "7604740,3940658",
                            "leaf": true
                        },
                        {
                            "text": "英吉沙县",
                            "id": "653123",
                            "lnglat": "7616988,3893654",
                            "leaf": true
                        },
                        {
                            "text": "泽普县",
                            "id": "653124",
                            "lnglat": "7726006,3819389",
                            "leaf": true
                        },
                        {
                            "text": "莎车县",
                            "id": "653125",
                            "lnglat": "7726795,3841757",
                            "leaf": true
                        },
                        {
                            "text": "叶城县",
                            "id": "653126",
                            "lnglat": "7741520,3788739",
                            "leaf": true
                        },
                        {
                            "text": "麦盖提县",
                            "id": "653127",
                            "lnglat": "7764007,3890558",
                            "leaf": true
                        },
                        {
                            "text": "岳普湖县",
                            "id": "653128",
                            "lnglat": "7676806,3923472",
                            "leaf": true
                        },
                        {
                            "text": "伽师县",
                            "id": "653129",
                            "lnglat": "7674079,3949318",
                            "leaf": true
                        },
                        {
                            "text": "巴楚县",
                            "id": "653130",
                            "lnglat": "7856390,3979106",
                            "leaf": true
                        },
                        {
                            "text": "塔什库尔干塔吉克自治县",
                            "id": "653131",
                            "lnglat": "7577091,3698484",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "和田地区",
                    "id": "653200",
                    "lnglat": "7993520,3711061",
                    "children": [
                        {
                            "text": "和田市",
                            "id": "653201",
                            "lnglat": "7993425,3711646",
                            "leaf": true
                        },
                        {
                            "text": "和田县",
                            "id": "653221",
                            "lnglat": "7993500,3711362",
                            "leaf": true
                        },
                        {
                            "text": "墨玉县",
                            "id": "653222",
                            "lnglat": "7974619,3727531",
                            "leaf": true
                        },
                        {
                            "text": "皮山县",
                            "id": "653223",
                            "lnglat": "7828505,3762038",
                            "leaf": true
                        },
                        {
                            "text": "洛浦县",
                            "id": "653224",
                            "lnglat": "8018454,3707712",
                            "leaf": true
                        },
                        {
                            "text": "策勒县",
                            "id": "653225",
                            "lnglat": "8079804,3700496",
                            "leaf": true
                        },
                        {
                            "text": "于田县",
                            "id": "653226",
                            "lnglat": "8166611,3684870",
                            "leaf": true
                        },
                        {
                            "text": "民丰县",
                            "id": "653227",
                            "lnglat": "8268312,3706796",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "哈密地区",
                    "id": "652200",
                    "lnglat": "9351358,4282615",
                    "children": [
                        {
                            "text": "哈密市",
                            "id": "652201",
                            "lnglat": "9351532,4283836",
                            "leaf": true
                        },
                        {
                            "text": "巴里坤哈萨克自治县",
                            "id": "652222",
                            "lnglat": "9301058,4359736",
                            "leaf": true
                        },
                        {
                            "text": "伊吾县",
                            "id": "652223",
                            "lnglat": "9468933,4324983",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "昌吉回族自治州",
                    "id": "652300",
                    "lnglat": "8730239,4400900",
                    "children": [
                        {
                            "text": "昌吉市",
                            "id": "652301",
                            "lnglat": "8730425,4402772",
                            "leaf": true
                        },
                        {
                            "text": "阜康市",
                            "id": "652302",
                            "lnglat": "8797341,4415612",
                            "leaf": true
                        },
                        {
                            "text": "米泉市",
                            "id": "652303",
                            "lnglat": "8765997,4397240",
                            "leaf": true
                        },
                        {
                            "text": "呼图壁县",
                            "id": "652323",
                            "lnglat": "8689978,4418837",
                            "leaf": true
                        },
                        {
                            "text": "玛纳斯县",
                            "id": "652324",
                            "lnglat": "8622687,4430554",
                            "leaf": true
                        },
                        {
                            "text": "奇台县",
                            "id": "652325",
                            "lnglat": "8960082,4402685",
                            "leaf": true
                        },
                        {
                            "text": "吉木萨尔县",
                            "id": "652327",
                            "lnglat": "8916828,4400102",
                            "leaf": true
                        },
                        {
                            "text": "木垒哈萨克自治县",
                            "id": "652328",
                            "lnglat": "9028167,4382633",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "阿克苏地区",
                    "id": "652900",
                    "lnglat": "8027809,4116390",
                    "children": [
                        {
                            "text": "阿克苏市",
                            "id": "652901",
                            "lnglat": "8025753,4117393",
                            "leaf": true
                        },
                        {
                            "text": "温宿县",
                            "id": "652922",
                            "lnglat": "8024270,4127693",
                            "leaf": true
                        },
                        {
                            "text": "库车县",
                            "id": "652923",
                            "lnglat": "8293791,4171040",
                            "leaf": true
                        },
                        {
                            "text": "沙雅县",
                            "id": "652924",
                            "lnglat": "8278442,4121819",
                            "leaf": true
                        },
                        {
                            "text": "新和县",
                            "id": "652925",
                            "lnglat": "8260355,4155307",
                            "leaf": true
                        },
                        {
                            "text": "拜城县",
                            "id": "652926",
                            "lnglat": "8186592,4179929",
                            "leaf": true
                        },
                        {
                            "text": "乌什县",
                            "id": "652927",
                            "lnglat": "7923178,4121207",
                            "leaf": true
                        },
                        {
                            "text": "阿瓦提县",
                            "id": "652928",
                            "lnglat": "8037498,4064267",
                            "leaf": true
                        },
                        {
                            "text": "柯坪县",
                            "id": "652929",
                            "lnglat": "7904284,4050350",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "博尔塔拉蒙古自治州",
                    "id": "652700",
                    "lnglat": "8206015,4489577",
                    "children": [
                        {
                            "text": "博乐市",
                            "id": "652701",
                            "lnglat": "8207722,4490976",
                            "leaf": true
                        },
                        {
                            "text": "精河县",
                            "id": "652722",
                            "lnglat": "8289766,4460092",
                            "leaf": true
                        },
                        {
                            "text": "温泉县",
                            "id": "652723",
                            "lnglat": "8103374,4497480",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "巴音郭楞蒙古自治州",
                    "id": "652800",
                    "lnglat": "8615416,4176360",
                    "children": [
                        {
                            "text": "库尔勒市",
                            "id": "652801",
                            "lnglat": "8614737,4177328",
                            "leaf": true
                        },
                        {
                            "text": "轮台县",
                            "id": "652822",
                            "lnglat": "8425448,4177631",
                            "leaf": true
                        },
                        {
                            "text": "尉犁县",
                            "id": "652823",
                            "lnglat": "8626128,4133522",
                            "leaf": true
                        },
                        {
                            "text": "若羌县",
                            "id": "652824",
                            "lnglat": "8818089,3901354",
                            "leaf": true
                        },
                        {
                            "text": "且末县",
                            "id": "652825",
                            "lnglat": "8553184,3813737",
                            "leaf": true
                        },
                        {
                            "text": "焉耆回族自治县",
                            "id": "652826",
                            "lnglat": "8656648,4206245",
                            "leaf": true
                        },
                        {
                            "text": "和静县",
                            "id": "652827",
                            "lnglat": "8639735,4231847",
                            "leaf": true
                        },
                        {
                            "text": "和硕县",
                            "id": "652828",
                            "lnglat": "8686436,4225693",
                            "leaf": true
                        },
                        {
                            "text": "博湖县",
                            "id": "652829",
                            "lnglat": "8663193,4197866",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "克孜勒苏柯尔克孜自治州",
                    "id": "653000",
                    "lnglat": "7616521,3971826",
                    "children": [
                        {
                            "text": "阿图什市",
                            "id": "653001",
                            "lnglat": "7617548,3971811",
                            "leaf": true
                        },
                        {
                            "text": "阿克陶县",
                            "id": "653022",
                            "lnglat": "7594048,3914837",
                            "leaf": true
                        },
                        {
                            "text": "阿合奇县",
                            "id": "653023",
                            "lnglat": "7844994,4093772",
                            "leaf": true
                        },
                        {
                            "text": "乌恰县",
                            "id": "653024",
                            "lnglat": "7519450,3970315",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "阿勒泰地区",
                    "id": "654300",
                    "lnglat": "8809741,4784554",
                    "children": [
                        {
                            "text": "阿勒泰市",
                            "id": "654301",
                            "lnglat": "8813770,4785390",
                            "leaf": true
                        },
                        {
                            "text": "布尔津县",
                            "id": "654321",
                            "lnglat": "8685205,4770189",
                            "leaf": true
                        },
                        {
                            "text": "富蕴县",
                            "id": "654322",
                            "lnglat": "8951942,4699181",
                            "leaf": true
                        },
                        {
                            "text": "福海县",
                            "id": "654323",
                            "lnglat": "8749259,4710434",
                            "leaf": true
                        },
                        {
                            "text": "哈巴河县",
                            "id": "654324",
                            "lnglat": "8641745,4805892",
                            "leaf": true
                        },
                        {
                            "text": "青河县",
                            "id": "654325",
                            "lnglat": "9035328,4667128",
                            "leaf": true
                        },
                        {
                            "text": "吉木乃县",
                            "id": "654326",
                            "lnglat": "8587649,4743489",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "阿拉尔市",
                    "id": "659002",
                    "lnglat": "8204379,4048385",
                    "leaf": true
                },
                {
                    "text": "图木舒克市",
                    "id": "659003",
                    "lnglat": "7892873,3984668",
                    "leaf": true
                },
                {
                    "text": "五家渠市",
                    "id": "659004",
                    "lnglat": "8752819,4415756",
                    "leaf": true
                }
            ]
        },
        {
            "text": "重庆市",
            "id": "500000",
            "lnglat": "10655355,2956029",
            "children": [
                {
                    "text": "万州区",
                    "id": "500101",
                    "lnglat": "10837880,3084106",
                    "leaf": true
                },
                {
                    "text": "涪陵区",
                    "id": "500102",
                    "lnglat": "10738319,2971426",
                    "leaf": true
                },
                {
                    "text": "渝中区",
                    "id": "500103",
                    "lnglat": "10657667,2956136",
                    "leaf": true
                },
                {
                    "text": "大渡口区",
                    "id": "500104",
                    "lnglat": "10646698,2949363",
                    "leaf": true
                },
                {
                    "text": "江北区",
                    "id": "500105",
                    "lnglat": "10655825,2957808",
                    "leaf": true
                },
                {
                    "text": "沙坪坝区",
                    "id": "500106",
                    "lnglat": "10641351,2959449",
                    "leaf": true
                },
                {
                    "text": "九龙坡区",
                    "id": "500107",
                    "lnglat": "10654035,2951414",
                    "leaf": true
                },
                {
                    "text": "南岸区",
                    "id": "500108",
                    "lnglat": "10660926,2954601",
                    "leaf": true
                },
                {
                    "text": "北碚区",
                    "id": "500109",
                    "lnglat": "10643539,2982395",
                    "leaf": true
                },
                {
                    "text": "万盛区",
                    "id": "500110",
                    "lnglat": "10692084,2899034",
                    "leaf": true
                },
                {
                    "text": "双桥区",
                    "id": "500111",
                    "lnglat": "10576330,2949756",
                    "leaf": true
                },
                {
                    "text": "渝北区",
                    "id": "500112",
                    "lnglat": "10662139,2971951",
                    "leaf": true
                },
                {
                    "text": "巴南区",
                    "id": "500113",
                    "lnglat": "10650377,2935557",
                    "leaf": true
                },
                {
                    "text": "黔江区",
                    "id": "500114",
                    "lnglat": "10878891,2952774",
                    "leaf": true
                },
                {
                    "text": "长寿区",
                    "id": "500115",
                    "lnglat": "10705776,2982625",
                    "leaf": true
                },
                {
                    "text": "江津区",
                    "id": "500116",
                    "lnglat": "10625801,2926596",
                    "leaf": true
                },
                {
                    "text": "合川区",
                    "id": "500117",
                    "lnglat": "10626599,2999361",
                    "leaf": true
                },
                {
                    "text": "永川区",
                    "id": "500118",
                    "lnglat": "10589712,2935186",
                    "leaf": true
                },
                {
                    "text": "南川区",
                    "id": "500119",
                    "lnglat": "10711030,2916766",
                    "leaf": true
                },
                {
                    "text": "綦江县",
                    "id": "500222",
                    "lnglat": "10664645,2903098",
                    "leaf": true
                },
                {
                    "text": "潼南县",
                    "id": "500223",
                    "lnglat": "10582105,3017438",
                    "leaf": true
                },
                {
                    "text": "铜梁县",
                    "id": "500224",
                    "lnglat": "10605852,2985147",
                    "leaf": true
                },
                {
                    "text": "大足县",
                    "id": "500225",
                    "lnglat": "10570301,2970441",
                    "leaf": true
                },
                {
                    "text": "荣昌县",
                    "id": "500226",
                    "lnglat": "10562320,2939626",
                    "leaf": true
                },
                {
                    "text": "璧山县",
                    "id": "500227",
                    "lnglat": "10622396,2959728",
                    "leaf": true
                },
                {
                    "text": "梁平县",
                    "id": "500228",
                    "lnglat": "10778936,3065766",
                    "leaf": true
                },
                {
                    "text": "城口县",
                    "id": "500229",
                    "lnglat": "10866001,3194530",
                    "leaf": true
                },
                {
                    "text": "丰都县",
                    "id": "500230",
                    "lnglat": "10772836,2984180",
                    "leaf": true
                },
                {
                    "text": "垫江县",
                    "id": "500231",
                    "lnglat": "10735173,3033872",
                    "leaf": true
                },
                {
                    "text": "武隆县",
                    "id": "500232",
                    "lnglat": "10774117,2932291",
                    "leaf": true
                },
                {
                    "text": "忠县",
                    "id": "500233",
                    "lnglat": "10803036,3029288",
                    "leaf": true
                },
                {
                    "text": "开县",
                    "id": "500234",
                    "lnglat": "10841412,3118930",
                    "leaf": true
                },
                {
                    "text": "云阳县",
                    "id": "500235",
                    "lnglat": "10889542,3095731",
                    "leaf": true
                },
                {
                    "text": "奉节县",
                    "id": "500236",
                    "lnglat": "10953636,3106148",
                    "leaf": true
                },
                {
                    "text": "巫山县",
                    "id": "500237",
                    "lnglat": "10988373,3107691",
                    "leaf": true
                },
                {
                    "text": "巫溪县",
                    "id": "500238",
                    "lnglat": "10961480,3139396",
                    "leaf": true
                },
                {
                    "text": "石柱土家族自治县",
                    "id": "500240",
                    "lnglat": "10809137,3001022",
                    "leaf": true
                },
                {
                    "text": "秀山土家族苗族自治县",
                    "id": "500241",
                    "lnglat": "10897391,2846941",
                    "leaf": true
                },
                {
                    "text": "酉阳土家族苗族自治县",
                    "id": "500242",
                    "lnglat": "10874287,2884875",
                    "leaf": true
                },
                {
                    "text": "彭水苗族土家族自治县",
                    "id": "500243",
                    "lnglat": "10812752,2929334",
                    "leaf": true
                }
            ]
        },
        {
            "text": "四川省",
            "id": "510000",
            "lnglat": "10407043,3066431",
            "children": [
                {
                    "text": "成都市",
                    "id": "510100",
                    "lnglat": "10407043,3066431",
                    "children": [
                        {
                            "text": "锦江区",
                            "id": "510104",
                            "lnglat": "10407925,3066110",
                            "leaf": true
                        },
                        {
                            "text": "青羊区",
                            "id": "510105",
                            "lnglat": "10405994,3067721",
                            "leaf": true
                        },
                        {
                            "text": "金牛区",
                            "id": "510106",
                            "lnglat": "10402393,3070798",
                            "leaf": true
                        },
                        {
                            "text": "武侯区",
                            "id": "510107",
                            "lnglat": "10404171,3064477",
                            "leaf": true
                        },
                        {
                            "text": "成华区",
                            "id": "510108",
                            "lnglat": "10409086,3066204",
                            "leaf": true
                        },
                        {
                            "text": "龙泉驿区",
                            "id": "510112",
                            "lnglat": "10427235,3055905",
                            "leaf": true
                        },
                        {
                            "text": "青白江区",
                            "id": "510113",
                            "lnglat": "10424025,3087895",
                            "leaf": true
                        },
                        {
                            "text": "新都区",
                            "id": "510114",
                            "lnglat": "10415564,3082581",
                            "leaf": true
                        },
                        {
                            "text": "温江区",
                            "id": "510115",
                            "lnglat": "10381234,3075122",
                            "leaf": true
                        },
                        {
                            "text": "金堂县",
                            "id": "510121",
                            "lnglat": "10461642,3072078",
                            "leaf": true
                        },
                        {
                            "text": "双流县",
                            "id": "510122",
                            "lnglat": "10402914,3044930",
                            "leaf": true
                        },
                        {
                            "text": "郫县",
                            "id": "510124",
                            "lnglat": "10387896,3084244",
                            "leaf": true
                        },
                        {
                            "text": "大邑县",
                            "id": "510129",
                            "lnglat": "10339111,3062348",
                            "leaf": true
                        },
                        {
                            "text": "蒲江县",
                            "id": "510131",
                            "lnglat": "10349742,3021871",
                            "leaf": true
                        },
                        {
                            "text": "新津县",
                            "id": "510132",
                            "lnglat": "10381684,3042880",
                            "leaf": true
                        },
                        {
                            "text": "都江堰市",
                            "id": "510181",
                            "lnglat": "10361821,3099979",
                            "leaf": true
                        },
                        {
                            "text": "彭州市",
                            "id": "510182",
                            "lnglat": "10394059,3099020",
                            "leaf": true
                        },
                        {
                            "text": "邛崃市",
                            "id": "510183",
                            "lnglat": "10341292,3038170",
                            "leaf": true
                        },
                        {
                            "text": "崇州市",
                            "id": "510184",
                            "lnglat": "10346755,3069265",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "绵阳市",
                    "id": "510700",
                    "lnglat": "10476961,3147708",
                    "children": [
                        {
                            "text": "涪城区",
                            "id": "510703",
                            "lnglat": "10474514,3146802",
                            "leaf": true
                        },
                        {
                            "text": "游仙区",
                            "id": "510704",
                            "lnglat": "10475874,3146852",
                            "leaf": true
                        },
                        {
                            "text": "三台县",
                            "id": "510722",
                            "lnglat": "10508671,3109235",
                            "leaf": true
                        },
                        {
                            "text": "盐亭县",
                            "id": "510723",
                            "lnglat": "10538608,3122617",
                            "leaf": true
                        },
                        {
                            "text": "安县",
                            "id": "510724",
                            "lnglat": "10442125,3164894",
                            "leaf": true
                        },
                        {
                            "text": "梓潼县",
                            "id": "510725",
                            "lnglat": "10515679,3163854",
                            "leaf": true
                        },
                        {
                            "text": "北川羌族自治县",
                            "id": "510726",
                            "lnglat": "10423398,3195507",
                            "leaf": true
                        },
                        {
                            "text": "平武县",
                            "id": "510727",
                            "lnglat": "10452723,3241046",
                            "leaf": true
                        },
                        {
                            "text": "江油市",
                            "id": "510781",
                            "lnglat": "10473465,3177828",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "自贡市",
                    "id": "510300",
                    "lnglat": "10477335,2934572",
                    "children": [
                        {
                            "text": "自流井区",
                            "id": "510302",
                            "lnglat": "10476226,2935062",
                            "leaf": true
                        },
                        {
                            "text": "贡井区",
                            "id": "510303",
                            "lnglat": "10470754,2934663",
                            "leaf": true
                        },
                        {
                            "text": "大安区",
                            "id": "510304",
                            "lnglat": "10476719,2938259",
                            "leaf": true
                        },
                        {
                            "text": "沿滩区",
                            "id": "510311",
                            "lnglat": "10487169,2927564",
                            "leaf": true
                        },
                        {
                            "text": "荣县",
                            "id": "510321",
                            "lnglat": "10442656,2945777",
                            "leaf": true
                        },
                        {
                            "text": "富顺县",
                            "id": "510322",
                            "lnglat": "10499970,2918337",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "资阳市",
                    "id": "512000",
                    "lnglat": "10465642,3012419",
                    "children": [
                        {
                            "text": "雁江区",
                            "id": "512002",
                            "lnglat": "10464393,3012014",
                            "leaf": true
                        },
                        {
                            "text": "安岳县",
                            "id": "512021",
                            "lnglat": "10533463,3010562",
                            "leaf": true
                        },
                        {
                            "text": "乐至县",
                            "id": "512022",
                            "lnglat": "10501971,3028145",
                            "leaf": true
                        },
                        {
                            "text": "简阳市",
                            "id": "512081",
                            "lnglat": "10454987,3038887",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "宜宾市",
                    "id": "511500",
                    "lnglat": "10462066,2877188",
                    "children": [
                        {
                            "text": "翠屏区",
                            "id": "511502",
                            "lnglat": "10462336,2876767",
                            "leaf": true
                        },
                        {
                            "text": "宜宾县",
                            "id": "511521",
                            "lnglat": "10453299,2869441",
                            "leaf": true
                        },
                        {
                            "text": "南溪县",
                            "id": "511522",
                            "lnglat": "10497889,2884003",
                            "leaf": true
                        },
                        {
                            "text": "江安县",
                            "id": "511523",
                            "lnglat": "10506474,2873617",
                            "leaf": true
                        },
                        {
                            "text": "长宁县",
                            "id": "511524",
                            "lnglat": "10491736,2857529",
                            "leaf": true
                        },
                        {
                            "text": "高县",
                            "id": "511525",
                            "lnglat": "10456383,2839573",
                            "leaf": true
                        },
                        {
                            "text": "珙县",
                            "id": "511526",
                            "lnglat": "10478787,2838026",
                            "leaf": true
                        },
                        {
                            "text": "筠连县",
                            "id": "511527",
                            "lnglat": "10450987,2816833",
                            "leaf": true
                        },
                        {
                            "text": "兴文县",
                            "id": "511528",
                            "lnglat": "10522978,2830642",
                            "leaf": true
                        },
                        {
                            "text": "屏山县",
                            "id": "511529",
                            "lnglat": "10415907,2865314",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "雅安市",
                    "id": "511800",
                    "lnglat": "10300677,2998857",
                    "children": [
                        {
                            "text": "雨城区",
                            "id": "511802",
                            "lnglat": "10302738,3000728",
                            "leaf": true
                        },
                        {
                            "text": "名山县",
                            "id": "511821",
                            "lnglat": "10310605,3008686",
                            "leaf": true
                        },
                        {
                            "text": "荥经县",
                            "id": "511822",
                            "lnglat": "10282977,2980454",
                            "leaf": true
                        },
                        {
                            "text": "汉源县",
                            "id": "511823",
                            "lnglat": "10267934,2934787",
                            "leaf": true
                        },
                        {
                            "text": "石棉县",
                            "id": "511824",
                            "lnglat": "10236270,2923945",
                            "leaf": true
                        },
                        {
                            "text": "天全县",
                            "id": "511825",
                            "lnglat": "10275597,3006852",
                            "leaf": true
                        },
                        {
                            "text": "芦山县",
                            "id": "511826",
                            "lnglat": "10292261,3015842",
                            "leaf": true
                        },
                        {
                            "text": "宝兴县",
                            "id": "511827",
                            "lnglat": "10281299,3037291",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "遂宁市",
                    "id": "510900",
                    "lnglat": "10557484,3050645",
                    "children": [
                        {
                            "text": "船山区",
                            "id": "510903",
                            "lnglat": "10557749,3050265",
                            "leaf": true
                        },
                        {
                            "text": "安居区",
                            "id": "510904",
                            "leaf": true
                        },
                        {
                            "text": "蓬溪县",
                            "id": "510921",
                            "lnglat": "10570795,3077674",
                            "leaf": true
                        },
                        {
                            "text": "射洪县",
                            "id": "510922",
                            "lnglat": "10538537,3087330",
                            "leaf": true
                        },
                        {
                            "text": "大英县",
                            "id": "510923",
                            "lnglat": "10524747,3058575",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "攀枝花市",
                    "id": "510400",
                    "lnglat": "10171719,2658567",
                    "children": [
                        {
                            "text": "东区",
                            "id": "510402",
                            "lnglat": "10170937,2654615",
                            "leaf": true
                        },
                        {
                            "text": "西区",
                            "id": "510403",
                            "lnglat": "10160146,2660418",
                            "leaf": true
                        },
                        {
                            "text": "仁和区",
                            "id": "510411",
                            "lnglat": "10173847,2649786",
                            "leaf": true
                        },
                        {
                            "text": "米易县",
                            "id": "510421",
                            "lnglat": "10210898,2688992",
                            "leaf": true
                        },
                        {
                            "text": "盐边县",
                            "id": "510422",
                            "lnglat": "10150333,2689227",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "南充市",
                    "id": "511300",
                    "lnglat": "10607945,3079134",
                    "children": [
                        {
                            "text": "顺庆区",
                            "id": "511302",
                            "lnglat": "10608584,3079469",
                            "leaf": true
                        },
                        {
                            "text": "高坪区",
                            "id": "511303",
                            "lnglat": "10610310,3077444",
                            "leaf": true
                        },
                        {
                            "text": "嘉陵区",
                            "id": "511304",
                            "lnglat": "10605657,3076114",
                            "leaf": true
                        },
                        {
                            "text": "南部县",
                            "id": "511321",
                            "lnglat": "10606382,3135124",
                            "leaf": true
                        },
                        {
                            "text": "营山县",
                            "id": "511322",
                            "lnglat": "10656084,3107936",
                            "leaf": true
                        },
                        {
                            "text": "蓬安县",
                            "id": "511323",
                            "lnglat": "10639861,3103641",
                            "leaf": true
                        },
                        {
                            "text": "仪陇县",
                            "id": "511324",
                            "lnglat": "10639952,3151979",
                            "leaf": true
                        },
                        {
                            "text": "西充县",
                            "id": "511325",
                            "lnglat": "10588115,3099872",
                            "leaf": true
                        },
                        {
                            "text": "阆中市",
                            "id": "511381",
                            "lnglat": "10596654,3157818",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "内江市",
                    "id": "511000",
                    "lnglat": "10505530,2958249",
                    "children": [
                        {
                            "text": "市中区",
                            "id": "511002",
                            "lnglat": "10506451,2958962",
                            "leaf": true
                        },
                        {
                            "text": "东兴区",
                            "id": "511011",
                            "lnglat": "10507188,2959502",
                            "leaf": true
                        },
                        {
                            "text": "威远县",
                            "id": "511024",
                            "lnglat": "10466591,2953044",
                            "leaf": true
                        },
                        {
                            "text": "资中县",
                            "id": "511025",
                            "lnglat": "10484967,2977872",
                            "leaf": true
                        },
                        {
                            "text": "隆昌县",
                            "id": "511028",
                            "lnglat": "10528020,2934401",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "眉山市",
                    "id": "511400",
                    "lnglat": "10382987,3004490",
                    "children": [
                        {
                            "text": "东坡区",
                            "id": "511402",
                            "lnglat": "10383349,3004311",
                            "leaf": true
                        },
                        {
                            "text": "仁寿县",
                            "id": "511421",
                            "lnglat": "10414354,2999575",
                            "leaf": true
                        },
                        {
                            "text": "彭山县",
                            "id": "511422",
                            "lnglat": "10386888,3019706",
                            "leaf": true
                        },
                        {
                            "text": "洪雅县",
                            "id": "511423",
                            "lnglat": "10337203,2990887",
                            "leaf": true
                        },
                        {
                            "text": "丹棱县",
                            "id": "511424",
                            "lnglat": "10351470,3001961",
                            "leaf": true
                        },
                        {
                            "text": "青神县",
                            "id": "511425",
                            "lnglat": "10384874,2983478",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "泸州市",
                    "id": "510500",
                    "lnglat": "10543945,2889966",
                    "children": [
                        {
                            "text": "江阳区",
                            "id": "510502",
                            "lnglat": "10544569,2887760",
                            "leaf": true
                        },
                        {
                            "text": "纳溪区",
                            "id": "510503",
                            "lnglat": "10536956,2878061",
                            "leaf": true
                        },
                        {
                            "text": "龙马潭区",
                            "id": "510504",
                            "lnglat": "10544628,2888815",
                            "leaf": true
                        },
                        {
                            "text": "泸县",
                            "id": "510521",
                            "lnglat": "10537400,2915185",
                            "leaf": true
                        },
                        {
                            "text": "合江县",
                            "id": "510522",
                            "lnglat": "10583459,2880681",
                            "leaf": true
                        },
                        {
                            "text": "叙永县",
                            "id": "510524",
                            "lnglat": "10543435,2817120",
                            "leaf": true
                        },
                        {
                            "text": "古蔺县",
                            "id": "510525",
                            "lnglat": "10580741,2804309",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "凉山彝族自治州",
                    "id": "513400",
                    "lnglat": "10225738,2789231",
                    "children": [
                        {
                            "text": "西昌市",
                            "id": "513401",
                            "lnglat": "10226548,2790055",
                            "leaf": true
                        },
                        {
                            "text": "木里藏族自治县",
                            "id": "513422",
                            "lnglat": "10127641,2793431",
                            "leaf": true
                        },
                        {
                            "text": "盐源县",
                            "id": "513423",
                            "lnglat": "10150701,2742454",
                            "leaf": true
                        },
                        {
                            "text": "德昌县",
                            "id": "513424",
                            "lnglat": "10217690,2740795",
                            "leaf": true
                        },
                        {
                            "text": "会理县",
                            "id": "513425",
                            "lnglat": "10224564,2666479",
                            "leaf": true
                        },
                        {
                            "text": "会东县",
                            "id": "513426",
                            "lnglat": "10256787,2663713",
                            "leaf": true
                        },
                        {
                            "text": "宁南县",
                            "id": "513427",
                            "lnglat": "10275786,2707328",
                            "leaf": true
                        },
                        {
                            "text": "普格县",
                            "id": "513428",
                            "lnglat": "10254187,2738062",
                            "leaf": true
                        },
                        {
                            "text": "布拖县",
                            "id": "513429",
                            "lnglat": "10280645,2770390",
                            "leaf": true
                        },
                        {
                            "text": "金阳县",
                            "id": "513430",
                            "lnglat": "10324914,2770124",
                            "leaf": true
                        },
                        {
                            "text": "昭觉县",
                            "id": "513431",
                            "lnglat": "10284203,2801740",
                            "leaf": true
                        },
                        {
                            "text": "喜德县",
                            "id": "513432",
                            "lnglat": "10240428,2831584",
                            "leaf": true
                        },
                        {
                            "text": "冕宁县",
                            "id": "513433",
                            "lnglat": "10217017,2855410",
                            "leaf": true
                        },
                        {
                            "text": "越西县",
                            "id": "513434",
                            "lnglat": "10250820,2864465",
                            "leaf": true
                        },
                        {
                            "text": "甘洛县",
                            "id": "513435",
                            "lnglat": "10277432,2897474",
                            "leaf": true
                        },
                        {
                            "text": "美姑县",
                            "id": "513436",
                            "lnglat": "10312014,2833074",
                            "leaf": true
                        },
                        {
                            "text": "雷波县",
                            "id": "513437",
                            "lnglat": "10356803,2826535",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "乐山市",
                    "id": "511100",
                    "lnglat": "10378573,2955997",
                    "children": [
                        {
                            "text": "市中区",
                            "id": "511102",
                            "lnglat": "10378576,2956291",
                            "leaf": true
                        },
                        {
                            "text": "沙湾区",
                            "id": "511111",
                            "lnglat": "10354657,2941321",
                            "leaf": true
                        },
                        {
                            "text": "五通桥区",
                            "id": "511112",
                            "lnglat": "10381001,2939820",
                            "leaf": true
                        },
                        {
                            "text": "金口河区",
                            "id": "511113",
                            "lnglat": "10307601,2924699",
                            "leaf": true
                        },
                        {
                            "text": "犍为县",
                            "id": "511123",
                            "lnglat": "10394880,2920831",
                            "leaf": true
                        },
                        {
                            "text": "井研县",
                            "id": "511124",
                            "lnglat": "10407367,2965446",
                            "leaf": true
                        },
                        {
                            "text": "夹江县",
                            "id": "511126",
                            "lnglat": "10357072,2974182",
                            "leaf": true
                        },
                        {
                            "text": "沐川县",
                            "id": "511129",
                            "lnglat": "10389792,2896067",
                            "leaf": true
                        },
                        {
                            "text": "峨边彝族自治县",
                            "id": "511132",
                            "lnglat": "10326110,2923254",
                            "leaf": true
                        },
                        {
                            "text": "马边彝族自治县",
                            "id": "511133",
                            "lnglat": "10354980,2884646",
                            "leaf": true
                        },
                        {
                            "text": "峨眉山市",
                            "id": "511181",
                            "lnglat": "10348446,2960071",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "广安市",
                    "id": "511600",
                    "lnglat": "10662956,3045832",
                    "children": [
                        {
                            "text": "广安区",
                            "id": "511602",
                            "lnglat": "10663962,3047605",
                            "leaf": true
                        },
                        {
                            "text": "岳池县",
                            "id": "511621",
                            "lnglat": "10643737,3053582",
                            "leaf": true
                        },
                        {
                            "text": "武胜县",
                            "id": "511622",
                            "lnglat": "10628631,3035963",
                            "leaf": true
                        },
                        {
                            "text": "邻水县",
                            "id": "511623",
                            "lnglat": "10692558,3033981",
                            "leaf": true
                        },
                        {
                            "text": "华蓥市",
                            "id": "511681",
                            "lnglat": "10675601,3029834",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "甘孜藏族自治州",
                    "id": "513300",
                    "lnglat": "10196363,3005372",
                    "children": [
                        {
                            "text": "康定县",
                            "id": "513321",
                            "lnglat": "10195526,3005185",
                            "leaf": true
                        },
                        {
                            "text": "泸定县",
                            "id": "513322",
                            "lnglat": "10223465,2991630",
                            "leaf": true
                        },
                        {
                            "text": "丹巴县",
                            "id": "513323",
                            "lnglat": "10188075,3087710",
                            "leaf": true
                        },
                        {
                            "text": "九龙县",
                            "id": "513324",
                            "lnglat": "10151719,2901160",
                            "leaf": true
                        },
                        {
                            "text": "雅江县",
                            "id": "513325",
                            "lnglat": "10101040,3003377",
                            "leaf": true
                        },
                        {
                            "text": "道孚县",
                            "id": "513326",
                            "lnglat": "10111422,3098601",
                            "leaf": true
                        },
                        {
                            "text": "炉霍县",
                            "id": "513327",
                            "lnglat": "10067880,3139679",
                            "leaf": true
                        },
                        {
                            "text": "甘孜县",
                            "id": "513328",
                            "lnglat": "9999222,3162411",
                            "leaf": true
                        },
                        {
                            "text": "新龙县",
                            "id": "513329",
                            "lnglat": "10029535,3095152",
                            "leaf": true
                        },
                        {
                            "text": "德格县",
                            "id": "513330",
                            "lnglat": "9858098,3180431",
                            "leaf": true
                        },
                        {
                            "text": "白玉县",
                            "id": "513331",
                            "lnglat": "9882597,3121093",
                            "leaf": true
                        },
                        {
                            "text": "石渠县",
                            "id": "513332",
                            "lnglat": "9810182,3298377",
                            "leaf": true
                        },
                        {
                            "text": "色达县",
                            "id": "513333",
                            "lnglat": "10033049,3227177",
                            "leaf": true
                        },
                        {
                            "text": "理塘县",
                            "id": "513334",
                            "lnglat": "10026852,2999580",
                            "leaf": true
                        },
                        {
                            "text": "巴塘县",
                            "id": "513335",
                            "lnglat": "9910985,3000731",
                            "leaf": true
                        },
                        {
                            "text": "乡城县",
                            "id": "513336",
                            "lnglat": "9979923,2893310",
                            "leaf": true
                        },
                        {
                            "text": "稻城县",
                            "id": "513337",
                            "lnglat": "10029530,2903698",
                            "leaf": true
                        },
                        {
                            "text": "得荣县",
                            "id": "513338",
                            "lnglat": "9930985,2873978",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "德阳市",
                    "id": "510600",
                    "lnglat": "10439523,3112774",
                    "children": [
                        {
                            "text": "旌阳区",
                            "id": "510603",
                            "lnglat": "10438670,3113769",
                            "leaf": true
                        },
                        {
                            "text": "中江县",
                            "id": "510623",
                            "lnglat": "10469120,3103898",
                            "leaf": true
                        },
                        {
                            "text": "罗江县",
                            "id": "510626",
                            "lnglat": "10451535,3130281",
                            "leaf": true
                        },
                        {
                            "text": "广汉市",
                            "id": "510681",
                            "lnglat": "10427920,3098564",
                            "leaf": true
                        },
                        {
                            "text": "什邡市",
                            "id": "510682",
                            "lnglat": "10418369,3112141",
                            "leaf": true
                        },
                        {
                            "text": "绵竹市",
                            "id": "510683",
                            "lnglat": "10419761,3134744",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "达州市",
                    "id": "511700",
                    "lnglat": "10749528,3121460",
                    "children": [
                        {
                            "text": "通川区",
                            "id": "511702",
                            "lnglat": "10749267,3121443",
                            "leaf": true
                        },
                        {
                            "text": "达县",
                            "id": "511721",
                            "lnglat": "10758080,3105286",
                            "leaf": true
                        },
                        {
                            "text": "宣汉县",
                            "id": "511722",
                            "lnglat": "10771688,3135747",
                            "leaf": true
                        },
                        {
                            "text": "开江县",
                            "id": "511723",
                            "lnglat": "10786203,3108529",
                            "leaf": true
                        },
                        {
                            "text": "大竹县",
                            "id": "511724",
                            "lnglat": "10720517,3074128",
                            "leaf": true
                        },
                        {
                            "text": "渠县",
                            "id": "511725",
                            "lnglat": "10696642,3084151",
                            "leaf": true
                        },
                        {
                            "text": "万源市",
                            "id": "511781",
                            "lnglat": "10803603,3207337",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "巴中市",
                    "id": "511900",
                    "lnglat": "10675600,3185796",
                    "children": [
                        {
                            "text": "巴州区",
                            "id": "511902",
                            "lnglat": "10676193,3185118",
                            "leaf": true
                        },
                        {
                            "text": "通江县",
                            "id": "511921",
                            "lnglat": "10723912,3191527",
                            "leaf": true
                        },
                        {
                            "text": "南江县",
                            "id": "511922",
                            "lnglat": "10683584,3235536",
                            "leaf": true
                        },
                        {
                            "text": "平昌县",
                            "id": "511923",
                            "lnglat": "10709867,3156187",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "阿坝藏族羌族自治州",
                    "id": "513200",
                    "lnglat": "10222008,3190153",
                    "children": [
                        {
                            "text": "汶川县",
                            "id": "513221",
                            "lnglat": "10355808,3149156",
                            "leaf": true
                        },
                        {
                            "text": "理县",
                            "id": "513222",
                            "lnglat": "10317004,3144495",
                            "leaf": true
                        },
                        {
                            "text": "茂县",
                            "id": "513223",
                            "lnglat": "10385028,3168492",
                            "leaf": true
                        },
                        {
                            "text": "松潘县",
                            "id": "513224",
                            "lnglat": "10359716,3264224",
                            "leaf": true
                        },
                        {
                            "text": "九寨沟县",
                            "id": "513225",
                            "lnglat": "10423348,3326256",
                            "leaf": true
                        },
                        {
                            "text": "金川县",
                            "id": "513226",
                            "lnglat": "10206021,3147903",
                            "leaf": true
                        },
                        {
                            "text": "小金县",
                            "id": "513227",
                            "lnglat": "10236944,3099622",
                            "leaf": true
                        },
                        {
                            "text": "黑水县",
                            "id": "513228",
                            "lnglat": "10298645,3206806",
                            "leaf": true
                        },
                        {
                            "text": "马尔康县",
                            "id": "513229",
                            "lnglat": "10222637,3189821",
                            "leaf": true
                        },
                        {
                            "text": "壤塘县",
                            "id": "513230",
                            "lnglat": "10097694,3226924",
                            "leaf": true
                        },
                        {
                            "text": "阿坝县",
                            "id": "513231",
                            "lnglat": "10170186,3290624",
                            "leaf": true
                        },
                        {
                            "text": "若尔盖县",
                            "id": "513232",
                            "lnglat": "10296274,3357945",
                            "leaf": true
                        },
                        {
                            "text": "红原县",
                            "id": "513233",
                            "lnglat": "10254271,3279544",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "广元市",
                    "id": "510800",
                    "lnglat": "10581581,3244172",
                    "children": [
                        {
                            "text": "市中区",
                            "id": "510802",
                            "lnglat": "10584145,3243629",
                            "leaf": true
                        },
                        {
                            "text": "元坝区",
                            "id": "510811",
                            "lnglat": "10596290,3233086",
                            "leaf": true
                        },
                        {
                            "text": "朝天区",
                            "id": "510812",
                            "lnglat": "10588435,3264542",
                            "leaf": true
                        },
                        {
                            "text": "旺苍县",
                            "id": "510821",
                            "lnglat": "10628586,3222984",
                            "leaf": true
                        },
                        {
                            "text": "青川县",
                            "id": "510822",
                            "lnglat": "10523425,3258969",
                            "leaf": true
                        },
                        {
                            "text": "剑阁县",
                            "id": "510823",
                            "lnglat": "10545831,3203790",
                            "leaf": true
                        },
                        {
                            "text": "苍溪县",
                            "id": "510824",
                            "lnglat": "10592950,3173445",
                            "leaf": true
                        }
                    ]
                }
            ]
        },
        {
            "text": "云南省",
            "id": "530000",
            "lnglat": "10271037,2503736",
            "children": [
                {
                    "text": "昆明市",
                    "id": "530100",
                    "lnglat": "10271037,2503736",
                    "children": [
                        {
                            "text": "五华区",
                            "id": "530102",
                            "lnglat": "10270658,2503787",
                            "leaf": true
                        },
                        {
                            "text": "盘龙区",
                            "id": "530103",
                            "lnglat": "10273072,2505393",
                            "leaf": true
                        },
                        {
                            "text": "官渡区",
                            "id": "530111",
                            "lnglat": "10276790,2501296",
                            "leaf": true
                        },
                        {
                            "text": "西山区",
                            "id": "530112",
                            "lnglat": "10263773,2503238",
                            "leaf": true
                        },
                        {
                            "text": "东川区",
                            "id": "530113",
                            "lnglat": "10318252,2608045",
                            "leaf": true
                        },
                        {
                            "text": "呈贡县",
                            "id": "530121",
                            "lnglat": "10280040,2489587",
                            "leaf": true
                        },
                        {
                            "text": "晋宁县",
                            "id": "530122",
                            "lnglat": "10260407,2468436",
                            "leaf": true
                        },
                        {
                            "text": "富民县",
                            "id": "530124",
                            "lnglat": "10249465,2522583",
                            "leaf": true
                        },
                        {
                            "text": "宜良县",
                            "id": "530125",
                            "lnglat": "10314919,2491448",
                            "leaf": true
                        },
                        {
                            "text": "石林彝族自治县",
                            "id": "530126",
                            "lnglat": "10326473,2476159",
                            "leaf": true
                        },
                        {
                            "text": "嵩明县",
                            "id": "530127",
                            "lnglat": "10303586,2533867",
                            "leaf": true
                        },
                        {
                            "text": "禄劝彝族苗族自治县",
                            "id": "530128",
                            "lnglat": "10246352,2555493",
                            "leaf": true
                        },
                        {
                            "text": "寻甸回族彝族自治县",
                            "id": "530129",
                            "lnglat": "10325552,2556363",
                            "leaf": true
                        },
                        {
                            "text": "安宁市",
                            "id": "530181",
                            "lnglat": "10246732,2493034",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "昭通市",
                    "id": "530600",
                    "lnglat": "10371062,2733408",
                    "children": [
                        {
                            "text": "昭阳区",
                            "id": "530602",
                            "lnglat": "10353796,2738714",
                            "leaf": true
                        },
                        {
                            "text": "鲁甸县",
                            "id": "530621",
                            "lnglat": "10354167,2719447",
                            "leaf": true
                        },
                        {
                            "text": "巧家县",
                            "id": "530622",
                            "lnglat": "10292619,2691299",
                            "leaf": true
                        },
                        {
                            "text": "盐津县",
                            "id": "530623",
                            "lnglat": "10424041,2807433",
                            "leaf": true
                        },
                        {
                            "text": "大关县",
                            "id": "530624",
                            "lnglat": "10388787,2775331",
                            "leaf": true
                        },
                        {
                            "text": "永善县",
                            "id": "530625",
                            "lnglat": "10363480,2823312",
                            "leaf": true
                        },
                        {
                            "text": "绥江县",
                            "id": "530626",
                            "lnglat": "10394529,2859806",
                            "leaf": true
                        },
                        {
                            "text": "镇雄县",
                            "id": "530627",
                            "lnglat": "10487087,2744466",
                            "leaf": true
                        },
                        {
                            "text": "彝良县",
                            "id": "530628",
                            "lnglat": "10404495,2762801",
                            "leaf": true
                        },
                        {
                            "text": "威信县",
                            "id": "530629",
                            "lnglat": "10504278,2784930",
                            "leaf": true
                        },
                        {
                            "text": "水富县",
                            "id": "530630",
                            "lnglat": "10440864,2863327",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "玉溪市",
                    "id": "530400",
                    "lnglat": "10254419,2435733",
                    "children": [
                        {
                            "text": "红塔区",
                            "id": "530402",
                            "lnglat": "10249530,2434255",
                            "leaf": true
                        },
                        {
                            "text": "江川县",
                            "id": "530421",
                            "lnglat": "10275227,2429449",
                            "leaf": true
                        },
                        {
                            "text": "澄江县",
                            "id": "530422",
                            "lnglat": "10291566,2467451",
                            "leaf": true
                        },
                        {
                            "text": "通海县",
                            "id": "530423",
                            "lnglat": "10275778,2410837",
                            "leaf": true
                        },
                        {
                            "text": "华宁县",
                            "id": "530424",
                            "lnglat": "10292601,2419717",
                            "leaf": true
                        },
                        {
                            "text": "易门县",
                            "id": "530425",
                            "lnglat": "10216019,2467607",
                            "leaf": true
                        },
                        {
                            "text": "峨山彝族自治县",
                            "id": "530426",
                            "lnglat": "10240101,2417878",
                            "leaf": true
                        },
                        {
                            "text": "新平彝族傣族自治县",
                            "id": "530427",
                            "lnglat": "10198551,2407684",
                            "leaf": true
                        },
                        {
                            "text": "元江哈尼族彝族傣族自治县",
                            "id": "530428",
                            "lnglat": "10201269,2361144",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "西双版纳傣族自治州",
                    "id": "532800",
                    "lnglat": "10079784,2200887",
                    "children": [
                        {
                            "text": "景洪市",
                            "id": "532801",
                            "lnglat": "10078887,2201848",
                            "leaf": true
                        },
                        {
                            "text": "勐海县",
                            "id": "532822",
                            "lnglat": "10045094,2196345",
                            "leaf": true
                        },
                        {
                            "text": "勐腊县",
                            "id": "532823",
                            "lnglat": "10156342,2148189",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "文山壮族苗族自治州",
                    "id": "532600",
                    "lnglat": "10424233,2337497",
                    "children": [
                        {
                            "text": "文山县",
                            "id": "532621",
                            "lnglat": "10425160,2337201",
                            "leaf": true
                        },
                        {
                            "text": "砚山县",
                            "id": "532622",
                            "lnglat": "10433340,2361706",
                            "leaf": true
                        },
                        {
                            "text": "西畴县",
                            "id": "532623",
                            "lnglat": "10466874,2344383",
                            "leaf": true
                        },
                        {
                            "text": "麻栗坡县",
                            "id": "532624",
                            "lnglat": "10469870,2312613",
                            "leaf": true
                        },
                        {
                            "text": "马关县",
                            "id": "532625",
                            "lnglat": "10439630,2301533",
                            "leaf": true
                        },
                        {
                            "text": "丘北县",
                            "id": "532626",
                            "lnglat": "10419166,2404584",
                            "leaf": true
                        },
                        {
                            "text": "广南县",
                            "id": "532627",
                            "lnglat": "10506423,2405146",
                            "leaf": true
                        },
                        {
                            "text": "富宁县",
                            "id": "532628",
                            "lnglat": "10562063,2363254",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "普洱市",
                    "id": "530800",
                    "lnglat": "10096942,2278078",
                    "children": [
                        {
                            "text": "思茅区",
                            "id": "530802",
                            "lnglat": "10097591,2278990",
                            "leaf": true
                        },
                        {
                            "text": "宁洱哈尼族彝族自治县",
                            "id": "530821",
                            "lnglat": "10104545,2306284",
                            "leaf": true
                        },
                        {
                            "text": "墨江哈尼族自治县",
                            "id": "530822",
                            "lnglat": "10169158,2343653",
                            "leaf": true
                        },
                        {
                            "text": "景东彝族自治县",
                            "id": "530823",
                            "lnglat": "10082978,2445003",
                            "leaf": true
                        },
                        {
                            "text": "景谷傣族彝族自治县",
                            "id": "530824",
                            "lnglat": "10070444,2349974",
                            "leaf": true
                        },
                        {
                            "text": "镇沅彝族哈尼族拉祜族自治县",
                            "id": "530825",
                            "lnglat": "10094257,2396527",
                            "leaf": true
                        },
                        {
                            "text": "江城哈尼族彝族自治县",
                            "id": "530826",
                            "lnglat": "10185832,2258899",
                            "leaf": true
                        },
                        {
                            "text": "孟连傣族拉祜族佤族自治县",
                            "id": "530827",
                            "lnglat": "9945714,2231315",
                            "leaf": true
                        },
                        {
                            "text": "澜沧拉祜族自治县",
                            "id": "530828",
                            "lnglat": "9993179,2256274",
                            "leaf": true
                        },
                        {
                            "text": "西盟佤族自治县",
                            "id": "530829",
                            "lnglat": "9945659,2273728",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "曲靖市",
                    "id": "530300",
                    "lnglat": "10379677,2550314",
                    "children": [
                        {
                            "text": "麒麟区",
                            "id": "530302",
                            "lnglat": "10393517,2535039",
                            "leaf": true
                        },
                        {
                            "text": "马龙县",
                            "id": "530321",
                            "lnglat": "10357682,2542913",
                            "leaf": true
                        },
                        {
                            "text": "陆良县",
                            "id": "530322",
                            "lnglat": "10366140,2503403",
                            "leaf": true
                        },
                        {
                            "text": "师宗县",
                            "id": "530323",
                            "lnglat": "10398761,2483301",
                            "leaf": true
                        },
                        {
                            "text": "罗平县",
                            "id": "530324",
                            "lnglat": "10430935,2488822",
                            "leaf": true
                        },
                        {
                            "text": "富源县",
                            "id": "530325",
                            "lnglat": "10425131,2567772",
                            "leaf": true
                        },
                        {
                            "text": "会泽县",
                            "id": "530326",
                            "lnglat": "10329461,2641720",
                            "leaf": true
                        },
                        {
                            "text": "沾益县",
                            "id": "530328",
                            "lnglat": "10382009,2560518",
                            "leaf": true
                        },
                        {
                            "text": "宣威市",
                            "id": "530381",
                            "lnglat": "10410185,2622389",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "怒江傈僳族自治州",
                    "id": "533300",
                    "lnglat": "9885266,2585594",
                    "children": [
                        {
                            "text": "泸水县",
                            "id": "533321",
                            "lnglat": "9881993,2598562",
                            "leaf": true
                        },
                        {
                            "text": "福贡县",
                            "id": "533323",
                            "lnglat": "9886904,2690629",
                            "leaf": true
                        },
                        {
                            "text": "贡山独龙族怒族自治县",
                            "id": "533324",
                            "lnglat": "9866399,2774635",
                            "leaf": true
                        },
                        {
                            "text": "兰坪白族普米族自治县",
                            "id": "533325",
                            "lnglat": "9941912,2645584",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "临沧市",
                    "id": "530900",
                    "lnglat": "10008709,2388279",
                    "children": [
                        {
                            "text": "临翔区",
                            "id": "530902",
                            "lnglat": "10012259,2389833",
                            "leaf": true
                        },
                        {
                            "text": "凤庆县",
                            "id": "530921",
                            "lnglat": "9990833,2459661",
                            "leaf": true
                        },
                        {
                            "text": "云县",
                            "id": "530922",
                            "lnglat": "10012848,2444764",
                            "leaf": true
                        },
                        {
                            "text": "永德县",
                            "id": "530923",
                            "lnglat": "9924984,2403329",
                            "leaf": true
                        },
                        {
                            "text": "镇康县",
                            "id": "530924",
                            "lnglat": "9902563,2388700",
                            "leaf": true
                        },
                        {
                            "text": "双江拉祜族佤族布朗族傣族自治县",
                            "id": "530925",
                            "lnglat": "9987190,2350569",
                            "leaf": true
                        },
                        {
                            "text": "耿马傣族佤族自治县",
                            "id": "530926",
                            "lnglat": "9940004,2354189",
                            "leaf": true
                        },
                        {
                            "text": "沧源佤族自治县",
                            "id": "530927",
                            "lnglat": "9925164,2315674",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "丽江市",
                    "id": "530700",
                    "lnglat": "10023143,2687910",
                    "children": [
                        {
                            "text": "古城区",
                            "id": "530702",
                            "lnglat": "10022465,2688067",
                            "leaf": true
                        },
                        {
                            "text": "玉龙纳西族自治县",
                            "id": "530721",
                            "lnglat": "10023236,2687351",
                            "leaf": true
                        },
                        {
                            "text": "永胜县",
                            "id": "530722",
                            "lnglat": "10074818,2669059",
                            "leaf": true
                        },
                        {
                            "text": "华坪县",
                            "id": "530723",
                            "lnglat": "10126506,2663213",
                            "leaf": true
                        },
                        {
                            "text": "宁蒗彝族自治县",
                            "id": "530724",
                            "lnglat": "10085250,2728699",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "红河哈尼族彝族自治州",
                    "id": "532500",
                    "lnglat": "10338423,2336901",
                    "children": [
                        {
                            "text": "个旧市",
                            "id": "532501",
                            "lnglat": "10316233,2336954",
                            "leaf": true
                        },
                        {
                            "text": "开远市",
                            "id": "532502",
                            "lnglat": "10323641,2371800",
                            "leaf": true
                        },
                        {
                            "text": "蒙自县",
                            "id": "532522",
                            "lnglat": "10339608,2337390",
                            "leaf": true
                        },
                        {
                            "text": "屏边苗族自治县",
                            "id": "532523",
                            "lnglat": "10368439,2298762",
                            "leaf": true
                        },
                        {
                            "text": "建水县",
                            "id": "532524",
                            "lnglat": "10282555,2362447",
                            "leaf": true
                        },
                        {
                            "text": "石屏县",
                            "id": "532525",
                            "lnglat": "10248839,2371802",
                            "leaf": true
                        },
                        {
                            "text": "弥勒县",
                            "id": "532526",
                            "lnglat": "10344396,2441037",
                            "leaf": true
                        },
                        {
                            "text": "泸西县",
                            "id": "532527",
                            "lnglat": "10376394,2453077",
                            "leaf": true
                        },
                        {
                            "text": "元阳县",
                            "id": "532528",
                            "lnglat": "10274238,2316460",
                            "leaf": true
                        },
                        {
                            "text": "红河县",
                            "id": "532529",
                            "lnglat": "10242098,2337446",
                            "leaf": true
                        },
                        {
                            "text": "金平苗族瑶族傣族自治县",
                            "id": "532530",
                            "lnglat": "10308123,2276027",
                            "leaf": true
                        },
                        {
                            "text": "绿春县",
                            "id": "532531",
                            "lnglat": "10239472,2299838",
                            "leaf": true
                        },
                        {
                            "text": "河口瑶族自治县",
                            "id": "532532",
                            "lnglat": "10396117,2251292",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "迪庆藏族自治州",
                    "id": "533400",
                    "lnglat": "9970384,2782186",
                    "children": [
                        {
                            "text": "香格里拉县",
                            "id": "533421",
                            "lnglat": "9970411,2781399",
                            "leaf": true
                        },
                        {
                            "text": "德钦县",
                            "id": "533422",
                            "lnglat": "9890949,2849115",
                            "leaf": true
                        },
                        {
                            "text": "维西傈僳族自治县",
                            "id": "533423",
                            "lnglat": "9928085,2718461",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "大理白族自治州",
                    "id": "532900",
                    "lnglat": "10022252,2559422",
                    "children": [
                        {
                            "text": "大理市",
                            "id": "532901",
                            "lnglat": "10021962,2559383",
                            "leaf": true
                        },
                        {
                            "text": "漾濞彝族自治县",
                            "id": "532922",
                            "lnglat": "9995227,2566803",
                            "leaf": true
                        },
                        {
                            "text": "祥云县",
                            "id": "532923",
                            "lnglat": "10055372,2548136",
                            "leaf": true
                        },
                        {
                            "text": "宾川县",
                            "id": "532924",
                            "lnglat": "10057380,2583962",
                            "leaf": true
                        },
                        {
                            "text": "弥渡县",
                            "id": "532925",
                            "lnglat": "10048775,2534972",
                            "leaf": true
                        },
                        {
                            "text": "南涧彝族自治县",
                            "id": "532926",
                            "lnglat": "10052495,2505233",
                            "leaf": true
                        },
                        {
                            "text": "巍山彝族回族自治县",
                            "id": "532927",
                            "lnglat": "10031063,2523170",
                            "leaf": true
                        },
                        {
                            "text": "永平县",
                            "id": "532928",
                            "lnglat": "9952007,2546656",
                            "leaf": true
                        },
                        {
                            "text": "云龙县",
                            "id": "532929",
                            "lnglat": "9937104,2588869",
                            "leaf": true
                        },
                        {
                            "text": "洱源县",
                            "id": "532930",
                            "lnglat": "9994620,2611341",
                            "leaf": true
                        },
                        {
                            "text": "剑川县",
                            "id": "532931",
                            "lnglat": "9990245,2653471",
                            "leaf": true
                        },
                        {
                            "text": "鹤庆县",
                            "id": "532932",
                            "lnglat": "10017340,2656420",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "楚雄彝族自治州",
                    "id": "532300",
                    "lnglat": "10154456,2503612",
                    "children": [
                        {
                            "text": "楚雄市",
                            "id": "532301",
                            "lnglat": "10153932,2503436",
                            "leaf": true
                        },
                        {
                            "text": "双柏县",
                            "id": "532322",
                            "lnglat": "10163680,2469280",
                            "leaf": true
                        },
                        {
                            "text": "牟定县",
                            "id": "532323",
                            "lnglat": "10153846,2531836",
                            "leaf": true
                        },
                        {
                            "text": "南华县",
                            "id": "532324",
                            "lnglat": "10127348,2519470",
                            "leaf": true
                        },
                        {
                            "text": "姚安县",
                            "id": "532325",
                            "lnglat": "10123879,2551350",
                            "leaf": true
                        },
                        {
                            "text": "大姚县",
                            "id": "532326",
                            "lnglat": "10131828,2572645",
                            "leaf": true
                        },
                        {
                            "text": "永仁县",
                            "id": "532327",
                            "lnglat": "10166703,2605987",
                            "leaf": true
                        },
                        {
                            "text": "元谋县",
                            "id": "532328",
                            "lnglat": "10187591,2570290",
                            "leaf": true
                        },
                        {
                            "text": "武定县",
                            "id": "532329",
                            "lnglat": "10239993,2553428",
                            "leaf": true
                        },
                        {
                            "text": "禄丰县",
                            "id": "532331",
                            "lnglat": "10207775,2515084",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "保山市",
                    "id": "530500",
                    "lnglat": "9916248,2511575",
                    "children": [
                        {
                            "text": "隆阳区",
                            "id": "530502",
                            "lnglat": "9910979,2520987",
                            "leaf": true
                        },
                        {
                            "text": "施甸县",
                            "id": "530521",
                            "lnglat": "9917213,2472290",
                            "leaf": true
                        },
                        {
                            "text": "腾冲县",
                            "id": "530522",
                            "lnglat": "9849033,2502809",
                            "leaf": true
                        },
                        {
                            "text": "龙陵县",
                            "id": "530523",
                            "lnglat": "9869129,2458904",
                            "leaf": true
                        },
                        {
                            "text": "昌宁县",
                            "id": "530524",
                            "lnglat": "9960459,2482982",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "德宏傣族景颇族自治州",
                    "id": "533100",
                    "lnglat": "9854238,2444558",
                    "children": [
                        {
                            "text": "瑞丽市",
                            "id": "533102",
                            "lnglat": "9784540,2401712",
                            "leaf": true
                        },
                        {
                            "text": "潞西市",
                            "id": "533103",
                            "lnglat": "9858672,2444340",
                            "leaf": true
                        },
                        {
                            "text": "梁河县",
                            "id": "533122",
                            "lnglat": "9829632,2480878",
                            "leaf": true
                        },
                        {
                            "text": "盈江县",
                            "id": "533123",
                            "lnglat": "9793256,2470730",
                            "leaf": true
                        },
                        {
                            "text": "陇川县",
                            "id": "533124",
                            "lnglat": "9795892,2436076",
                            "leaf": true
                        }
                    ]
                }
            ]
        },
        {
            "text": "西藏自治区",
            "id": "540000",
            "lnglat": "9112836,2967571",
            "children": [
                {
                    "text": "拉萨市",
                    "id": "540100",
                    "lnglat": "9112836,2967571",
                    "children": [
                        {
                            "text": "城关区",
                            "id": "540102",
                            "lnglat": "9115641,2965780",
                            "leaf": true
                        },
                        {
                            "text": "林周县",
                            "id": "540121",
                            "lnglat": "9125782,2987658",
                            "leaf": true
                        },
                        {
                            "text": "当雄县",
                            "id": "540122",
                            "lnglat": "9108428,3048092",
                            "leaf": true
                        },
                        {
                            "text": "尼木县",
                            "id": "540123",
                            "lnglat": "9016560,2943295",
                            "leaf": true
                        },
                        {
                            "text": "曲水县",
                            "id": "540124",
                            "lnglat": "9072820,2936050",
                            "leaf": true
                        },
                        {
                            "text": "堆龙德庆县",
                            "id": "540125",
                            "lnglat": "9100924,2967879",
                            "leaf": true
                        },
                        {
                            "text": "达孜县",
                            "id": "540126",
                            "lnglat": "9135432,2967425",
                            "leaf": true
                        },
                        {
                            "text": "墨竹工卡县",
                            "id": "540127",
                            "lnglat": "9172511,2983517",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "山南地区",
                    "id": "542200",
                    "lnglat": "9183258,2921562",
                    "children": [
                        {
                            "text": "乃东县",
                            "id": "542221",
                            "lnglat": "9177632,2922981",
                            "leaf": true
                        },
                        {
                            "text": "扎囊县",
                            "id": "542222",
                            "lnglat": "9133401,2924130",
                            "leaf": true
                        },
                        {
                            "text": "贡嘎县",
                            "id": "542223",
                            "lnglat": "9098427,2929448",
                            "leaf": true
                        },
                        {
                            "text": "桑日县",
                            "id": "542224",
                            "lnglat": "9201231,2926216",
                            "leaf": true
                        },
                        {
                            "text": "琼结县",
                            "id": "542225",
                            "lnglat": "9167878,2902957",
                            "leaf": true
                        },
                        {
                            "text": "曲松县",
                            "id": "542226",
                            "lnglat": "9219977,2906644",
                            "leaf": true
                        },
                        {
                            "text": "措美县",
                            "id": "542227",
                            "lnglat": "9143419,2844516",
                            "leaf": true
                        },
                        {
                            "text": "洛扎县",
                            "id": "542228",
                            "lnglat": "9086126,2838760",
                            "leaf": true
                        },
                        {
                            "text": "加查县",
                            "id": "542229",
                            "lnglat": "9257989,2914246",
                            "leaf": true
                        },
                        {
                            "text": "隆子县",
                            "id": "542231",
                            "lnglat": "9246270,2841494",
                            "leaf": true
                        },
                        {
                            "text": "错那县",
                            "id": "542232",
                            "lnglat": "9197064,2798592",
                            "leaf": true
                        },
                        {
                            "text": "浪卡子县",
                            "id": "542233",
                            "lnglat": "9039449,2897324",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "日喀则地区",
                    "id": "542300",
                    "lnglat": "8888501,2927307",
                    "children": [
                        {
                            "text": "日喀则市",
                            "id": "542301",
                            "lnglat": "8887425,2927503",
                            "leaf": true
                        },
                        {
                            "text": "南木林县",
                            "id": "542322",
                            "lnglat": "8909367,2968575",
                            "leaf": true
                        },
                        {
                            "text": "江孜县",
                            "id": "542323",
                            "lnglat": "8959350,2892554",
                            "leaf": true
                        },
                        {
                            "text": "定日县",
                            "id": "542324",
                            "lnglat": "8711822,2866465",
                            "leaf": true
                        },
                        {
                            "text": "萨迦县",
                            "id": "542325",
                            "lnglat": "8801944,2890994",
                            "leaf": true
                        },
                        {
                            "text": "拉孜县",
                            "id": "542326",
                            "lnglat": "8763579,2910030",
                            "leaf": true
                        },
                        {
                            "text": "昂仁县",
                            "id": "542327",
                            "lnglat": "8724447,2929389",
                            "leaf": true
                        },
                        {
                            "text": "谢通门县",
                            "id": "542328",
                            "lnglat": "8825963,2943341",
                            "leaf": true
                        },
                        {
                            "text": "白朗县",
                            "id": "542329",
                            "lnglat": "8925967,2910446",
                            "leaf": true
                        },
                        {
                            "text": "仁布县",
                            "id": "542330",
                            "lnglat": "8983939,2923415",
                            "leaf": true
                        },
                        {
                            "text": "康马县",
                            "id": "542331",
                            "lnglat": "8968372,2855929",
                            "leaf": true
                        },
                        {
                            "text": "定结县",
                            "id": "542332",
                            "lnglat": "8776803,2836865",
                            "leaf": true
                        },
                        {
                            "text": "仲巴县",
                            "id": "542333",
                            "lnglat": "8418031,2965179",
                            "leaf": true
                        },
                        {
                            "text": "亚东县",
                            "id": "542334",
                            "lnglat": "8891020,2748824",
                            "leaf": true
                        },
                        {
                            "text": "吉隆县",
                            "id": "542335",
                            "lnglat": "8529797,2885357",
                            "leaf": true
                        },
                        {
                            "text": "聂拉木县",
                            "id": "542336",
                            "lnglat": "8597702,2815860",
                            "leaf": true
                        },
                        {
                            "text": "萨嘎县",
                            "id": "542337",
                            "lnglat": "8523205,2933010",
                            "leaf": true
                        },
                        {
                            "text": "岗巴县",
                            "id": "542338",
                            "lnglat": "8852008,2827790",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "那曲地区",
                    "id": "542400",
                    "lnglat": "9205302,3147795",
                    "children": [
                        {
                            "text": "那曲县",
                            "id": "542421",
                            "lnglat": "9206572,3148091",
                            "leaf": true
                        },
                        {
                            "text": "嘉黎县",
                            "id": "542422",
                            "lnglat": "9350206,3060221",
                            "leaf": true
                        },
                        {
                            "text": "比如县",
                            "id": "542423",
                            "lnglat": "9340537,3146971",
                            "leaf": true
                        },
                        {
                            "text": "聂荣县",
                            "id": "542424",
                            "lnglat": "9229437,3211437",
                            "leaf": true
                        },
                        {
                            "text": "安多县",
                            "id": "542425",
                            "lnglat": "9167686,3226092",
                            "leaf": true
                        },
                        {
                            "text": "申扎县",
                            "id": "542426",
                            "lnglat": "8870637,3093233",
                            "leaf": true
                        },
                        {
                            "text": "索县",
                            "id": "542427",
                            "lnglat": "9426326,3153589",
                            "leaf": true
                        },
                        {
                            "text": "班戈县",
                            "id": "542428",
                            "lnglat": "9001658,3136590",
                            "leaf": true
                        },
                        {
                            "text": "巴青县",
                            "id": "542429",
                            "lnglat": "9396201,3220577",
                            "leaf": true
                        },
                        {
                            "text": "尼玛县",
                            "id": "542430",
                            "lnglat": "8788728,3190505",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "林芝地区",
                    "id": "542600",
                    "lnglat": "9435819,2965172",
                    "children": [
                        {
                            "text": "林芝县",
                            "id": "542621",
                            "lnglat": "9448106,2957867",
                            "leaf": true
                        },
                        {
                            "text": "工布江达县",
                            "id": "542622",
                            "lnglat": "9323996,2989069",
                            "leaf": true
                        },
                        {
                            "text": "米林县",
                            "id": "542623",
                            "lnglat": "9421083,2921691",
                            "leaf": true
                        },
                        {
                            "text": "墨脱县",
                            "id": "542624",
                            "lnglat": "9533244,2932729",
                            "leaf": true
                        },
                        {
                            "text": "波密县",
                            "id": "542625",
                            "lnglat": "9577716,2986247",
                            "leaf": true
                        },
                        {
                            "text": "察隅县",
                            "id": "542626",
                            "lnglat": "9746702,2866567",
                            "leaf": true
                        },
                        {
                            "text": "朗县",
                            "id": "542627",
                            "lnglat": "9307543,2904385",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "昌都地区",
                    "id": "542100",
                    "lnglat": "9717947,3114040",
                    "children": [
                        {
                            "text": "昌都县",
                            "id": "542121",
                            "lnglat": "9716806,3114233",
                            "leaf": true
                        },
                        {
                            "text": "江达县",
                            "id": "542122",
                            "lnglat": "9821635,3150635",
                            "leaf": true
                        },
                        {
                            "text": "贡觉县",
                            "id": "542123",
                            "lnglat": "9826921,3086652",
                            "leaf": true
                        },
                        {
                            "text": "类乌齐县",
                            "id": "542124",
                            "lnglat": "9660578,3122024",
                            "leaf": true
                        },
                        {
                            "text": "丁青县",
                            "id": "542125",
                            "lnglat": "9560106,3143021",
                            "leaf": true
                        },
                        {
                            "text": "察雅县",
                            "id": "542126",
                            "lnglat": "9756452,3066262",
                            "leaf": true
                        },
                        {
                            "text": "八宿县",
                            "id": "542127",
                            "lnglat": "9691717,3005530",
                            "leaf": true
                        },
                        {
                            "text": "左贡县",
                            "id": "542128",
                            "lnglat": "9784146,2967553",
                            "leaf": true
                        },
                        {
                            "text": "芒康县",
                            "id": "542129",
                            "lnglat": "9859395,2969420",
                            "leaf": true
                        },
                        {
                            "text": "洛隆县",
                            "id": "542132",
                            "lnglat": "9582674,3074415",
                            "leaf": true
                        },
                        {
                            "text": "边坝县",
                            "id": "542133",
                            "lnglat": "9470429,3093785",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "阿里地区",
                    "id": "542500",
                    "lnglat": "8015248,3254020",
                    "children": [
                        {
                            "text": "普兰县",
                            "id": "542521",
                            "lnglat": "8117589,3030246",
                            "leaf": true
                        },
                        {
                            "text": "札达县",
                            "id": "542522",
                            "lnglat": "7981906,3147331",
                            "leaf": true
                        },
                        {
                            "text": "噶尔县",
                            "id": "542523",
                            "lnglat": "8005495,3211830",
                            "leaf": true
                        },
                        {
                            "text": "日土县",
                            "id": "542524",
                            "lnglat": "7965429,3342107",
                            "leaf": true
                        },
                        {
                            "text": "革吉县",
                            "id": "542525",
                            "lnglat": "8111592,3239300",
                            "leaf": true
                        },
                        {
                            "text": "改则县",
                            "id": "542526",
                            "lnglat": "8406164,3230413",
                            "leaf": true
                        },
                        {
                            "text": "措勤县",
                            "id": "542527",
                            "lnglat": "8516396,3102069",
                            "leaf": true
                        }
                    ]
                }
            ]
        },
        {
            "text": "贵州省",
            "id": "520000",
            "lnglat": "10671390,2658719",
            "children": [
                {
                    "text": "贵阳市",
                    "id": "520100",
                    "lnglat": "10671390,2658719",
                    "children": [
                        {
                            "text": "南明区",
                            "id": "520102",
                            "lnglat": "10671120,2657129",
                            "leaf": true
                        },
                        {
                            "text": "云岩区",
                            "id": "520103",
                            "lnglat": "10670322,2659399",
                            "leaf": true
                        },
                        {
                            "text": "花溪区",
                            "id": "520111",
                            "lnglat": "10667359,2643712",
                            "leaf": true
                        },
                        {
                            "text": "乌当区",
                            "id": "520112",
                            "lnglat": "10676059,2663476",
                            "leaf": true
                        },
                        {
                            "text": "白云区",
                            "id": "520113",
                            "lnglat": "10662331,2668815",
                            "leaf": true
                        },
                        {
                            "text": "小河区",
                            "id": "520114",
                            "lnglat": "10669202,2650934",
                            "leaf": true
                        },
                        {
                            "text": "开阳县",
                            "id": "520121",
                            "lnglat": "10696447,2706040",
                            "leaf": true
                        },
                        {
                            "text": "息烽县",
                            "id": "520122",
                            "lnglat": "10673186,2709627",
                            "leaf": true
                        },
                        {
                            "text": "修文县",
                            "id": "520123",
                            "lnglat": "10659066,2684270",
                            "leaf": true
                        },
                        {
                            "text": "清镇市",
                            "id": "520181",
                            "lnglat": "10646717,2655800",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "遵义市",
                    "id": "520300",
                    "lnglat": "10691718,2769142",
                    "children": [
                        {
                            "text": "红花岗区",
                            "id": "520302",
                            "lnglat": "10692103,2768754",
                            "leaf": true
                        },
                        {
                            "text": "汇川区",
                            "id": "520303",
                            "lnglat": "10692097,2772158",
                            "leaf": true
                        },
                        {
                            "text": "遵义县",
                            "id": "520321",
                            "lnglat": "10682863,2754369",
                            "leaf": true
                        },
                        {
                            "text": "桐梓县",
                            "id": "520322",
                            "lnglat": "10682047,2814033",
                            "leaf": true
                        },
                        {
                            "text": "绥阳县",
                            "id": "520323",
                            "lnglat": "10718659,2795951",
                            "leaf": true
                        },
                        {
                            "text": "正安县",
                            "id": "520324",
                            "lnglat": "10743948,2855195",
                            "leaf": true
                        },
                        {
                            "text": "道真仡佬族苗族自治县",
                            "id": "520325",
                            "lnglat": "10759616,2888869",
                            "leaf": true
                        },
                        {
                            "text": "务川仡佬族苗族自治县",
                            "id": "520326",
                            "lnglat": "10788520,2852829",
                            "leaf": true
                        },
                        {
                            "text": "凤冈县",
                            "id": "520327",
                            "lnglat": "10772381,2797263",
                            "leaf": true
                        },
                        {
                            "text": "湄潭县",
                            "id": "520328",
                            "lnglat": "10747971,2777107",
                            "leaf": true
                        },
                        {
                            "text": "余庆县",
                            "id": "520329",
                            "lnglat": "10788907,2722070",
                            "leaf": true
                        },
                        {
                            "text": "习水县",
                            "id": "520330",
                            "lnglat": "10620874,2832302",
                            "leaf": true
                        },
                        {
                            "text": "赤水市",
                            "id": "520381",
                            "lnglat": "10569413,2859291",
                            "leaf": true
                        },
                        {
                            "text": "仁怀市",
                            "id": "520382",
                            "lnglat": "10641526,2781928",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "铜仁地区",
                    "id": "522200",
                    "lnglat": "10918765,2772080",
                    "children": [
                        {
                            "text": "铜仁市",
                            "id": "522201",
                            "lnglat": "10919001,2772177",
                            "leaf": true
                        },
                        {
                            "text": "江口县",
                            "id": "522222",
                            "lnglat": "10884369,2769542",
                            "leaf": true
                        },
                        {
                            "text": "玉屏侗族自治县",
                            "id": "522223",
                            "lnglat": "10891318,2723827",
                            "leaf": true
                        },
                        {
                            "text": "石阡县",
                            "id": "522224",
                            "lnglat": "10822566,2752154",
                            "leaf": true
                        },
                        {
                            "text": "思南县",
                            "id": "522225",
                            "lnglat": "10824820,2794206",
                            "leaf": true
                        },
                        {
                            "text": "印江土家族苗族自治县",
                            "id": "522226",
                            "lnglat": "10840067,2800139",
                            "leaf": true
                        },
                        {
                            "text": "德江县",
                            "id": "522227",
                            "lnglat": "10811594,2826564",
                            "leaf": true
                        },
                        {
                            "text": "沿河土家族自治县",
                            "id": "522228",
                            "lnglat": "10849017,2856617",
                            "leaf": true
                        },
                        {
                            "text": "松桃苗族自治县",
                            "id": "522229",
                            "lnglat": "10919665,2817404",
                            "leaf": true
                        },
                        {
                            "text": "万山特区",
                            "id": "522230",
                            "lnglat": "10921187,2752214",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "黔西南布依族苗族自治州",
                    "id": "522300",
                    "lnglat": "10489379,2509520",
                    "children": [
                        {
                            "text": "兴义市",
                            "id": "522301",
                            "lnglat": "10489239,2509198",
                            "leaf": true
                        },
                        {
                            "text": "兴仁县",
                            "id": "522322",
                            "lnglat": "10518427,2543770",
                            "leaf": true
                        },
                        {
                            "text": "普安县",
                            "id": "522323",
                            "lnglat": "10495054,2578988",
                            "leaf": true
                        },
                        {
                            "text": "晴隆县",
                            "id": "522324",
                            "lnglat": "10521317,2583614",
                            "leaf": true
                        },
                        {
                            "text": "贞丰县",
                            "id": "522325",
                            "lnglat": "10564961,2538885",
                            "leaf": true
                        },
                        {
                            "text": "望谟县",
                            "id": "522326",
                            "lnglat": "10609325,2516981",
                            "leaf": true
                        },
                        {
                            "text": "册亨县",
                            "id": "522327",
                            "lnglat": "10580794,2498070",
                            "leaf": true
                        },
                        {
                            "text": "安龙县",
                            "id": "522328",
                            "lnglat": "10546123,2510739",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "黔南布依族苗族自治州",
                    "id": "522700",
                    "lnglat": "10751413,2626107",
                    "children": [
                        {
                            "text": "都匀市",
                            "id": "522701",
                            "lnglat": "10751307,2626759",
                            "leaf": true
                        },
                        {
                            "text": "福泉市",
                            "id": "522702",
                            "lnglat": "10750504,2670258",
                            "leaf": true
                        },
                        {
                            "text": "荔波县",
                            "id": "522722",
                            "lnglat": "10788521,2541633",
                            "leaf": true
                        },
                        {
                            "text": "贵定县",
                            "id": "522723",
                            "lnglat": "10722407,2658781",
                            "leaf": true
                        },
                        {
                            "text": "瓮安县",
                            "id": "522725",
                            "lnglat": "10747175,2707118",
                            "leaf": true
                        },
                        {
                            "text": "独山县",
                            "id": "522726",
                            "lnglat": "10753996,2583245",
                            "leaf": true
                        },
                        {
                            "text": "平塘县",
                            "id": "522727",
                            "lnglat": "10731876,2583472",
                            "leaf": true
                        },
                        {
                            "text": "罗甸县",
                            "id": "522728",
                            "lnglat": "10674779,2543092",
                            "leaf": true
                        },
                        {
                            "text": "长顺县",
                            "id": "522729",
                            "lnglat": "10644721,2602535",
                            "leaf": true
                        },
                        {
                            "text": "龙里县",
                            "id": "522730",
                            "lnglat": "10697410,2645077",
                            "leaf": true
                        },
                        {
                            "text": "惠水县",
                            "id": "522731",
                            "lnglat": "10665697,2613993",
                            "leaf": true
                        },
                        {
                            "text": "三都水族自治县",
                            "id": "522732",
                            "lnglat": "10787007,2598864",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "黔东南苗族侗族自治州",
                    "id": "522600",
                    "lnglat": "10706885,2658712",
                    "children": [
                        {
                            "text": "凯里市",
                            "id": "522601",
                            "lnglat": "10797131,2658813",
                            "leaf": true
                        },
                        {
                            "text": "黄平县",
                            "id": "522622",
                            "lnglat": "10789692,2690196",
                            "leaf": true
                        },
                        {
                            "text": "施秉县",
                            "id": "522623",
                            "lnglat": "10812168,2703729",
                            "leaf": true
                        },
                        {
                            "text": "三穗县",
                            "id": "522624",
                            "lnglat": "10867727,2696978",
                            "leaf": true
                        },
                        {
                            "text": "镇远县",
                            "id": "522625",
                            "lnglat": "10842096,2705409",
                            "leaf": true
                        },
                        {
                            "text": "岑巩县",
                            "id": "522626",
                            "lnglat": "10874578,2721119",
                            "leaf": true
                        },
                        {
                            "text": "天柱县",
                            "id": "522627",
                            "lnglat": "10920229,2691244",
                            "leaf": true
                        },
                        {
                            "text": "锦屏县",
                            "id": "522628",
                            "lnglat": "10919499,2668443",
                            "leaf": true
                        },
                        {
                            "text": "剑河县",
                            "id": "522629",
                            "lnglat": "10858387,2665598",
                            "leaf": true
                        },
                        {
                            "text": "台江县",
                            "id": "522630",
                            "lnglat": "10831013,2667621",
                            "leaf": true
                        },
                        {
                            "text": "黎平县",
                            "id": "522631",
                            "lnglat": "10913273,2623632",
                            "leaf": true
                        },
                        {
                            "text": "榕江县",
                            "id": "522632",
                            "lnglat": "10851746,2593551",
                            "leaf": true
                        },
                        {
                            "text": "从江县",
                            "id": "522633",
                            "lnglat": "10890806,2575096",
                            "leaf": true
                        },
                        {
                            "text": "雷山县",
                            "id": "522634",
                            "lnglat": "10807385,2638957",
                            "leaf": true
                        },
                        {
                            "text": "麻江县",
                            "id": "522635",
                            "lnglat": "10759136,2649883",
                            "leaf": true
                        },
                        {
                            "text": "丹寨县",
                            "id": "522636",
                            "lnglat": "10779465,2620116",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "六盘水市",
                    "id": "520200",
                    "lnglat": "10484340,2658937",
                    "children": [
                        {
                            "text": "钟山区",
                            "id": "520201",
                            "lnglat": "10484216,2659195",
                            "leaf": true
                        },
                        {
                            "text": "六枝特区",
                            "id": "520203",
                            "lnglat": "10548268,2620491",
                            "leaf": true
                        },
                        {
                            "text": "水城县",
                            "id": "520221",
                            "lnglat": "10487343,2657784",
                            "leaf": true
                        },
                        {
                            "text": "盘县",
                            "id": "520222",
                            "lnglat": "10446531,2571806",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "毕节地区",
                    "id": "522400",
                    "lnglat": "10528305,2730777",
                    "children": [
                        {
                            "text": "毕节市",
                            "id": "522401",
                            "lnglat": "10528534,2729914",
                            "leaf": true
                        },
                        {
                            "text": "大方县",
                            "id": "522422",
                            "lnglat": "10560544,2714666",
                            "leaf": true
                        },
                        {
                            "text": "黔西县",
                            "id": "522423",
                            "lnglat": "10602853,2703027",
                            "leaf": true
                        },
                        {
                            "text": "金沙县",
                            "id": "522424",
                            "lnglat": "10621654,2746303",
                            "leaf": true
                        },
                        {
                            "text": "织金县",
                            "id": "522425",
                            "lnglat": "10576684,2666831",
                            "leaf": true
                        },
                        {
                            "text": "纳雍县",
                            "id": "522426",
                            "lnglat": "10537503,2678114",
                            "leaf": true
                        },
                        {
                            "text": "威宁彝族回族苗族自治县",
                            "id": "522427",
                            "lnglat": "10418031,2698183",
                            "leaf": true
                        },
                        {
                            "text": "赫章县",
                            "id": "522428",
                            "lnglat": "10472268,2712736",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "安顺市",
                    "id": "520400",
                    "lnglat": "10592962,2624898",
                    "children": [
                        {
                            "text": "西秀区",
                            "id": "520402",
                            "lnglat": "10605264,2619622",
                            "leaf": true
                        },
                        {
                            "text": "平坝县",
                            "id": "520421",
                            "lnglat": "10625861,2641912",
                            "leaf": true
                        },
                        {
                            "text": "普定县",
                            "id": "520422",
                            "lnglat": "10574764,2631113",
                            "leaf": true
                        },
                        {
                            "text": "镇宁布依族苗族自治县",
                            "id": "520423",
                            "lnglat": "10576144,2605698",
                            "leaf": true
                        },
                        {
                            "text": "关岭布依族苗族自治县",
                            "id": "520424",
                            "lnglat": "10561343,2594750",
                            "leaf": true
                        },
                        {
                            "text": "紫云苗族布依族自治县",
                            "id": "520425",
                            "lnglat": "10607990,2575498",
                            "leaf": true
                        }
                    ]
                }
            ]
        },
        {
            "text": "广西壮族自治区",
            "id": "450000",
            "lnglat": "10833199,2282527",
            "children": [
                {
                    "text": "南宁市",
                    "id": "450100",
                    "lnglat": "10833199,2282527",
                    "children": [
                        {
                            "text": "兴宁区",
                            "id": "450102",
                            "lnglat": "10831087,2282331",
                            "leaf": true
                        },
                        {
                            "text": "青秀区",
                            "id": "450103",
                            "lnglat": "10834474,2282587",
                            "leaf": true
                        },
                        {
                            "text": "江南区",
                            "id": "450105",
                            "lnglat": "10831406,2279353",
                            "leaf": true
                        },
                        {
                            "text": "西乡塘区",
                            "id": "450107",
                            "lnglat": "10830941,2283672",
                            "leaf": true
                        },
                        {
                            "text": "良庆区",
                            "id": "450108",
                            "lnglat": "10833830,2272908",
                            "leaf": true
                        },
                        {
                            "text": "邕宁区",
                            "id": "450109",
                            "lnglat": "10848025,2275516",
                            "leaf": true
                        },
                        {
                            "text": "武鸣县",
                            "id": "450122",
                            "lnglat": "10826790,2316436",
                            "leaf": true
                        },
                        {
                            "text": "隆安县",
                            "id": "450123",
                            "lnglat": "10768521,2317900",
                            "leaf": true
                        },
                        {
                            "text": "马山县",
                            "id": "450124",
                            "lnglat": "10817225,2371542",
                            "leaf": true
                        },
                        {
                            "text": "上林县",
                            "id": "450125",
                            "lnglat": "10858890,2343797",
                            "leaf": true
                        },
                        {
                            "text": "宾阳县",
                            "id": "450126",
                            "lnglat": "10880908,2321980",
                            "leaf": true
                        },
                        {
                            "text": "横县",
                            "id": "450127",
                            "lnglat": "10927271,2268839",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "玉林市",
                    "id": "450900",
                    "lnglat": "11014988,2262932",
                    "children": [
                        {
                            "text": "玉州区",
                            "id": "450902",
                            "lnglat": "11014515,2263013",
                            "leaf": true
                        },
                        {
                            "text": "容县",
                            "id": "450921",
                            "lnglat": "11055014,2286334",
                            "leaf": true
                        },
                        {
                            "text": "陆川县",
                            "id": "450922",
                            "lnglat": "11024906,2230903",
                            "leaf": true
                        },
                        {
                            "text": "博白县",
                            "id": "450923",
                            "lnglat": "10997707,2227752",
                            "leaf": true
                        },
                        {
                            "text": "兴业县",
                            "id": "450924",
                            "lnglat": "10986763,2274838",
                            "leaf": true
                        },
                        {
                            "text": "北流市",
                            "id": "450981",
                            "lnglat": "11035140,2270608",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "梧州市",
                    "id": "450400",
                    "lnglat": "11130054,2347352",
                    "children": [
                        {
                            "text": "万秀区",
                            "id": "450403",
                            "lnglat": "11131944,2347635",
                            "leaf": true
                        },
                        {
                            "text": "蝶山区",
                            "id": "450404",
                            "lnglat": "11130001,2347367",
                            "leaf": true
                        },
                        {
                            "text": "长洲区",
                            "id": "450405",
                            "lnglat": "11126952,2348811",
                            "leaf": true
                        },
                        {
                            "text": "苍梧县",
                            "id": "450421",
                            "lnglat": "11123984,2342485",
                            "leaf": true
                        },
                        {
                            "text": "藤县",
                            "id": "450422",
                            "lnglat": "11090945,2337908",
                            "leaf": true
                        },
                        {
                            "text": "蒙山县",
                            "id": "450423",
                            "lnglat": "11052131,2420427",
                            "leaf": true
                        },
                        {
                            "text": "岑溪市",
                            "id": "450481",
                            "lnglat": "11099116,2292772",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "钦州市",
                    "id": "450700",
                    "lnglat": "10862040,2196307",
                    "children": [
                        {
                            "text": "钦南区",
                            "id": "450702",
                            "lnglat": "10861561,2194924",
                            "leaf": true
                        },
                        {
                            "text": "钦北区",
                            "id": "450703",
                            "lnglat": "10861596,2194812",
                            "leaf": true
                        },
                        {
                            "text": "灵山县",
                            "id": "450721",
                            "lnglat": "10929415,2242868",
                            "leaf": true
                        },
                        {
                            "text": "浦北县",
                            "id": "450722",
                            "lnglat": "10954926,2227488",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "柳州市",
                    "id": "450200",
                    "lnglat": "10940536,2431427",
                    "children": [
                        {
                            "text": "城中区",
                            "id": "450202",
                            "lnglat": "10940597,2431849",
                            "leaf": true
                        },
                        {
                            "text": "鱼峰区",
                            "id": "450203",
                            "lnglat": "10939796,2430863",
                            "leaf": true
                        },
                        {
                            "text": "柳南区",
                            "id": "450204",
                            "lnglat": "10936980,2431994",
                            "leaf": true
                        },
                        {
                            "text": "柳北区",
                            "id": "450205",
                            "lnglat": "10940536,2433451",
                            "leaf": true
                        },
                        {
                            "text": "柳江县",
                            "id": "450221",
                            "lnglat": "10932615,2425458",
                            "leaf": true
                        },
                        {
                            "text": "柳城县",
                            "id": "450222",
                            "lnglat": "10923351,2465279",
                            "leaf": true
                        },
                        {
                            "text": "鹿寨县",
                            "id": "450223",
                            "lnglat": "10973760,2448941",
                            "leaf": true
                        },
                        {
                            "text": "融安县",
                            "id": "450224",
                            "lnglat": "10939232,2522182",
                            "leaf": true
                        },
                        {
                            "text": "融水苗族自治县",
                            "id": "450225",
                            "lnglat": "10924776,2507268",
                            "leaf": true
                        },
                        {
                            "text": "三江侗族自治县",
                            "id": "450226",
                            "lnglat": "10959664,2578454",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "贺州市",
                    "id": "451100",
                    "lnglat": "11154023,2441308",
                    "children": [
                        {
                            "text": "八步区",
                            "id": "451102",
                            "lnglat": "11154774,2441701",
                            "leaf": true
                        },
                        {
                            "text": "昭平县",
                            "id": "451121",
                            "lnglat": "11080554,2417106",
                            "leaf": true
                        },
                        {
                            "text": "钟山县",
                            "id": "451122",
                            "lnglat": "11130146,2452522",
                            "leaf": true
                        },
                        {
                            "text": "富川瑶族自治县",
                            "id": "451123",
                            "lnglat": "11128192,2482067",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "河池市",
                    "id": "451200",
                    "lnglat": "10805621,2469723",
                    "children": [
                        {
                            "text": "金城江区",
                            "id": "451202",
                            "lnglat": "10805912,2470063",
                            "leaf": true
                        },
                        {
                            "text": "南丹县",
                            "id": "451221",
                            "lnglat": "10753758,2498049",
                            "leaf": true
                        },
                        {
                            "text": "天峨县",
                            "id": "451222",
                            "lnglat": "10714885,2499427",
                            "leaf": true
                        },
                        {
                            "text": "凤山县",
                            "id": "451223",
                            "lnglat": "10704423,2454546",
                            "leaf": true
                        },
                        {
                            "text": "东兰县",
                            "id": "451224",
                            "lnglat": "10738333,2450891",
                            "leaf": true
                        },
                        {
                            "text": "罗城仫佬族自治县",
                            "id": "451225",
                            "lnglat": "10889465,2478434",
                            "leaf": true
                        },
                        {
                            "text": "环江毛南族自治县",
                            "id": "451226",
                            "lnglat": "10825649,2483302",
                            "leaf": true
                        },
                        {
                            "text": "巴马瑶族自治县",
                            "id": "451227",
                            "lnglat": "10724290,2414432",
                            "leaf": true
                        },
                        {
                            "text": "都安瑶族自治县",
                            "id": "451228",
                            "lnglat": "10809481,2393598",
                            "leaf": true
                        },
                        {
                            "text": "大化瑶族自治县",
                            "id": "451229",
                            "lnglat": "10798871,2374705",
                            "leaf": true
                        },
                        {
                            "text": "宜州市",
                            "id": "451281",
                            "lnglat": "10866368,2449735",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "桂林市",
                    "id": "450300",
                    "lnglat": "11028430,2527710",
                    "children": [
                        {
                            "text": "秀峰区",
                            "id": "450302",
                            "lnglat": "11028660,2528385",
                            "leaf": true
                        },
                        {
                            "text": "叠彩区",
                            "id": "450303",
                            "lnglat": "11029542,2529559",
                            "leaf": true
                        },
                        {
                            "text": "象山区",
                            "id": "450304",
                            "lnglat": "11027411,2526675",
                            "leaf": true
                        },
                        {
                            "text": "七星区",
                            "id": "450305",
                            "lnglat": "11031564,2525945",
                            "leaf": true
                        },
                        {
                            "text": "雁山区",
                            "id": "450311",
                            "lnglat": "11028058,2524641",
                            "leaf": true
                        },
                        {
                            "text": "阳朔县",
                            "id": "450321",
                            "lnglat": "11048829,2477340",
                            "leaf": true
                        },
                        {
                            "text": "临桂县",
                            "id": "450322",
                            "lnglat": "11020716,2524183",
                            "leaf": true
                        },
                        {
                            "text": "灵川县",
                            "id": "450323",
                            "lnglat": "11031644,2541642",
                            "leaf": true
                        },
                        {
                            "text": "全州县",
                            "id": "450324",
                            "lnglat": "11106419,2593372",
                            "leaf": true
                        },
                        {
                            "text": "兴安县",
                            "id": "450325",
                            "lnglat": "11066591,2561378",
                            "leaf": true
                        },
                        {
                            "text": "永福县",
                            "id": "450326",
                            "lnglat": "10998123,2499031",
                            "leaf": true
                        },
                        {
                            "text": "灌阳县",
                            "id": "450327",
                            "lnglat": "11115180,2548904",
                            "leaf": true
                        },
                        {
                            "text": "龙胜各族自治县",
                            "id": "450328",
                            "lnglat": "11000724,2579822",
                            "leaf": true
                        },
                        {
                            "text": "资源县",
                            "id": "450329",
                            "lnglat": "11064275,2603600",
                            "leaf": true
                        },
                        {
                            "text": "平乐县",
                            "id": "450330",
                            "lnglat": "11063949,2463641",
                            "leaf": true
                        },
                        {
                            "text": "荔浦县",
                            "id": "450331",
                            "lnglat": "11040160,2453390",
                            "leaf": true
                        },
                        {
                            "text": "恭城瑶族自治县",
                            "id": "450332",
                            "lnglat": "11082271,2483388",
                            "leaf": true
                        },
                        {
                            "text": "荔蒲县",
                            "id": "450331",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "贵港市",
                    "id": "450800",
                    "lnglat": "10959715,2309139",
                    "children": [
                        {
                            "text": "港北区",
                            "id": "450802",
                            "lnglat": "10960600,2309059",
                            "leaf": true
                        },
                        {
                            "text": "港南区",
                            "id": "450803",
                            "lnglat": "10976109,2295359",
                            "leaf": true
                        },
                        {
                            "text": "覃塘区",
                            "id": "450804",
                            "lnglat": "10941527,2314232",
                            "leaf": true
                        },
                        {
                            "text": "平南县",
                            "id": "450821",
                            "lnglat": "11038682,2354638",
                            "leaf": true
                        },
                        {
                            "text": "桂平市",
                            "id": "450881",
                            "lnglat": "11007359,2339867",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "防城港市",
                    "id": "450600",
                    "lnglat": "10834266,2161852",
                    "children": [
                        {
                            "text": "港口区",
                            "id": "450602",
                            "lnglat": "10836915,2164595",
                            "leaf": true
                        },
                        {
                            "text": "防城区",
                            "id": "450603",
                            "lnglat": "10835459,2176412",
                            "leaf": true
                        },
                        {
                            "text": "上思县",
                            "id": "450621",
                            "lnglat": "10798116,2215662",
                            "leaf": true
                        },
                        {
                            "text": "东兴市",
                            "id": "450681",
                            "lnglat": "10797052,2154516",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "北海市",
                    "id": "450500",
                    "lnglat": "10911769,2148321",
                    "children": [
                        {
                            "text": "海城区",
                            "id": "450502",
                            "lnglat": "10911635,2148088",
                            "leaf": true
                        },
                        {
                            "text": "银海区",
                            "id": "450503",
                            "lnglat": "10913558,2148992",
                            "leaf": true
                        },
                        {
                            "text": "铁山港区",
                            "id": "450512",
                            "lnglat": "10944202,2153634",
                            "leaf": true
                        },
                        {
                            "text": "合浦县",
                            "id": "450521",
                            "lnglat": "10918629,2166835",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "百色市",
                    "id": "451000",
                    "lnglat": "10663085,2390521",
                    "children": [
                        {
                            "text": "右江区",
                            "id": "451002",
                            "lnglat": "10661662,2390412",
                            "leaf": true
                        },
                        {
                            "text": "田阳县",
                            "id": "451021",
                            "lnglat": "10690980,2374235",
                            "leaf": true
                        },
                        {
                            "text": "田东县",
                            "id": "451022",
                            "lnglat": "10711221,2360797",
                            "leaf": true
                        },
                        {
                            "text": "平果县",
                            "id": "451023",
                            "lnglat": "10758070,2331793",
                            "leaf": true
                        },
                        {
                            "text": "德保县",
                            "id": "451024",
                            "lnglat": "10661492,2333314",
                            "leaf": true
                        },
                        {
                            "text": "靖西县",
                            "id": "451025",
                            "lnglat": "10641828,2311762",
                            "leaf": true
                        },
                        {
                            "text": "那坡县",
                            "id": "451026",
                            "lnglat": "10583940,2341163",
                            "leaf": true
                        },
                        {
                            "text": "凌云县",
                            "id": "451027",
                            "lnglat": "10656907,2434913",
                            "leaf": true
                        },
                        {
                            "text": "乐业县",
                            "id": "451028",
                            "lnglat": "10655956,2479015",
                            "leaf": true
                        },
                        {
                            "text": "田林县",
                            "id": "451029",
                            "lnglat": "10622735,2429788",
                            "leaf": true
                        },
                        {
                            "text": "西林县",
                            "id": "451030",
                            "lnglat": "10509338,2449285",
                            "leaf": true
                        },
                        {
                            "text": "隆林各族自治县",
                            "id": "451031",
                            "lnglat": "10533843,2477461",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "来宾市",
                    "id": "451300",
                    "lnglat": "10923091,2373153",
                    "children": [
                        {
                            "text": "兴宾区",
                            "id": "451302",
                            "lnglat": "10923077,2373127",
                            "leaf": true
                        },
                        {
                            "text": "忻城县",
                            "id": "451321",
                            "lnglat": "10866671,2406857",
                            "leaf": true
                        },
                        {
                            "text": "象州县",
                            "id": "451322",
                            "lnglat": "10967894,2395988",
                            "leaf": true
                        },
                        {
                            "text": "武宣县",
                            "id": "451323",
                            "lnglat": "10965299,2359718",
                            "leaf": true
                        },
                        {
                            "text": "金秀瑶族自治县",
                            "id": "451324",
                            "lnglat": "11018954,2413145",
                            "leaf": true
                        },
                        {
                            "text": "合山市",
                            "id": "451381",
                            "lnglat": "10888011,2381190",
                            "leaf": true
                        }
                    ]
                },
                {
                    "text": "崇左市",
                    "id": "451400",
                    "lnglat": "10735153,2241841",
                    "children": [
                        {
                            "text": "江州区",
                            "id": "451402",
                            "lnglat": "10745010,2253308",
                            "leaf": true
                        },
                        {
                            "text": "扶绥县",
                            "id": "451421",
                            "lnglat": "10791146,2263855",
                            "leaf": true
                        },
                        {
                            "text": "宁明县",
                            "id": "451422",
                            "lnglat": "10706307,2213782",
                            "leaf": true
                        },
                        {
                            "text": "龙州县",
                            "id": "451423",
                            "lnglat": "10684975,2235123",
                            "leaf": true
                        },
                        {
                            "text": "大新县",
                            "id": "451424",
                            "lnglat": "10719538,2283792",
                            "leaf": true
                        },
                        {
                            "text": "天等县",
                            "id": "451425",
                            "lnglat": "10713305,2308307",
                            "leaf": true
                        },
                        {
                            "text": "凭祥市",
                            "id": "451481",
                            "lnglat": "10675039,2210960",
                            "leaf": true
                        }
                    ]
                }
            ]
        },
        {
            "text": "香港特别行政区",
            "id": "810000",
            "lnglat": "11418144,2231881",
            "leaf": true
        },
        {
            "text": "澳门特别行政区",
            "id": "820000",
            "lnglat": "11355438,2219907",
            "leaf": true
        }
    ]
}
]